// Static Data Dictionaries Extracted from Android Application Source Code

window.MAPBOX_TOKEN = 'sk.eyJ1IjoibXNoYXJpLWFsam9oYW5pIiwiYSI6ImNscDRodndqczB4NzEya21pdXNjNDJ6MjUifQ.cm9WGcmnAXTlF0a-BdfgTA';

window.TOURISM_DATA = [
  {
    lat: 26.69695438534737,
    lng: 37.98229033124041,
    title: "جبل الفيل",
    description: "جبل الفيل من العجائب الجيولوجية في مدينة العلا بالمملكة العربية السعودية ويقع ’’جبل الفيل’’ في منطقة متسعة تكسوها الرمال الذهبية على بعد 7 كم إلى جهة الشرق من محافظة العلا التابعة لمنطقة المدينة المنورة. وهو عبارة عن صخرة عملاقة من الحجر الرملي الطبيعي يبلغ ارتفاعها عن الأرض 52 مترا، ويجسد الجبل الشهير شكل خرطوم يلامس الأرض وجسد الفيل، ونُحت بفعل قوة الطبيعة على مدار ملايين السنين من عوامل الحتّ والتعرية بالرياح والماء. يعتبر من أقدم المعالم السياحية التاريخية الأثرية في المملكة.",
    image: "feel.jpg",
    region: "منطقة المدينة المنورة"
  },
  {
    lat: 27.049444444444447,
    lng: 37.76583333333333,
    title: "قوس مقرط الدبوس شمال العلا",
    description: "يعد جبل القوس، المعروف أيضاً باسم ’مقرط الدبوس’ ويقع على بعد 60 كم شمال العلا، أحد أشهر التكوينات الصخرية في صحراء العلا، ويمتاز بهيكله على شكل الجسر، والذي يشبه قوس قزح محاط بسحابتين، هو مشهد نادر بالفعل، كما تحيط بهذا الجبل مترامي الأطراف من الحجر الرملي ماسات صحراوية شبه كريمة، ويمكنك مشاهدة هذه القطع متعددة الألوان من الكوارتز المضمنة في الصخرة نفسها والمنتشرة على الأرض المحيطة بها. نتج هذا القوس عن طريق عمليات التعرية والحت التفاضلية في صخور الحجر الرملي.",
    image: "daboos.jpg",
    region: "منطقة المدينة المنورة"
  },
  {
    lat: 27.35944,
    lng: 37.79556,
    title: "غراميل العلا",
    description: "غراميل هي منطقة جبلية في شمال غرب المملكة العربية السعودية، في محافظة العلا باتجاه منطقة تبوك التي تبعد عنها 300 كيلومتر، فهي تكوينات صخرية حمراء ذات أشكال متفاوتة نحتتها الرياح على مر الأزمنة، لتصبح أيقونة فريدة في مشهد صحراوي ساحر، وهي من المناطق المرتفعة التي يمكن رؤية مجرة درب التبانة بوضوح من خلالها.",
    image: "gramel.jpg",
    region: "منطقة المدينة المنورة"
  },
  {
    lat: 24.38472,
    lng: 39.83053,
    title: "بركان جبل الملساء",
    description: "تحتوي حرة رهط على أكثر من 700 فوهة بركانية. وهي واحد من 12 حقلًا بركانيًا في المملكة تغطي ما يقارب من 80000 كيلومتر مربع. وتقع حرة رهط ضمن سلسلة الطفوح البركانية بمنطقة المدينة المنورة.",
    image: "malsaa.jpg",
    region: "منطقة المدينة المنورة"
  },
  {
    lat: 25.66943,
    lng: 39.92270,
    title: "بركان جبل البيضاء بحرة خيبر",
    description: "حرة خيبر او بني رشيد واحدة من اكبر الحقول البركانية ،و تغطي مساحة تقدر بأكثر من 14،000 كيلومتر مربع الى الشمال من المدينة المنورة. يتكون جبل البيضاء والذي يأخذ اللون المائل للأبيض والمكونة من صخور بركانية من نوع الكومندايت.",
    image: "baidaa.jpg",
    region: "منطقة المدينة المنورة"
  },
  {
    lat: 25.71806,
    lng: 39.95165,
    title: "جبل القدر",
    description: "جبل القِدر هو جبل بركاني خامد يقع في منطقة المدينة المنورة غرب المملكة، ويقع تحديداً في حرة خيبر. يبلغ ارتفاع الجبل نحو 2022 م. تم تصنيفه واختياره ضمن أفضل 100 موقع جيولوجي من الاتحاد الدولي للعلوم الجيولوجية ومنظمة الأمم المتحدة للتربية والعلم والثقافة (اليونسكو).",
    image: "qadar.jpg",
    region: "منطقة المدينة المنورة"
  },
  {
    lat: 27.428639,
    lng: 38.073980,
    title: "صخرة \"العروسة\"",
    description: "صخرة \"العروسة\" ، التي تقع شمال محافظة العلا بقرابة 100كلم، هي واحدة من مئات التشكيلات الصخرية التي تشتهر بها المحافظة، تشابه بشكلها الفريد العروسة التي ترتدي فستان زفافها شُكّلت على مدى آلاف السنين.",
    image: "arosa.png",
    region: "منطقة المدينة المنورة"
  },
  {
    lat: 26.807940962929095,
    lng: 37.96896232009935,
    title: "مدائن صالح",
    description: "تقع مدائن صالح أو ما تُدعى بالحِجر في منطقة المدينة المنورة وتبُعد 20 كم شمال مدينة العُلا. يُعد الموقع أكبر مُدن الأنباط بعد عاصمتهم البتراء. يضّم الموقع 131 مقبرة تمّ نحتها وبناؤها في الصخور المُحيطة.",
    image: "saleh.jpg",
    region: "منطقة المدينة المنورة"
  },
  {
    lat: 24.568856777923962,
    lng: 38.308616488288415,
    title: "جبل رضوى",
    description: "جبل رضوى هو جبل يقع في محافظة ينبع بمنطقة المدينة المنورة ويبلغ ارتفاعه 2170 متراً. يعتبر من أشهر جبال المدينة المنورة ويتميز بارتفاعه وجماله وشهرته على مر التاريخ.",
    image: "radwa.jpg",
    region: "منطقة المدينة المنورة"
  },
  {
    lat: 24.08583,
    lng: 46.16333,
    title: "جبل طويق",
    description: "جبل طويق عبارة عن هضبة ضيقة من الصخر الجيري ويمتد لما يقارب 800 كلم من صحراء نفود الثويرات في الزلفي شمالًا وحتى مشارف وادي الدواسر والربع الخالي جنوبًا.",
    image: "towaiq.jpg",
    region: "منطقة الرياض"
  },
  {
    lat: 24.487409447422706,
    lng: 46.997068208119906,
    title: "دحول عين هيت",
    description: "تقع دحول عين هيت في جنوب شرق مدينة الرياض بالقرب من مدينة الخرج، وتعتبر مدخلاً لخزان ماء جوفي واسع يقع على عمق كبير تحت سطح الأرض.",
    image: "ainhet.jpg",
    region: "منطقة الرياض"
  },
  {
    lat: 26.459790089123846,
    lng: 47.233596147624105,
    title: "كهف الطحالب الخضراء",
    description: "’’دحل الطحلب أو الدحل الأخضر’’ يعد أحد الروافد الاقتصادية للمملكة لكونه ثروة وطنية لمعرفة التاريخ الجيولوجي والطبيعي للجزيرة العربية. يقع في الشمال الشرقي من مدينة الرياض.",
    image: "green.jpg",
    region: "منطقة الرياض"
  },
  {
    lat: 20.15993,
    lng: 44.18501,
    title: "مائدة جبال سنامة بوادي الدواسر",
    description: "الموائد الصخرية أو ’’الفطر’’ يبلغ عددها في المملكة أكثر من مائة مائدة وهي عبارة عن تشكيلات صخرية جيومورفولوجية، تنتشر بشكل واسع في منطقة الغطاء الرسوبي.",
    image: "snamh.jpg",
    region: "منطقة الرياض"
  },
  {
    lat: 22.57565277671039,
    lng: 46.523759235399496,
    title: "جبل التوباد",
    description: "يقع جبل التوباد في مدينة الأفلاج جنوب غرب مدينة الرياض بمسافة 350 كم. شاهد على قصة حب ليلى العامرية وقيس بن الملوح.",
    image: "tobad.jpg",
    region: "منطقة الرياض"
  },
  {
    lat: 25.456631252769498,
    lng: 46.53794593254467,
    title: "وادي الطوقي",
    description: "يعد وادي الطوقي أحد أطول الأودية في المملكة، ويتميز بالطبيعة الجبلية الفريدة، والشلالات الطبيعية، والصخور والأشجار وخاصة أشجار الطلح.",
    image: "toqy.png",
    region: "منطقة الرياض"
  },
  {
    lat: 26.52183,
    lng: 43.56406,
    title: "صخرة عنترة",
    description: "تقع صخرة عنترة في مركز غاف في عيون الجواء بمنطقة القصيم .تحتوي واجهة الصخرة على مجموعة من النقوش الثمودية والأشكال الحيوانية المتنوعة.",
    image: "antra.jpg",
    region: "منطقة القصيم"
  },
  {
    lat: 26.78831,
    lng: 43.46728,
    title: "جبل الحصان",
    description: "يقع جبل الحصان في شمال منطقة القوارة أحد مراكز منطقة القصيم. حيث تبلغ مساحته 0.20 كيلومتر، ويبلغ ارتفاعه 2200 قدم عن سطح البحر.",
    image: "hourse.jpg",
    region: "منطقة القصيم"
  },
  {
    lat: 18.03617,
    lng: 42.85958,
    title: "قرية الحبلة",
    description: "تعتبر منطقة الحبلة من أهم مناطق الجذب السياحي في منطقة عسير، حيث أنها تتميز بالقطوع العمودية الطويلة في الجبال، وتتواجد على ارتفاع يزيد عن 2000 متر فوق سطح البحر.",
    image: "hablah.jpg",
    region: "منطقة عسير"
  },
  {
    lat: 18.10335,
    lng: 41.69648,
    title: "الأعمدة البازلتية",
    description: "أحد أبرز المواقع المميزة في عسير الأعمدة البازلتية في وادي يعوض في محافظة الحرجة، وقرية دبسا في محافظة البرك بمنطقة عسير. تشكلت الأعمدة البازلتية في أعقاب ثوران البراكين.",
    image: "columns.jpg",
    region: "منطقة عسير"
  },
  {
    lat: 18.97017,
    lng: 42.14545,
    title: "جبال تنومة",
    description: "تقع «تنومة» شمال منطقة عسير على الطريق الواصل بين مدينتي الطائف وعلى بعد 150 كيلومتراً من مدينة أبها. تتميز بالطبيعة الجبلية والشلالات والغابات.",
    image: "tanoma.jpg",
    region: "منطقة عسير"
  },
  {
    lat: 18.15167,
    lng: 41.53667,
    title: "جزيرة كدمبل",
    description: "تُعد جزيرة كدمبل الواقعة على ساحل منطقة عسير إحدى الجزر التابعة لمركز القحمة، من أجمل الجزر الطبيعية البكر تتميز برمالها البيضاء وجبلها الشامخ.",
    image: "kadmbl.jpg",
    region: "منطقة عسير"
  },
  {
    lat: 19.93108,
    lng: 42.689222,
    title: "جبل الصايرة ( الجيل الجليدي)",
    description: "يعتبر جبل الصايرة من أهم وأجمل المعالم في بيشة، حيث أنه يختلف عن الجبال المحيطة به لونه الأبيض اللامع المكون من الكوارتز.",
    image: "saira.jpg",
    region: "منطقة عسير"
  },
  {
    lat: 18.05113719186886,
    lng: 42.73239412262803,
    title: "جبل السودة",
    description: "يقع جبل السودة في المنطقة الجنوبية الغربية من المملكة ويبعُد حوالي 20 كيلومترًا عن مدينة أبها، ويحتل المرتبة الأولى كأعلى قمة جبلية بالمملكة بارتفاع 3015 متراً.",
    image: "soda.jpg",
    region: "منطقة عسير"
  },
  {
    lat: 18.202807822452655,
    lng: 42.824430246419524,
    title: "مدينة جُرش",
    description: "تقع مدينة جُرش الأثرية بين جبل حمومة الأثري وجبل شكر بمحافظة أحد رفيدة على بعد ١٥ كيلاً جنوبي محافظة خميس مشيط. تضم آثاراً تعود لفترات ما قبل الإسلام والإسلامية.",
    image: "jorash.jpg",
    region: "منطقة عسير"
  },
  {
    lat: 17.270841258966634,
    lng: 43.21709816048174,
    title: "العيون الحارة بالخوبة",
    description: "تحتضن الخوبة ينابيع كبريتية حارة تقع على بعد 75 كلم من وسط مدينة جيزان وتصل درجة حرارة المياه إلى 45-75 درجة مئوية.",
    image: "ainkoba.jpg",
    region: "منطقة جازان"
  },
  {
    lat: 17.60442,
    lng: 42.93065,
    title: "وادي لجب",
    description: "صدع وانكسار في الجزء الشرقي من جبل القهر بمحافظة الريث. يعتبر أخدوداً فريداً ببرك مياه جارية وتحيط به جبال شاهقة الارتفاع.",
    image: "lojb.jpg",
    region: "منطقة جازان"
  },
  {
    lat: 16.71167,
    lng: 42.00000,
    title: "جزيرة فَرَسان",
    description: "جزيرة فرسان هي أرخبيلٌ من الجزر الواقعة في الجهة الجنوبيّة من البحر الأحمر والتابعة لمنطقة جازان. تضم محميّات للشعاب المرجانية وغزال فرسان والطيور النادرة.",
    image: "farasan.jpg",
    region: "منطقة جازان"
  },
  {
    lat: 17.741230296084126,
    lng: 43.00296300918829,
    title: "جبال فيفا",
    description: "تقع جبال فيفا في أقصى الجنوب الغربي من المملكة شرق منطقة جازان. ترتفع حوالي 7 آلاف قدم وتتميز بمدرجاتها الزراعية الخضراء.",
    image: "fifa.jpg",
    region: "منطقة جازان"
  },
  {
    lat: 27.229629511423955,
    lng: 38.57167006038897,
    title: "صخرة تيماء",
    description: "حصاة النصلة جنوب تيماء بحوالي 70 كيلومتراً. شُطرت بفعل الطبيعة إلى نصفين متساوين بدقة هندسية مذهلة وتضم نقوشاً ثمودية عريقة.",
    image: "taima.jpg",
    region: "منطقة تبوك"
  },
  {
    lat: 27.60218,
    lng: 36.42043,
    title: "وادي الديسة",
    description: "يقع وادي الديسة في منطقة تبوك، ويُعرف بجباله الحمراء الشاهقة وأشجار النخل والريحان والينابيع العذبة التدفق.",
    image: "desa.jpg",
    region: "منطقة تبوك"
  },
  {
    lat: 27.94278,
    lng: 34.56667,
    title: "جزيرتا تيران وصنافير",
    description: "تقعان في مدخل خليج العقبة ومضيق تيران، وتتميزان بالشعاب المرجانية العائمة والمياه الكريستالية الصافية وهي مقصد عالمي للغوص.",
    image: "teran.jpg",
    region: "منطقة تبوك"
  },
  {
    lat: 26.250962,
    lng: 37.214550,
    title: "جبل الغلالة",
    description: "جبل الغلالة يقع ما بين محافظة العلا ومحافظة تيماء، ويتميز بشكله الفريد وتجاويفه وغيرانه الطبيعية.",
    image: "galala.jpg",
    region: "منطقة تبوك"
  },
  {
    lat: 28.645890609583006,
    lng: 35.28609046334625,
    title: "جبل اللوز",
    description: "يقع جبل اللوز شمال غرب المملكة بارتفاع 2549 متر فوق سطح البحر. يكتسي بالثلوج في فصل الشتاء ويضم نقوشاً صخرية يعود تاريخها لـ 10,000 سنة.",
    image: "loza.jpg",
    region: "منطقة تبوك"
  },
  {
    lat: 22.901400236646616,
    lng: 41.139195892201144,
    title: "مقلع طمية (فوهة الوعبة)",
    description: "فوهة الوعبة عبارة عن حفرة بركانية عميقة بقطر 3 كيلومترات وبعمق 380 متراً في حرة كشب، وتغطي قاعها طبقة ملحية بيضاء ساطعة.",
    image: "taimaa2.jpg",
    region: "منطقة مكة المكرمة"
  },
  {
    lat: 19.68333,
    lng: 40.73889,
    title: "جزيرة أم العود",
    description: "جزيرة مرجانية تقع برأس محيسن بالبحر الأحمر وتتميز بشواطئها المرجانية الخلابة والرمال البيضاء ونباتات القرم.",
    image: "oud.jpg",
    region: "منطقة مكة المكرمة"
  },
  {
    lat: 22.233024618325086,
    lng: 43.56957261653297,
    title: "جبال الدخول وحومل",
    description: "تقع في منطقة عالية نجد، وارتبطت معلقة امرئ القيس الشهيرة بذكر جبال الدخول وحومل.",
    image: "dakol.png",
    region: "منطقة مكة المكرمة"
  },
  {
    lat: 26.158031346220433,
    lng: 40.26628807405597,
    title: "النقوش الصخرية في حائل",
    description: "مواقع النقوش الصخرية في جبة والشويمس بمنطقة حائل تعد متحفاً مفتوحاً مسجلاً في قائمة اليونسكو للتراث العالمي.",
    image: "hail.png",
    region: "منطقة حائل"
  },
  {
    lat: 28.013155521660654,
    lng: 41.00510084503813,
    title: "كهف شعيفان ’’الشويمس’’",
    description: "كهف شعيفان يقع حرة النار بجنوب حائل ويعد أطول كهف في المملكة بطول يتجاوز 2 كم وعمق 800 متر تحت سطح الأرض.",
    image: "shoimes.jpg",
    region: "منطقة حائل"
  },
  {
    lat: 26.57361,
    lng: 50.06667,
    title: "جزيرة تاروت",
    description: "تقع جزيرة تاروت بالمنطقة الشرقية وتعتبر من أقدم الأماكن الاستيطانية بالخليج العربي منذ أكثر من 7000 سنة وتضم قلعة تاروت التراثية.",
    image: "taroot.jpg",
    region: "المنطقة الشرقية"
  },
  {
    lat: 27.93056,
    lng: 49.68194,
    title: "جزيرة حرقوص",
    description: "جزيرة مرجانية بالخليج العربي تقع شمال الجبيل وتعد محمية هامة للطيور البحرية والسلاحف والشعاب المرجانية.",
    image: "harqoos.jpg",
    region: "المنطقة الشرقية"
  },
  {
    lat: 25.412089014897767,
    lng: 49.69267426378437,
    title: "كهوف جبل القارة",
    description: "سجل جبل القارة بالأحساء ضمن التراث العالمي لليونسكو، ويتميز بتكويناته الصخرية وكهوفه ذات التكييف الطبيعي (باردة صيفاً ودافئة شتاءً).",
    image: "caves.jpg",
    region: "المنطقة الشرقية"
  },
  {
    lat: 25.413591614644428,
    lng: 49.638843410457085,
    title: "واحة الاحساء",
    description: "أكبر واحة نخيل في العالم مسجلة بموسوعة غينيس وتضم أكثر من 3 ملايين نخلة تتغذى من ينابيع المياه العذبة.",
    image: "ahsaa.jpg",
    region: "المنطقة الشرقية"
  },
  {
    lat: 31.397083552316932,
    lng: 37.494811849278584,
    title: "قرية كاف",
    description: "تقع بالقريات بمنطقة الجوف وتضم عيوناً كبريتية علاجات وقصر كاف الأثري وقلعة الصعيدي النبطية.",
    image: "kaf.jpg",
    region: "منطقة الجوف"
  },
  {
    lat: 18.250665,
    lng: 44.451402,
    title: "آبار حمى",
    description: "موقع أثري عالمي مسجل باليونسكو بنجران يضم آباراً صخرية تاريخية محفورة منذ أكثر من 7000 سنة مع آلاف اللوحات والنقوش الصخرية.",
    image: "hema.png",
    region: "منطقة نجران"
  },
  {
    lat: 17.478322,
    lng: 44.181214,
    title: "الأُخدود",
    description: "مدينة تاريخية بنجران محاطة بسور صخري ضخم وتعود لعام 500 قبل الميلاد، وشهدت المذبحة التاريخية الشهيرة لأصحاب الأخدود.",
    image: "akdod.jpg",
    region: "منطقة نجران"
  }
];

window.OIL_GAS_DATA = {
  oil: [
    { lat: 25.141366, lng: 49.557756, title: "حقل الغوار", description: "أكبر حقل نفط تقليدي في العالم يقع في محافظة الأحساء بالمنطقة الشرقية بطول 280 كم وعرض 30 كم. أكتشف عام 1948م وتصل احتياطياته إلى أكثر من 50 مليار برميل." },
    { lat: 25.069444, lng: 48.195000, title: "حقل خريص", description: "يبعد 150 كم شمال شرق الرياض بطول 127 كم. أكتشف عام 1957م وينتج 1.2 مليون برميل يومياً." },
    { lat: 24.357939, lng: 50.876248, title: "حقل اللغفة", description: "يبعد 500 كم جنوب شرق الرياض بالربع الخالي. مكمنه من صخور متكون العرب الأحجار الجيرية الجوراسية." },
    { lat: 24.300065, lng: 50.824400, title: "حقل الجوب", description: "يبعد 500 كم جنوب شرق الرياض بالربع الخالي." },
    { lat: 22.743470, lng: 52.637144, title: "حقل الشطفة", description: "يقع في صحراء الربع الخالي ويبعد 800 كم جنوب شرق الرياض." },
    { lat: 22.477833, lng: 54.843267, title: "حقل الشيبة", description: "يقع شرقي صحراء الربع الخالي أكتشف عام 1968م. يمكن أن يضخ 1.3 مليون برميل يومياً لمدة 70 عاماً." },
    { lat: 22.252042, lng: 54.093359, title: "حقل الرملة", description: "يقع شرقي الربع الخالي ويبعد 800 كم جنوب شرق الرياض." },
    { lat: 23.808800, lng: 46.873320, title: "حقل الحوطة", description: "يبعد 180 كم جنوب الرياض. أكتشف عام 1988م وينتج خاف عربي ممتاز بكثافة 49.9 درجة." },
    { lat: 25.936694, lng: 49.602634, title: "حقل بقيق", description: "حقل نفط رئيسي بالمنطقة الشرقية أكتشف عام 1940م ويضم أكبر معامل معالجة الزيت والغاز عالمياً." },
    { lat: 28.211935, lng: 48.751281, title: "حقل السفانية", description: "أكبر حقل نفطي مغمور تحت الماء في العالم يقع بالخليج العربي بطول 50 كم وينتج 1.5 مليون برميل يومياً." },
    { lat: 27.704328, lng: 48.875146, title: "حقل منيفة", description: "حقل نفطي مغمور بالخليج العربي شمال الظهران وهو خامس أكبر حقل نفط بالعالم وينتج 900 ألف برميل يومياً." },
    { lat: 27.704328, lng: 49.603264, title: "حقل البري", description: "يقع جنوب محافظة الجبيل وينتج 250 ألف برميل يومياً من النفط العربي الخفيف." }
  ],
  gas: [
    { lat: 28.18108, lng: 34.858831, title: "حقل مدين", description: "حقل غاز طبيعي غير مصاحب يقع في رأس الشيخ حميد بتبوك أكتشف عام 1990م." },
    { lat: 28.18108, lng: 34.858831, title: "حقل برقان", description: "يقع بشمال غرب البحر الأحمر أكتشف عام 1969م ومكمنه أحجار رملية ميوسينية." },
    { lat: 23.439367, lng: 46.722663, title: "حقل الحلوة", description: "يبعد 140 كم جنوب الرياض أكتشف عام 1990م في متكون عنيزة." },
    { lat: 24.105692, lng: 49.020345, title: "حقل شمعة", description: "يبعد 500 كم جنوب شرق الرياض." },
    { lat: 22.359301, lng: 53.130374, title: "حقل الكدن الشمالي", description: "يقع بالربع الخالي أكتشف عام 1967م." },
    { lat: 21.826041, lng: 53.135559, title: "حقل الكدن الجنوبي", description: "يقع بشرق الربع الخالي أكتشف عام 1968م." },
    { lat: 21.155611, lng: 52.522044, title: "حقل المحاكيك", description: "حقل غاز طبيعي يقع بالربع الخالي بئر المحاكيك-2." },
    { lat: 24.388763, lng: 48.312905, title: "حقل شدون", description: "غرب مركز حرض يتدفق بغاز مكثف من مكمن عنيزة-أ." },
    { lat: 24.486152, lng: 48.672641, title: "حقل الوضيحي", description: "اكتشف في مكمن الصارة بمعدل 11.7 مليون قدم مكعبة يومياً." },
    { lat: 24.715138, lng: 48.878095, title: "حقل أوتاد", description: "جنوب غرب الهفوف بمكمن القصيباء." },
    { lat: 24.510276, lng: 48.467188, title: "حقل مزاليج", description: "جنوب غرب الظهران بمكمن عنيزة ب/ج." }
  ]
};

window.VALLEYS_LIST = {
  "Wadi_Aba_Al_Qu": { name: "وادي أبا القور", file: "assets/maps/valleys/Wadi_Aba_Al_Qu.geojson", color: "#1aa33f" },
  "Wadi_Aba_Ar_Ruwath": { name: "وادي أبا الروث", file: "assets/maps/valleys/Wadi_Aba_Ar_Ruwath.geojson", color: "#a31f1a" },
  "Wadi_Al_Ahsabah": { name: "وادي الأحسبة", file: "assets/maps/valleys/Wadi_Al_Ahsabah.geojson", color: "#a3411a" },
  "Wadi_Al_Akhda": { name: "وادي الأخذة", file: "assets/maps/valleys/Wadi_Al_Akhda.geojson", color: "#73a31a" },
  "Wadi_Al_Amq": { name: "وادي العمق", file: "assets/maps/valleys/Wadi_Al_Amq.geojson", color: "#3ca31a" },
  "Wadi_Al_Batin": { name: "وادي الباطن", file: "assets/maps/valleys/Wadi_Al_Batin.geojson", color: "#1aa333" },
  "Wadi_Al_Farshah": { name: "وادي الفرشة", file: "assets/maps/valleys/Wadi_Al_Farshah.geojson", color: "#1aa333" },
  "Wadi_Al_Gharr": { name: "وادي الغار", file: "assets/maps/valleys/Wadi_Al_Gharr.geojson", color: "#1aa375" },
  "Wadi_Al_Hamd": { name: "وادي الحمض", file: "assets/maps/valleys/Wadi_Al_Hamd.geojson", color: "#1a75a3" },
  "Wadi_Al_Jizil": { name: "وادي الجزل", file: "assets/maps/valleys/Wadi_Al_Jizil.geojson", color: "#5c30c2" },
  "Wadi_Al_Khurmah": { name: "وادي الخرمة", file: "assets/maps/valleys/Wadi_Al_Khurmah.geojson", color: "#7d1ca3" },
  "Wadi_Al_Lith": { name: "وادي الليث", file: "assets/maps/valleys/Wadi_Al_Lith.geojson", color: "#a31c9c" },
  "Wadi_Ar_Rumah": { name: "وادي الرمة", file: "assets/maps/valleys/Wadi_Ar_Rumah.geojson", color: "#42803b" },
  "Wadi_Arar": { name: "وادي عرعر", file: "assets/maps/valleys/Wadi_Arar.geojson", color: "#3b8050" },
  "Wadi_As_Sahba": { name: "وادي السهباء", file: "assets/maps/valleys/Wadi_As_Sahba.geojson", color: "#3b8063" },
  "Wadi_Baysh": { name: "وادي بيش", file: "assets/maps/valleys/Wadi_Baysh.geojson", color: "#3b5480" },
  "Wadi_Bishah": { name: "وادي بيشة", file: "assets/maps/valleys/Wadi_Bishah.geojson", color: "#3b3c80" },
  "Wadi_Hanifah": { name: "وادي حنيفة", file: "assets/maps/valleys/Wadi_Hanifah.geojson", color: "#9adb53" },
  "Wadi_Najran": { name: "وادي نجران", file: "assets/maps/valleys/Wadi_Najran.geojson", color: "#539adb" },
  "Wadi_Ranyah": { name: "وادي رنية", file: "assets/maps/valleys/Wadi_Ranyah.geojson", color: "#cb53db" },
  "Wadi_Tathlith": { name: "وادي تثليث", file: "assets/maps/valleys/Wadi_Tathlith.geojson", color: "#05337d" },
  "Wadi_Turubah": { name: "وادي تربة", file: "assets/maps/valleys/Wadi_Turubah.geojson", color: "#35057d" }
};
