package com.example.map

import android.annotation.SuppressLint
import android.app.Dialog
import android.os.Build
import android.os.Bundle
import androidx.appcompat.app.AppCompatActivity
import com.google.android.material.floatingactionbutton.FloatingActionButton
import com.mapbox.maps.MapView
import com.mapbox.maps.MapboxMap
import com.mapbox.maps.CameraOptions
import com.mapbox.geojson.Point
import android.view.LayoutInflater
import android.widget.Button
import android.widget.ImageView
import android.widget.LinearLayout
import android.widget.TextView
import com.mapbox.maps.plugin.gestures.addOnMapClickListener
import com.mapbox.maps.RenderedQueryOptions
import android.util.Log
import android.view.Gravity
import android.view.View
import android.widget.PopupWindow


class MainActivity : AppCompatActivity() {

    private lateinit var mapView: MapView
    private lateinit var mapboxMap: MapboxMap
    private val polygonInfo = hashMapOf(
        "hart_unayyir-bgxfcy" to Pair("حرة الشاقة_لونيير", "الوصف : تقع بين العيص من الشرق ، وأملج من الغرب وتمتد من الجنوب الشرقي إلى الشمال الغربي بطول 63كم تقريباً ، وبعرض 58 كم تقريباً ، وقد انساحت الحرة – بحكم الميل – باتجاه الغرب وقد وصلت إلى السهل الساحلي ، وأشرفت على مدينة املج ، وإلى الغرب من حرة الشاقة توجد حرة صغيرة على شكل ذراع تسمى حرة العتبة ، تقع شمال أملج بمسافة 25كم بالقرب من مرسى البحير ، طرفها الجنوبي يحف البحر الأحمر ، ويبلغ طولها 6كم ، وعرضها كيلو متر.\n"),
        "hart_kishb-815dj1" to Pair("حرة كشب", "الوصف : منطقة بركانية واسعة شديدة التضاريس تقع شمال بلدة رضوان، تتوزع بها أكثر من ( 150 ) من المخاريط ، وتحف أطرافها سباخ عظيمة مثل : سبخة الأشعرية و دغيبجة جنوباً. وعلى أطرافها الجنوبية توجد قرى: المويه القديم ودغيبجة وأم الدوم، وفي وسطها قرى حفر كشب، ويبلغ طولها من الجنوب إلى الشمال 110 كم تقريباً وعرضها من الغرب إلى الشرق 70 كلم تقريباً. ومن أشهر جبالها جبل الهيل، وجبل أبوحريص، وجبل شلمان، وجبل يهيي، وجبل الوعبة وتشتهر هذه الحرة بوجود فوهة عميقة وكبيرة تسمى الوعبة ويطلق عليها ( مقلع طمية) ويبلغ قطرها نحو 2300م وعمقها 200م.\n"),
        "hart_khaybar-d6449k" to Pair("حرة خيبر", "الوصف : خيبر :حرة عظيمة ، تقع شمال شرقي المدينة المنورة ، وتعد أكبر الحرات في المملكة وأشهرها ، وتنحدر منها أعالي روافد وادي الرمة ، وتمتد هذه الحرة طولياً باتجاه شمالي جنوبي تقريباً بطول يقدر بنحو 280كم ، من شمال بلدة الصويدرة جنوباً ( شرق المدينة المنورة ) حتى دائرة العرض 27 ْ شمالاً ، أما أقصى عرض لها فيبلغ 170كم تقريباً ، وتتميز هذه الحرة بارتفاع جبالها البركانية التي توجد على خط مستقيم تقريباً ، وتتركز على أطرافها الشرقية والغربية بعض المدن والقرى ، ففي الجهة الشرقية توجد ، الحناكية ، والشويمس ، كما يوجد في الجهة الغربية : خيبر ، والعشاش ، ، ويطلق على أجزاء من الحرة بعض الأسماء المحلية ففي الناحية الجنوبية هناك : حرة الصفة ، وحرة الحزم ، وحرة العظامية ، ولسان من الحرة يمتد غرب الحناكية يسمى حرة مديسيس ، وفي شمالها تأخذ بعض الأسماء المحلية مثل : حرة الغويطات ، وحرة الوشام ، وحرة إثنان ، كما يطلق على أطرافها الشرقية اسم حرة بني رشيد ، ويطلق الأهالي في هذه المنطقة على البراكين التي على هيئة جبال ( حلاة ) وجمعها( حلي ) ، ومن أهم جبالها : جبل الابيض ( 2093م )، وجبل القدر( 2022م ) والذي يتميز بقمة تشبه القدر منخفضة في الوسط يبلغ قطرها نحو 400م بعمق 85م ، وجبل البيضاء ( 1936م ) والذي يتميز بشكله الأبيض ويبلغ قطر فوهته حوالي 1500م ، بعمق يصل إلى نحو 70م ، وجبل الإكليل ( 1938م ) ، ويقع إلى الجنوب من حرة خيبر حرات القفيف ، والناعمة ، وحرة هرمة التي توجد بها فوهة بركانية واسعة يبلغ قطرها 7000م بعمق يصل إلى نحو 50م توجد فيها قرية هرمة ، كما يوجد في طرفها الشمالي الشرقي بعض الينابيع المائية\n"),
        "hart_hadan-4qulnq" to Pair("حرة حضن", "الوصف : تقع غرب حرة نواصف ، ويفصل بينهما وادي تربة ، ويحدها من الغرب منطقة الجرد ، ومن الشمال سهل ركبة ، ويبلغ طولها نحو 120كم ، وعرضها 45كم تقريباً ، كما يطلق عليها جبال حضن .ويوجد إلى الغرب من حرة حضن حرة صغيرة ناتجة من بركان واحد تسمى حرة البرث ، وهي تقع عند نهاية وادي لبة ، عندما يتلاشى في سهل الجرد ، ويبلغ طولها 10كم ، وعرضها 5كم .\n"),
        "hart_awarad-5bksz1" to Pair("حرة عويرض", "الوصف : تقع غرب العلا ومدائن صالح ، وتمتد من الجنوب الشرقي إلى الشمال الغربي بطول 140كم تقريباً ، وأقصى عرض لها يبلغ نحو 40كم ، تتفرع على هيئة ألسن وأذرع كثيرة جداً بين الشعاب والأودية ، ولها فوهات بركانية على خط مستقيم على طول الحرة ، ومن أهم جبالها جبل عناز ( 1839م ) ، وتشتهر بوجود الفوهات البركانية المنخفضة ، ومنها : فوهة الهوية التي يبلغ قطرها نحو 1500م ، وبعمق يصل إلى نحو 55م ، ويوجد بعض الحرات التي تعد امتداداً لحرة عويرض وهي : حرة الرحا في الشمال وحرة الزبن في الجنوب.\n "),
        "hart_alsarah-7t4hk2" to Pair("حرة السراة", "الوصف : تبدأ من ظهران الجنوب باتجاه الشمال وتمتد مسافة 80كم تقريباً ، وتبدو واضحة فوق قمم الجبال لأن غالبيتها انجرفت بفعل التعرية وهي تحيط بسراة عبيدة .\n"),
        "hart_alhtaymh-1yw1sy" to Pair("حرة الهتيمة", "الوصف : تقع بمحاذاة جبل سلمى من الشرق إلى الجنوب الشرقي من مدينة حائل ، يبلغ طولها نحو 55كم ، وأقصى عرض لها 30كم ، وهي الحرة الوحيدة البعيدة عن خط النشاط البركاني ، ويوجد في هذه الحرة منخفض طابة وهو عبارة عن فوهة بركانية يبلغ قطرها نحو 1500م بعمق يصل إلى نحو 35م ، وتقع فيه قرية طابة القديمة ، ويوجد بالقرب منها – وسط جبال سلمى – بلدة النعي التي تقع في منخفض تحيط به حافات جبلية شديدة الانحدار ، وتشتهر الحرة بوجود المناطق المنخفضة وسط قمم الجبال وتسمى ( دارات ) ويطلق على بعض أطرافها أسماء محلية مثل : حرة الصاع ، وحرة هروج.\n"),
        "hart_nawsaf_albogom-1i8dcl" to Pair("حرة عويرض", "الوصف : حرة واسعة تقع بين وادي رنية من الجنوب والجنوب الشرقي ، ووادي تربة من الشمال والشمال الغربي ومن الجنوب مدينة العقيق ( عقيق الباحة ) ومن الشمال الشرقي الطريق الواصل بين رنية و الخرمة ، ويبلغ طولها نحو 205كم ، وأقصى عرض 120كم ، ويوجد داخلها قرى مثل : العويلة ، وجراب ، والقوامة ، ومن المدن التي تقع على أطرافها : العقيق وجعلة جنوباً ، والعفيرية والغافة والأملح شرقاً ، والخرمة في الشمال الغربي ، وتتميز هذه الحرة بأن براكينها منتشرة في جميع أنحائها ، وليست في خط مستقيم كحرة رهاط أو خيبر.\n"),
        "hart_rahat-2ojan9" to Pair("حرة رهط", "الوصف : تسمى في بعض المواقع حرة القرى أو الكرى وحرة الحجاز، وحرة رهط حرة كبيرة وطويلة، تقع إلى الجنوب من حرة خيبر، وتمتد طولياً باتجاه شمالي جنوبي، ومعظم براكينها تقع على خط طول 40 درجة شرقاً أو قريباً منه، وتنحرف البراكين قليلاً جنوبي هذه الحرة باتجاه الشرق حتى تصل إلى خط طول 15’ 40 درجة شرقاً، أما شمال الحرة فإن البراكين تنحرف قليلاً باتجاه الغرب، وتصل إلى خط طول 45’ 39 درجة شرقاً ، كما تضم الحرة نظام الشقوق الأرضية بطول حوالي 11 كلم ويتكون من عدة شقوق منتظمة على هيئة متدرجة يعود تاريخها من 2000 إلى 3000 عام، وقد تسبب انفتاح هذا الشق في حدوث زلزال المدينة المنورة، ويصحب نظام الشقوق البركانية التكوينية هذه عادة أنشطة زلزالية خفيفة كما هو مؤكد عند انبثاق الحرة الشرقية.\n"),
        "hart_alharh-9osy8j" to Pair("حرة الحرة", "الوصف : هي الغطاء البركاني الوحيد داخل النطاق الرسوبي في المملكة العربية السعودية. وهي مكونة من البازلت. وتمتد من جبل الدروز في سوريا جنوبا عبر الأردن إلى المملكة العربية السعودية، وتأخذ اتجاه الجنوب الشرقي إلى الشمال الغربي ، تحدها هضبة الحماد شرقاً، ووادي السرحان غرباً، ويبلغ طولها نحو 230 كلم، وأقصى عرض لها يبلغ 85 كم تقريباً، وتقع مدينة طريف في الطرف الشرقي منها، على حين تقع مدينة القريات في الطرف الغربي، ويطلق على بعض أجزائها أسماء محلية : حرة المابية على الحافة الشمالية لسبخة حضوضاء، وحرة قليب خضر شمال العيساوية، وأشهر جبالها : جبل لس، وجبل نعيج.\n"),
        "sahal_thamah-8ryrba" to Pair("حرات سهل تهامة", "الوصف : يوجد بعض الحرات الصغيرة المتناثرة في السهل الساحلي ( سهل تهامة ) من جنوب مكة حتى مدينة جازان مرتبة من الشمال إلى الجنوب ، وهي : حرة الدام ، ، وحرة شامة ، وحرة الصواملة ، شمال مدينة الليث ، وحرة البرك والقحمة ، وحرة خميس البحر ، وحرة محايل عسير وحرة عكوة ، إلى الشمال الشرقي من مدينة صبيا ، وحرة أبو عريش ، وحرة القمم إلى الجنوب الشرقي من مدينة أبو عريش.\n"),
        // Add more polygons here
    )

    @SuppressLint("MissingInflatedId", "SetTextI18n")
    override fun onCreate(savedInstanceState: Bundle?) {

        if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.KITKAT) {
            // This code will hide the system navigation bar
            window.decorView.systemUiVisibility = (
                    View.SYSTEM_UI_FLAG_HIDE_NAVIGATION
                            or View.SYSTEM_UI_FLAG_IMMERSIVE_STICKY
                    )
        }


        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)
        supportActionBar?.hide()

        val arabian_shield: Button = findViewById(R.id.arabian_shield)
        val arabian_platform: Button = findViewById(R.id.arabian_platform)
        val harat: Button = findViewById(R.id.harat)
        val swahel: Button = findViewById(R.id.swahel)

        val homeBtn: FloatingActionButton = findViewById(R.id.home)
        homeBtn.setOnClickListener {
            onBackPressed()
        }

        //START: Brief button
        val brief: Button = findViewById(R.id.brief)
        brief.setOnClickListener {
            val popupView = LayoutInflater.from(this).inflate(R.layout.popup_brief, null)
            popupView.findViewById<TextView>(R.id.title).text = "جيولوجية المملكة"
            popupView.findViewById<TextView>(R.id.description).text = "تعود أقدم الصخور في المملكة إلى عصر ما قبل الكمبري، أي قبل حوالي 3 مليارات سنة. وهي تشكل أجزاء من الصفيحة العربية التي تشمل شبه الجزيرة العربية. ومع ذلك، فإن معظم مناطق المملكة العربية السعودية تقع تحت صخور حقبة الحياة الحديثة (منذ 1000 إلى 540 مليون سنة). تشمل هذه الصخور الأحدث تلك التي تعود إلى حقبة الحياة القديمة والمتوسطة، وعصور الحياة الحديثة، والتي يطلق عليها مجتمعة الغلاف الصخري لدهر الحياة الفانيروزية Phanerozoic.\n" +
                    "توجد صخور ما قبل الكمبري في الجزء الغربي من المملكة، والتي تشكل الدرع العربي. يمتد الدرع من جنوب الأردن إلى اليمن، لكن مساحته الأكبر تقع في المملكة. ويقدر طول الصفيحة العربية بحوالي 2600 كيلومتر من الشمال إلى الجنوب وحوالي 3000 كيلومتر من الشرق إلى الغرب. يحد الصفيحة العربية من الغرب صدع البحر الأحمر وصدع البحر الميت التحويلي، ومن الشرق منطقة اندساس زاغروس ومنطقة صدع أوين، ومن الشمال منطقة صدع الأناضول الشرقية، ومن الجنوب منطقة صدع عدن.\n" +
                    "ويحد صخور الدرع المكشوفة الصخور الرسوبية التي تعود إلى دهر الحياة المتوسطة في الأجزاء الوسطى والشرقية من المملكة، وفي الأجزاء الشمالية والشرقية والجنوبية الصخور الرسوبية والبركانية التي ترسبت على طول حوض البحر الأحمر. تشكل الحوض بالتزامن مع انفصال شبه الجزيرة العربية عن شمال شرق أفريقيا منذ حوالي 25 مليون سنة، مما أدى إلى تكوين الصفيحة العربية وبدء انفتاح البحر الأحمر وخليج العقبة. أدى ارتفاع حواف الصدع إلى تكوين تضاريس مائلة للصفيحة العربية، والتي كانت إلى حد كبير العامل المسؤول في تآكل صخور دهر الحياة القديمة وانكشاف الدرع العربي. الصخور النارية في الدرع العربي هي في الغالب عبارة عن تجمعات صخرية من عصر حقبة الحياة الحديثة من نظام القوس البركاني المحيطي، وإلى حد كبير، من الصخور البركانية والرسوبية التي ترسبت بشكل غير متطابق مع تسلسل القوس مع تدخلات الجرانيت واسعة النطاق. يبرز الدرع العربي المكون من الصخور النارية والمتحولة شرقًا من الحجاز إلى نجد على شكل انتفاخ يلتف حول خليج العقبة إلى نقطة تبعد أقل من 200 كيلومتر غرب الرياض ثم يتراجع باتجاه جنوب البحر الأحمر. يحتوي الدرع على العديد من البراكين الخامدة المحاطة بطبقات الحمم البركانية. تنحدر باتجاه الشرق رواسب المنصة التي توجد فيها حقول النفط. \n" +
                    "يعطي الدرع تناسقًا لجغرافية المملكة، حيث تتبع محيطه العديد من المنحدرات والصحاري الرملية. كان الدرع العربي بمثابة كتلة مستقرة Cratonic منذ أواخر عصر ما قبل الكمبري. يبرز من تحت الرمال. تشكل الرمال معظم الثلث الغربي من المملكة. تحتل رواسب المنصات البحرية جزءًا كبيرًا من الشمال، بينما تحتل التراكمات البحرية الأرضية التي يزيد ارتفاعها عن 6100 متر أحواضًا ضيقة موازية للخليج العربي والبحر الأحمر. من العصر البليستوسيني إلى التدفقات البركانية الحديثة ومخاريط الرماد تتراكب على الصخور القديمة. يميل ساحل البحر الأحمر إلى الأعلى بحيث يكون الساحل الغربي عبارة عن هضبة مرتفعة ترتفع عن البحر الأحمر 1500 متر، ويقترب ارتفاعها في بعض الأحيان من 3000 متر. تنحدر هذه الهضبة شرقًا نحو الخليج العربي، ولكن حتى هناك منحدرات أمام الخليج. \n" +
                    "يقع الغطاء الرسوبي شرق القاعدة النارية والمتحولة للدرع العربي، ويشغل نحو ثلثي مساحة أراضي المملكة العربية السعودية، أي حوالي 68%، وتقدر مساحته الإجمالية بـ 1,320,000 كم2.يعد الغطاء الرسوبي ككل جزءًا متبقيًا من طريق تيثيس البحري، والذي نتج عن التأثيرات العامة والمجمعة للعمليات الرسوبية والحركات التكتونية حول الدرع العربي. ترسبت الرواسب ذات المنشأ القاري والبحري بشكل متقطع وتجمعت في سلسلة سميكة باتجاه الشرق يصل سمكها إلى 7000 متر في حوض الخليج العربي وفي الربع الخالي. وهي تنخفض من درجة واحدة في أقدم التسلسلات الرسوبية إلى أقل من نصف درجة في التسلسلات الحديثة. تشكلت هذه التسلسلات الرسوبية على مدى فترة 541 مليون سنة تقريباً، من نهاية عصر البروتيروزويك، وتتجلى في المناطق الوسطى من المملكة على شكل حزام منحني يتجه انحناءه نحو الحافة الشرقية للجزيرة العربية. \n" +
                    "يضم الغطاء الرسوبي في المملكة أكبر الرواسب والخزانات الهيدروكربونية والمياه الجوفية والرواسب المعدنية في العالم، وتتكون من المعادن الصناعية اللافلزية، مثل البوكسيت والفوسفات والمعادن الطينية والحجر الجيري والدولوميت والجبس ورمال السيليكا والحجر الرملي، والرمال السوداء، بالإضافة إلى المعادن الأساسية وغيرها. وقد تحتوي هذه الصخور الرسوبية أيضًا على عناصر مشعة، مثل اليورانيوم، والعناصر الأرضية النادرة التي ترتبط برواسب الفوسفات.\n" +
                    "تتميز المملكة بوجود القمم الصخرية المرتفعة والحادة، ويوجد في المملكة ثلاثة أقسام للجبال وهي:\n" +
                    "•\tجبال السروات: تقع جبال السروات في جنوب المملكة، وهي عالية الارتفاع. يبلغ ارتفاعها حوالي 9000 قدم. وتنحدر منها مجموعة من الأودية شرقا وغربا. مثل وادي جازان ووادي الرمة ووادي بيشه ووادي الحمض ووادي نجران ووادي ينبع ووادي فاطمة ووادي تثليث.\n" +
                    "•\tجبال الحجاز: تقع في منتصف السلاسل الجبلية. وتمتد من شمال مدينة مكة حتى دائرة عرض 28 شمالا.\n" +
                    "•\tجبال مدين: تقع جبال مدين شمال المرتفعات الجبلية السعودية، يبلغ ارتفاعها حوالي 2500م فوق مستوى سطح البحر.\n" +
                    "          وهناك أيضا العديد من الهضاب ومن أهمها ما يلي:\n" +
                    "•\tهضبة نجد: تقع هضبة نجد بين رمال الدهناء في الشرق وجبال الحجاز في الغرب، بالقرب من صحراء الدهناء، يوجد من ضمنها جبال طويق. من أشهر الأودية التي تشق هضبة نجد: وادي حنيفة ووادي الباطن ووادي السرحان.\n" +
                    "•\tهضاب شرق المملكة: هي الهضاب التي تمتد على طول ساحل الخليج العربي ما بين السهل الساحلي شرقا وصحراء الدهناء غربا، وصحراء الربع الخالي جنوبا، حتى وادي الباطن الواقع شمالا. من أشهر هذه الهضاب: هضبة الدبة والصمان والجافورة.\n" +
                    "•\tهضاب شمال المملكة: هي الهضاب الممتدة من صحراء النفوذ حتى حدود الكويت في الشمال الشرقي، وبعضها يمتد إلى الحدود الأردنية الكويتية. ومن أشهر هذه الهضاب: حوض الحماد، وهضبة الحرة، وهضبة الحجرة، وهضبة وادي السرحان.\n" +
                    "•\tهضاب غرب المملكة: هي الهضاب التي تمتد من شمال إلى جنوب المملكة على طولها، ومن أهم الهضاب في غرب المملكة: هضبة الحسمى والحرات، ونجران، وعسير، والحجاز.\n" +
                    "أما الصحاري في المملكة فإنها تنقسم إلىى ثلاثة أجزاء وهي:\n" +
                    "•\tصحراء النفوذ الكبرى: تقع صحراء النفوذ الكبير في شمال المملكة، تمتد على مسافة 90 كيلومتراً من قرية جُبّة وحتى مدينة سكاكا، وتمتد من الزلفي مسافة 300 كيلومتراً حتى تصل إلى حدود حائل. وتمتد على مساحة 103,600 كيلومتر مربع في محافظات الجوف وتبوك وحائل، وهي تعتبر صحراء جرداء، تندر فيها الامطار.\n" +
                    "•\tصحراء الربع الخالي: تقع صحراء الربع الخالي في جنوب المملكة، تبلغ مساحتها 650 ألف كيلو متر مربع، وهي جزء من المنطقة الشرقية ومحافظتي نجران والرياض. توجد فيها كل أشكال الرمال المعروفة مثل: العروق، والهلالية، و الكثبان النجمية.\n" +
                    "•\tصحراء الدهناء: تقع صحراء الدهناء على طول طريق الدمام السريع، تمتد من محافظة الزلفى في وسط المملكة وتمر بالقصيم ومنطقة حائل شمالا. وتعتبر جسرا رمليا بين صحراء الربع الخالي وصحراء النفوذ الكبرى.\n" +
                    "          تعد السهول من تضاريس المملكة العربية السعودية البارزة، بالأخص أنها تمتد   \n" +
                    "          على طول سواحل المملكة، ومنها ما يلي:\n" +
                    "•\tسهول شرقية: هي السهول الممتدة من ساحل الخليج العربي حتى هضبة الصمان. والمطلة على الخليج الغربي. وهي سهول منبسطة تغطي الرمال أجزاء كبيرة منها وبعض أجزائها تحول إلى مسطحات ملحية.\n" +
                    "•\tالسهول الغربية: هي السهول التي تمتد على طول ساحل البحر الأحمر حتى جبال السروات والتي تعرف بسهول تهامة. وهي تتسع في الجنوب وتضيق في الشمال.\n" +
                    "\n" +
                    "      وباختصار تنقسم المملكة جيولوجياً إلى أربعة نطق متميزة وهي\n" +
                    "•\tالدرع العربي وهو يتبع دهر طلائع الحياة ويتمثل في التتابعات البركانية الرسوبية المتحولة التي يتداخل فيها الجرانيت و الجابرو.\n" +
                    "•\tالرصيف القاري العربي وهو يتبع دهر الحياة الظاهرة ويحتوي على تتابعات رسوبية فتاتية وجيرية ومتبخرات تميل بدرجات خفيفة نحو الشرق مبتعدة عن الدرع العربي.\n" +
                    "•\tحرات العصر الثلاثي البركانية وهي في الغالب تعلو صخور الدرع العربي.\n" +
                    "•\tالسهل الساحلي للبحر الأحمر.\n"
            val briefDialog = Dialog(this)
            briefDialog.setContentView(popupView)

            val displayMetrics = resources.displayMetrics
            val screenWidth = displayMetrics.widthPixels

            briefDialog.window?.setLayout(
                (screenWidth * 0.9).toInt(),
                LinearLayout.LayoutParams.WRAP_CONTENT
            )

            briefDialog.show()

            val closeButton = popupView.findViewById<Button>(R.id.closeButton)
            closeButton.setOnClickListener {
                briefDialog.dismiss()
            }
        }
        //END: Brief button


        mapView = findViewById(R.id.mapView)
        mapboxMap = mapView.getMapboxMap()

        setMapStyle("maps/saudi_geo/saudigeo.json")

        // Set initial camera position
        val initialPosition = CameraOptions.Builder()
            .center(Point.fromLngLat(47.189224, 24.694291)) // Riyadh, Saudi Arabia
            .zoom(4.3)
            .build()
        mapboxMap.setCamera(initialPosition)

        val resetZoomBtn: FloatingActionButton = findViewById(R.id.reset_zoom)
        resetZoomBtn.setOnClickListener {
            mapboxMap.setCamera(initialPosition)
        }

        arabian_shield.setOnClickListener {
            setMapStyle("maps/saudi_geo/arabian_shield.json")
            showPopup(
                "الدرع العربي ",
                "يعتبر الدرع العربي في شبه الجزيرة العربية والدرع النوبي في مصر والسودان جزءً من كتلة شرق أفريقيا والمكونة قلب قارة جوندوانا الكبيرة في نهاية عصر ما قبل الكمبري، وقد انفصل الدرع العربي عن نظيره الدرع النوبي بواسطة أخدود البحر الأحمر. يظهر الدرع العربي على شكل شبه منحرف تبلغ مساحته حوالي (660000كم2) حيث يمثل الجزء الغربي من الجزيرة العربية ويحده من الغرب أخدود البحر الأحمر والسهول الساحلية المسماة سهول تهامة ويحده من الشمال والغرب صخور الغطاء الرسوبي التابعة لدهر الحياة الظاهرة ويبلغ طول الدرع العربي بما في ذلك الامتدادات الموجودة في الشمال الغربي والجنوب الشرقي حوالي (1,800كم) وعرضه كحد أقصى حوالي (700 كم). يوجد حوالي (81,000 كم2) من الدرع العربي في المملكة مغطى بحقول بازلتية تابعة لدهر الحياة الحديث . يتكون الدرع من عدة أنواع من الصخور التابعة لعصر الكمبري  يقابلها أحزمة من الصخور المتحولة المختلفة والصخور المشوهة ويصل عمر هذه الصخور إلى أكثر من 1,200 مليون سنة\n" +
                        "للدرع العربي أهمية أساسية في دراسة التاريخ الجيولوجي للأرض. إنها واحدة من أكبر المناطق على وجه الأرض التي تحتوي على قشرة شابة من الطلائع الحديثة المحفوظة والتي تشكلت مباشرة من الصهارة. وهو مكشوف بشكل جيد، وقد شهدت تجمعاته الصخرية تحولات وتشوهات معتدلة. يُعد الدرع مثالًا ممتازًا لقشرة شابة كبيرة تطورت خلال 300 مليون سنة من قشرة محيطية يبلغ سمكها 8 كيلومترات إلى قشرة قارية يبلغ سمكها حوالي 45 كيلومترًا. وعلى هذا النحو، يعد الدرع العربي مختبرًا طبيعيًا فريدًا لدراسة التاريخ الجيولوجي الغني للأرض خلال عصر الطلائع الحديثة. وهو يحتفظ بسجلات لأحداث مهمة جدًا حول الفترات الرئيسية للتبريد والتجلد.\n" +
                        "يعود تاريخ أقدم صخور الدرع في المملكة العربية السعودية إلى ما قبل 1.8 إلى 2.6 مليار سنة. وهي تتكون من الجرانيت والنيس والشست، وتنتشر في منطقة محدودة في الحافة الشرقية للدرع، على الرغم من أنها قد تكون موزعة سابقًا على نطاق واسع كما يتضح من التوقيعات النظائرية المميزة المحفوظة في الصخور الأقل انتشارًا. تتراوح أعمار التجمعات الصخرية البركانية من 850 إلى 700 مليون سنة في المناطق الجنوبية والغربية من الدرع، إلى قبل 690 إلى 615 مليون سنة في المناطق المجاورة الشرقية. تشكلت هذه الصخور من التمايز المنصهر المرتبط بانجراف العصر الحديث في محيط موزمبيق. \n" +
                        "تعتبر صخور الدرع العربي موطنا مناسبا لتمعدن الخامات المعدنية نظرا لتاريخها الجيولوجي وتطورها وموقعها على هامش الصفائح المتقاربة خلال 300 مليون سنة من تكوين ونمو القشرة الأرضية. نظرًا لهذه الظروف المواتية للتمعدن، تم تمعدن صخور الدرع العربي بالذهب والنحاس والزنك والرصاص والحديد والنيكل والرواسب المعدنية الأخرى المرتبطة بالهوامش التكتونية النشطة والأنظمة الجبلية المتطورة تدريجيًا. لقد تم استغلال الموارد المعدنية للدرع العربي تاريخياً لأكثر من 3000 عام. حتى الآن، ينشط تعدين الذهب في مناطق الدرع بشكل كبير. ويجري الآن أيضًا استكشاف الكبريتيدات الضخمة المتعددة المعادن ذات الأصول البركانية والرواسب التي تكونت بواسطة المحاليل الحرارية. تميل تواجد الرواسب المعدنية في الدرع إلى أن تكون محصورة في الأحزمة المعدنية بسبب الخصائص الجيولوجية والتكتونية والهيكلية للدرع.\n" +
                        "نشأ الدرع العربي من خياطة حزام الجبال الذي تطور قبل 850-550 مليون سنة، والذي كان يقع في الطرف الشمالي لجبال شرق إفريقيا. يتألف هذا الأوروجينز Orogenies (الحركات البانية للجبال) من حزام عريض من الصخور المتحولة والمشوهة، وقد تشكل من التقارب والتحام الكتل القشرية في شرق وغرب جندوانا. يتكون الدرع بشكل رئيسي من صخور فتية ذات أصل منصهر، تتكون التضاريس التكتونية من مجموعات صخرية شديدة التنوع لها بصمات كيميائية تتعلق بالإعدادات التكتونية المتداخلة التي تشير إلى كل من أقواس الجزر وأنظمة الحواف القارية مع الصخور الرسوبية القارية والبحرية المرتبطة بها. تحدد تسلسلات الأفيوليت في الدرع الحدود بين هذه التضاريس التكتونية. تعرضت صخور الدرع العربي للتحول إلى سحنة الشيست الأخضر والأمفيبوليت خلال عدة حلقات متتالية من التشوه. وينقسم الدرع الآن إلى عدة أراضي وأراضي تحتية، وهي من الشمال إلى الجنوب: أراضي مدين، وحولية، وحائل، والحجاز، وعفيف، والدوادمي، والرين، وعسير، وتثليث، وأراضي الخضاع Khoda.\n" +
                        "عموما يعتقد أن الدرع العربي تطور من خلال عدة عوامل :\n" +
                        "•\tترسب الصخور البركانية والرسوبية على هيئة سلسلة من الأقواس المجماتية.\n" +
                        "•\tالطي والتصدع وإعادة التبلور للصخور على هيئة سلسلة من الأحداث البنائية.\n" +
                        "•\tانهيار وتمدد الحزام الحركي المصاحب لترسب صخور رسوبية حديثة وأحواض بركانية وحقن لصخور الجرانيت الحديثة.\n" +
                        "تعتبر الصخور البركانية والرسوبية والسحيقة والتي معظمها صخور جرانيتية والصخور المتحولة التي تشمل صخور النيس والشست الناشئة من تحول الصخور الرسوبية والصخور البركانية السيليكاتية ومعقدات الامفيبولايت المتحولة عن الصخور القاعدية من أقدم وأهم أنواع صخور الدرع العربي.وقد تعرضت الصخور الرسوبية والمتحولة لعدة مراحل من التشوه والتحول والتحليل خلال تطور الدرع العربي، وحقنت هذه الصخور بكميات كبيرة من الصخور النارية السحيقة التي تشكل حوالي 55% من صخور الدرع العربي (63% صخور جرانيتية و6% صخور قاعدية وفوق قاعدية) صخور الافيولايت ( و 31% صخور متوسطة).\n" +
                        "تم تقسيم الدرع العربي الى ستة (أقاليم) أو أكثر تفصلها عن بعضها خطوط تصادم أو (التحام) وتتألف هذه الأقاليم في الجزء الغربي من الدرع العربي من أقواس محيطية وغالباً يكون مصاحباً لها معادن الأساس (النحاس والزنك والرصاص) وفي الشرق من صخور ذات طبيعة قارية تكون في الغالب مصاحبة للمعادن النفيسة (الذهب والفضة). وقد نشأت هذه الأقاليم في البداية منفصلة عن بعضها البعض ولكن بعد التصادم والاندماج أصبح لها نفس التاريخ الجيولوجي .وتمتاز خطوط التصادم (أو الالتحام )بوجود معقدات إفيوليتية شديدة التشوه تتميز بوجود الصخور القاعدية وفوق القاعدية ويمثل نطاقي التصادم في غرب الدرع العربي في (صدع ينبع) (وصدع بئر عمق) انصهار أقواس الجزر، أما نطاقات التصادم الموجودة في الشرق فإنها تمثل التصادم المحيطي-القاري (صدع نبيتة ) أو التصادم القاري (صدع الأمار. وقد حدث الاندماج لأقاليم الدرع العربي من حوالي 715 مليون سنة إلى 630 مليون سنة واستمر بعده التشوه وتداخل للصخور النارية المصاحبة للتصادم وتكونت رواسب سميكة من الصخور الرسوبية والمتحولة وحقنت الصخور الجرانيتية خلال الفترة من 640 مليون سنة إلى 570 مليون سنة كما أزاحت صدوع نجد الالتوائية المتكونة في الفترة من 640 مليون سنة إلى 550 مليون سنة أجزاء من الأحزمة إلى الشمال الغربي من الدرع العربي حيث تميزت هذه الفترة بزيادة الجزء العربي من قارة جوندوانا خلال الحدث الحركي للدرع النوبي .وتعرضت الصخور الموجودة في نطق التصادم لتحول وتشوه شديدين وخصوصاً الصخور القاعدية وفوق القاعدية ( الأفيولايت ) وهذه العملية تظهر بشكل واضح في نطاق التصادم الموجود بين عفيف وإقليم الحجاز حيث أدى تطور البحار في حزام الطي المصاحب لانهيار وتمدد الكتل إلى تكوين رسوبيات ضحلة إلى قارية وتميز النشاط القطري الرئيسي خلال هذه الفترة بتداخل صخور جرانيتية سحيقة وقذف صخور بركانية ريوليتية (سليكاتية) وفي نهاية هذه الفترة المجماتية تناوبت لابة بازلتية ومتوسطة مع الرسوبيات في التكوين الأحواض القارية المتكون نتيجة الحركة على طول صدوع نجد العرضية المتجهة شمال إلى شمال غرب. وأظهرت نتائج تقديرات عمر الصخور في الأقاليم الشرقية من الدرع العربي وجود قشرة قارية أقدم من 1200 مليون سنة . وترسبت في الفترة ما بين 850 مليون سنة و 700 مليون سنة في الأقاليم الغربية من الدرع العربي وحدات رسوبية بركانية مصاحبة للصخور السحيقة تظهر في (مدين و الحجاز، وعسير) وأصبحت في الفترة ما بين 700 مليون سنة و 600 مليون سنة ملتحمة مكونةً حزام حركي. ويظهر الجزء الحديث من الدرع العربي مدفوناً تحت صخور الغطاء التابعة للرصيف القاري العربي حيث تبعه حركة رفع وتعرية أدت إلى ظهور الدرع العربي بشكله الحالي الجوفي الذي كون صخور بلوتونية تتراوح في تركيبها بين الجابرو والجرانيت. حدثت بعد ذلك تطورات عديدة أدت الى بناء الجيولوجية الحالية للدرع العربي والتي يمكن تصورها على هيئة أحزمة من الصخور المتتالية التي تبدا من الجنوب الغربي وتتسلسل بانتظام ناحية الشمال الشرقي وهي:١- مجموعة حلي ٢- مجموعة بيش ٣- مجموعة الباحة ٤- مجموعة جدة ٥- مجموعة عبله٦- مجموعة حلبان ٧- مجموعة المردمه ٨- مجموعة شمر ٩- مجموعة الجبيله.\n" +
                        "\n",
                R.drawable.arabian_shield,
            )
        }

        arabian_platform.setOnClickListener {
            setMapStyle("maps/saudi_geo/arabian_platform.json")
            showPopup(
                "الرصيف القاري العربي ",
                "يقع الرف أو الرصيف العربي إلى الشرق من الدرع العربي. ويشكل نحو ثلثي مساحة شبه الجزيرة العربية. وقاعدته هي صفيحة الدرع العربي نفسها، التي ترجع إلى زمن ما قبل الكامبري. والرف العربي هو تتابع من الصخور الرسوبية، التي ترسبت على اليابسة والمياه الضحلة، وتراوح أعمارها بين الزمن الكامبري والبلايوسين. وبصفة عامة يكون ميل هذه الطبقات الصخرية في اتجاه الشرق بعيداً عن الدرع العربي، ويكون ميلاً خفيفاً، ويتراوح سمكها من عدة أمتار في الطرف الشرقي من الدرع العربي، وعشرة آلاف متر في حوض الخليج العربي والربع الخالي. وتتكون الصخور الأقدم التي ترسبت خلال حقب الحياة القديمة، أي بين عصريَ الكامبري والبرمي- من الحجر الرملي والطفل. أما الصخور التي ترسبت في الحقب المتوسطة والحديثة، فتتألف إجمالا من الحجر الجيري. وقد تكون النفط في الطبقات الرسوبية العميقة، بفعل الضغط والحرارة الواقعين على الرواسب المطمورة، الغنية بالمواد العضوية. ثم انتقل إلى طبقات أخرى من خلال الصخور المسامية، حيث انحبس في مكامن مثل الطبقات المحدبة، التي تعلوها صخور غير مسامية، مثل الطفل. إضافة إلى النفط، فإن طبقات الصخور المسامية في الرف العربي تحتوي على مكامن مهمة للمياه الجوفية، أهمها مكمن الوسيع في المنطقة الوسطى من المملكة ومكمن أم رضمة في الجزء الشرقي من شبه الجزيرة العربية؛ ومكمن ساق في وسط شبه الجزيرة العربية وشماليها.\n" +
                        "كانت الجزيرة العربية حتى حوالي 60 مليون سنة مضت جزء من حافة الجزء الجنوبي الشرقي من محيط التيثيس القديم الذي كان يحتل منطقة حزام جبال الألب – الهملايـا الحالي وفاصـلا قارة جوندوانا القديمة (إلى الجنوب ) ولوراسيا (إلى الشمال ) . وأدت الاجتياحات البحرية المتكررة من الشمال والشمال الغربي بشكل دوري إلى حدوث ترسيب دوري للصخور. وكان التغير الجغرافي القديم ناتج من الالتواء البنائي الذي كان أساس لتكون أخدود البحر الأحمر. .وقد أدى ميلان الجزيرة العربية للشرق والتوائها لأسفل نتيجة للأنشطة البنائية على طول حزام الطي بجبال زاجروس وجبال عمان إلى تكوّن منخفض الخليج العربي والسماح باجتياحات بحرية من المحيط الهندي وأدى الهبوط المتباين المحلي لتكون عدة أحواض ثانوية منها الربع الخالي . كما أدى ضعف القشرة في وسط الزمن الثلاثي إلى تكون أخدود البحر الأحمر وإعادة تكون القباب على طول الحافة الشرقية للأخدود والتي خلالها ارتفعت الحافة الغربية للصفيحة العربية حوالي 3كم لتكون جرف البحر الأحمر .وقد صاحب تكون القباب تدفق كميات كبيرة من البازلت أدت إلى تكون الحرات الموجودة في غرب الجزيرة العربية.\n" +
                        "يوجد نحو ثمانية وعشرون تكوينا رسوبيا تغطي الرصيف الرسوبي القاري وتنتشر في المناطق الوسطى والشمالية والشرقية للمملكة، وتتكون من صخور رسوبية ذات اصول قارية وبحرية من  صخور الحجر الرملي والجيري والطفل وحجر الطين والدلوميت\n" +
                        "والجبس والانهيدريت الى غير ذلك. تميل صخور الرصيف ميلاُ لطيفاُ ناحية الشرق والشمال الشرقي والجنوب الشرقي لتكون عدداُ من الأحواض الرسوبية العميقة . تنكشف الصخور الرسوبية التابعة لدهر الحياة القديمة في وسط شبة الجزيرة على هيئة حزام عظيم مقوس ينحني على طول الحافة الشرقية للدرع العربي.  هناك أربعة أحواض رسوبية رئيسية كبرى داخل الرصيف العربي ملاصقة لبعض أجزاء الرصيف الداخلي وتحتوي على تتابع سميك من الصخور الرسوبية وهي:\n" +
                        "•\tحوض الربع الخالي : يمتد باتجاه الشمال الشرقي ومن وسط الربع الخالي عرضه\n" +
                        "3000 كم، يحوي على رواسب العصر الثلاثي.\n" +
                        "•\t حوض شمال الخليج العربي: يغطي المنطقة الموجودة عند رأس الخليج العربي\n" +
                        "ويحتوي على صخور تابعة للعصر الكريتاوي.\n" +
                        "•\t حوض الدبدبة: شمال حوض الخليج العربي ويحوي صخور رسوبية تابعة للكريتاوي ويتخلله رواسب حديثه (حصى وزلط) تابعه لاودية الباطن والرمه.\n" +
                        "•\tحوض السرحان – طريف: ويوجد شمال غرب المملكة وهو مملوء بصخور متتابعة من رواسب الكريتاوي العلوي والايوسين ومغطى بجزء كبير من الصخور البركانية\n",
                R.drawable.arabian_platform,
            )

        }

        harat.setOnClickListener {
            setMapStyle("maps/saudi_geo/harat.json")

            showPopup(
                "الحرات البركانية ",
                "تغطي الحرات جزءاً كبيراً من الصفيحة العربية حوالي (180،000كم2) وتتكون من حقول بازلتية تابعة للعصر الثلاثي والرباعي وتمتد على هيئة حزام واسع متقطع ذو اتجاه شمالي من اليمن جنوباً حتى سوريا شمالاً، ويعود هذا النمط من الانتشار إلى حركات التكسر (التشقق و الصدوع) المصاحبة لتكون البحر الأحمر، والتي بدأت في نهاية عصر الأوليجوسين أو بداية عصر الميوسين (حوالي 25مليون سنة )فترة انفصال الدرع العربي عن الدرع النوبي الذي أدت إلى انخفاض على طول محور البحر الأحمر وحوافه حيث أصبحت الشقوق ممرا للصهارة البازلتية وتكونت قواطع الجابرو والدولوريت المتجه بمحاذاة محور البحر الأحمر في الحافة الغربية من الدرع العربي على هيئة شقوق مملؤءة بالصهارة القاعدية والتي قد تبلورت في الأعماق وظهرت في الوقت الراهن نتيجة للتعرية الجوية التالية لتكوينها .\n" +
                        "وقد وصلت معظم الصهارة إلى سطح الأرض وكونت انسيابات سطحية أدت إلى تكوين الحرات (الهضاب البازلتية) والتي تغطي حوالي 10،000كم2 من الدرع العربي وساحل البحر الأحمر والجروف وحدثت الثورات البركانية منذ عصر الميوسين (25مليون سنة) إلى الوقت الحاضر حيث تم تسجيل عدة ثورات بركانية في التاريخ الجيولوجي للمنطقة . وتتميز حرات المملكة الواقعة بين الكيلو 50 والكيلو 500 شرق ساحل البحر الأحمر (ماعدا حرة البرك على ساحل البحر الأحمر) بجنوب غرب المملكة بشكل عام بخصائص بركانية وصخرية وتركيبية . ويعكس ظهور الانسيابات القاعدية والحمضية والمخاريط والقباب وجود نشاط بركاني في الماضي الجيولوجي القريب والتي تم تأكيدها من خلال تحديد العمر الجيولوجي بواسطة الإشعاع والسجلات الجيولوجية والتي أظهرت بان آخر ثوران بركاني كان بحرة رهط عام 1256م\n" +
                        "أن الحرات يوجد بها عدد كبير من البراكين الصغيرة، والفوهات البركانية بأشكالها المختلفة، وتحتوي على عدد من الصخور البركانية التي تنتج من ثوران البراكين، ودفعها لمواد صهيرية (لابات وفتات)، والصخور البركانية السائدة في المملكة هي البازلت، وتكون على هيئة لابات، وبأحجام أقل فتات بركاني بازلتي، وتوجد بعض الصخور تسمى تراكيت، أو ريولايت فاتحة اللون، ويستخرج من هذه الصخور الفتات البازلتي، ويستخدم في مواد البناء (البلوك البركاني)، والفتات البركاني (البوزولان)، وتستخدم اللابات البازلتية بعد تقطيعها كبلوكات في المباني، ومصدات بحرية على الشواطئ؛ لمتانة هذه الصخور، كما يمكن استخراج بعض المعادن، وتستخدم في صناعة الحلي، والمجوهرات.\n" +
                        "ومن أبرز الحرات :حرة رهاط تقع في المدينة المنورة، حرة خيبر تقع في خيبر شمال المدينة المنورة، حرة عويرض تقع غرب محافظة العلا، حرة جبل يار تقع بالقرب من الحدود مع اليمن، حرة كشب تقع شمال شرق الطائف، حرة الرحا تقع في تبوك، حرة إثنين تقع بين المدينة المنورة وحائل، حرة لونير تقع في محافظة العيص ، و حرة البرك، و حرة البقوم، و حرة نواصف، و حرة حضن، و حرة الحارة (الشام) في المملكة العربية السعودية؛ علماً بأن حرة الحارة تمتد شمالاً عبر الأردن إلى جنوب سوريا.\n" +
                        "ومن أهم أنواع الصخور البركانية : الجرانيت يستخدم في مواد البناء وفي الاستخدام الزخرفي وفي صناعة التماثيل، البازلت يستخدم كعازل للمفاعلات النووية وفي تكوين الخرسانة للبناء وتسقيف الأبنية، الكوارتز يستخدم في مواد بناء الطرق والسكك الحديدية، البيومس يستخدم في إزالة الجلد الميت وفي مواد التنظيف، الأويسيديان والبيريدوتاتيت يستخدمان في صناعة الحلي والمجوهرات.\n",
                R.drawable.harat,
            )

        }

        swahel.setOnClickListener {
            setMapStyle("maps/saudi_geo/sahel.json")
            showPopup(
                "السهول الساحلية",
                "•\tسهول تهامة تعرف بـ السهل الساحلي وتنقسم تهامة الشمالية والجنوبية، تكون الشمالية في صورة شريط ضيق يبدأ من المنطقة الساحلية المتموجة التي ما بين البحر الأحمر من الجانب الغربي ومن الشرق سلسلة جبال الحجاز، كما أنها تعتبر منطقة رملية وبها طمي ممتد بطول 1080 كم يبدأ من جدة جنوباً وحتى مدينة الحقل شمالاً كما أن هذا الشريط متواجد في مستوى سطح البحر بالجنوب وقد يرتفع قليلاً من جهة الشرق بسبب الطمي الذي يأتي من جبال الحجاز. تمتد سهول تهامة على طول ساحل البحر الأحمر من العقبة شمالا وحتى حدود اليمن جنوبا وهي عبارة عن شريط ضيق أقصى عرض له يبلغ حوالي ٤٠ كم عند مدينة جازان. تكثر في هذا السهل الشعاب والرواسب المرجانية والرؤوس والخلجان ومصبات الاوديه والسبخات الساحلية والمراوح الفيضية والحرات والكثبان الرملية، يحد السهل من الناحية الشرقية سلاسل الجبال الغربية ( جبال السروات ). كذلك في تهامة يوجد الكثير من الحرات والتي تعتبر مناطق سوداء تشتمل على كميات من الحجارة المحرقة بالنار، ويعد هذا النوع من الحجارة مكون من سائل بركاني كان تكوينه نتاج البراكين، ومن الممكن استخراج الأحجار الكريمة والمعادن من تلك الأحجار. يشكل السهل الساحلي للبحر الأحمر الحد الشرقي لانخساف كبير تحده الجروف القارية والتي اتسعت خلال انفصال قاع البحر، ويتكون هذا الساحل من نطاق ضيق من تتابعات سميكة من الصخور الرسوبية التابعة لعصر الأوليجوسين . حيث ترسبت عدة رواسب قارية فتاتيه فوق الرواسب البحرية القديمة التابعة لمحيط التيثس في عصر الميوسين وتحت أول الطبقات البحرية التي نشأت مع انفتاح البحر الأحمر في وسط عصر الميوسين وهذه الصخور القارية الفتاتية غير معروفة نظرا لوجودها على هيئة بقع تقع على طول السهل الساحلي للبحر الأحمر وتأثرها بصدوع الانخساف . \n" +
                        "•\tأما السهول الساحلية الشرقية فهي تطل على الخليج العربي، وخليج عمان، وتمتد من الكويت شمالا إلى رأس الحد في عمان جنوبا، وتنقسم إلى: سهول الأحساء وهي السهول الشمالية وأراضيها خصبة، ويتخللها بعض السبخات الملحية والآبار الجوفية.  يبلغ طول السهل الساحلي السعودي على الخليج العربي نحو 500 كم ويبلغ معدّل عرضه 60 كم. ويتميّز بأنه منخفض ولا يرتفع كثيرًا عن مستوى سطح البحر، ولذلك تكثر فيه السبخات والأراضي الملحية والتلال الرملية. وتتسم المياه المجاورة لساحل الخليج بأنها ضحلة، الأمر الذي أدى إلى بروز الخلجان والرؤوس وتكوّن الشعاب المرجانية، ويلي السهل الساحلي باتجاه الداخل سهول الأحساء المتكوّنة من الرمال والحصى الغنية بمياه العيون والآبار التي تروي مساحات زراعية مهمة.\n",
                R.drawable.swahel,
            )

        }

        setupClickListener()

    }


    private fun setupClickListener() {
        val layerIds = polygonInfo.keys.toList() // Ensure these are correct
        val queryOptions = RenderedQueryOptions(layerIds, null)

        mapboxMap.addOnMapClickListener { point ->
            val screenPoint = mapboxMap.pixelForCoordinate(point)
            mapboxMap.queryRenderedFeatures(screenPoint, queryOptions) { expected ->
                expected.value?.let { features ->
                    if (features.isNotEmpty()) {
                        val feature = features.first()
                        val sourceLayer = feature.sourceLayer

                        Log.d("MapClick", "Feature: $feature")
                        Log.d("MapClick", "Source Layer: $sourceLayer")

                        polygonInfo[sourceLayer]?.let { (title, description) ->
                            handlePolygonClick(title, description)
                        } ?: Log.d("MapClick", "No matching polygon info found for source layer: $sourceLayer")
                    } else {
                        Log.d("MapClick", "No features found")
                    }
                }
            }
            true
        }
    }


    @SuppressLint("InflateParams")
    private fun handlePolygonClick(title: String, description: String) {
        val popupView = LayoutInflater.from(this).inflate(R.layout.polygon_popup_layout, null)
        val tvTitle = popupView.findViewById<TextView>(R.id.tvTitle)
        val tvDescription = popupView.findViewById<TextView>(R.id.tvDescription)
        val btnClose = popupView.findViewById<Button>(R.id.btnClose)

        tvTitle.text = title
        tvDescription.text = description

        val popupWindow = PopupWindow(popupView,
            LinearLayout.LayoutParams.WRAP_CONTENT,
            LinearLayout.LayoutParams.WRAP_CONTENT,
            true)

        btnClose.setOnClickListener { popupWindow.dismiss() }

        // For example, show it at the center of the screen, adjust as needed
        popupWindow.showAtLocation(popupView, Gravity.CENTER, 0, 0)
    }





    @SuppressLint("InflateParams")
    private fun showPopup(title: String, description: String, imageResId: Int) {
        val popupView = LayoutInflater.from(this).inflate(R.layout.popup_layout, null)
        popupView.findViewById<TextView>(R.id.title).text = title
        popupView.findViewById<TextView>(R.id.description).text = description
        popupView.findViewById<ImageView>(R.id.image).setImageResource(imageResId)

        val dialog = Dialog(this)
        dialog.setContentView(popupView)

        val displayMetrics = resources.displayMetrics
        val screenWidth = displayMetrics.widthPixels

        dialog.window?.setLayout((screenWidth * 0.9).toInt(), LinearLayout.LayoutParams.WRAP_CONTENT)

        dialog.show()

        val closeButton = popupView.findViewById<Button>(R.id.closeButton)
        closeButton.setOnClickListener {
            dialog.dismiss()
        }
    }

    private fun setMapStyle(assetPath: String) {
        val styleJson = loadJsonFromAsset(assetPath)
        mapboxMap.loadStyleJson(styleJson)
    }

    private fun loadJsonFromAsset(filename: String): String {
        return assets.open(filename).bufferedReader().use { it.readText() }
    }

}
