package com.example.map

import android.annotation.SuppressLint
import android.app.Dialog
import android.graphics.Bitmap
import android.graphics.Canvas
import android.graphics.drawable.BitmapDrawable
import android.graphics.drawable.Drawable
import android.os.Build
import android.os.Bundle
import android.util.Log
import android.view.LayoutInflater
import android.view.View
import android.widget.Button
import android.widget.ImageView
import android.widget.LinearLayout
import android.widget.ProgressBar
import android.widget.TextView
import androidx.appcompat.app.AppCompatActivity
import androidx.core.content.ContextCompat
import com.google.android.material.floatingactionbutton.FloatingActionButton
import com.mapbox.geojson.Point
import com.mapbox.maps.MapView
import com.mapbox.maps.MapboxMap
import com.mapbox.maps.CameraOptions
import com.mapbox.maps.plugin.annotation.annotations
import com.mapbox.maps.plugin.annotation.generated.PointAnnotationManager
import com.mapbox.maps.plugin.annotation.generated.PointAnnotationOptions
import com.mapbox.maps.plugin.annotation.generated.OnPointAnnotationClickListener
import com.mapbox.maps.plugin.annotation.generated.PointAnnotation
import com.mapbox.maps.plugin.annotation.generated.createPointAnnotationManager
import org.apache.poi.xssf.usermodel.XSSFWorkbook
import java.io.IOException
import kotlinx.coroutines.*

class MaterialsActivity : AppCompatActivity(), OnPointAnnotationClickListener {

    data class LocationMarker(
        val latitude: Double,
        val longitude: Double,
        val nameEn: String,
        val nameAr: String,
        val region: String,
        val locationName: String,
        val iconResId: Int

    )

    private lateinit var mapView: MapView
    private lateinit var mapboxMap: MapboxMap
    private lateinit var pointAnnotationManager: PointAnnotationManager
    private val annotationDataMap = HashMap<Long, LocationMarker>()

    @SuppressLint("UseCompatLoadingForDrawables", "InflateParams", "SetTextI18n")
    override fun onCreate(savedInstanceState: Bundle?) {

        if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.KITKAT) {
            // This code will hide the system navigation bar
            window.decorView.systemUiVisibility = (
                    View.SYSTEM_UI_FLAG_HIDE_NAVIGATION
                            or View.SYSTEM_UI_FLAG_IMMERSIVE_STICKY
                    )
        }


        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_materials)
        supportActionBar?.hide()

        //START: Back button
        val homeBtn: FloatingActionButton = findViewById(R.id.home)
        homeBtn.setOnClickListener {
            onBackPressed()
        }
        //END: Back button

        //START: Brief button
        val brief: Button = findViewById(R.id.brief)
        brief.setOnClickListener {
            // Inflate the popup view
            val popupView = LayoutInflater.from(this).inflate(R.layout.popup_brief, null)
            popupView.findViewById<TextView>(R.id.title).text = "المعادن الإقتصادية"
            popupView.findViewById<TextView>(R.id.description).text = " المعدن Mineral مادة صلبة متجانسة وغير عضوية تكونت بفعل عوامل طبيعية لها تركيب كيميائي محدد ( وغير ثابت ) وترتيب ذري داخلي محدد .تعتبر الذرة هي أصغر جزء من المادة وتحتفظ بخواصها الطبيعية ، تتجمع الذرات مع بعضها لتكون العنصر وتتجمع العناصر مع بعضها لتكون المعادن وتتجمع المعادن مع بعضها لتكون الصخر ، فإذا احتوى المعدن على عناصر ذات قيمة اقتصادية فيسمى معدن خام أو معدن اقتصادي ...\n" +
                    "وإذا احتوى الصخر على معدن خام يسمى راسب معدني.\n" +
                    " المعدن الخام Ore Mineral هو المعدن الذي يمكن استخلاص فلز أو أكثر منه بصورة اقتصادية . إما أن يكون على هيئة فلز حر مثل الذهب والبلاتين أو على هيئة الفلز متحد مع عنصر أو عناصر أخرى مكوناً مركبات كيميائية متعددة ( أكاسيد ، كبريتيدات ). \n" +
                    "المعادن تنقسم إلى معادن فلزية و معادن لافلزية أو مواد أرضية مثل الفحم, والصلصال, والبترول.\n" +
                    "المعادن الفلزية\n" +
                    "مثل الذهب والنحاس والحديد والنيكل فهي ذات ألوان طبيعية ثابتة, كما أن لها بريقاً معدنياً, ولها شكل خاص , فهي إما كلوية الشكل مثل بعض معادن الحديد, أو شجرية مثل معادن المنجنيز. وتتميز المعادن الفلزية أيضاً بأنها ذات صفات خاصة من حيث الصلادة, فالمعدن الصلد يمكن أن يخدش ما هو أقل منه صلادة.\n" +
                    "•\tالمعادن الفلزية النقية : - الذهب . - الفضة .  النحاس . - القصدير- خام التن . \n" +
                    "•\tمعادن فلزية غير نقية : - الألمنيوم-البوكسايت - الأنتيمون -الإستبنايت - الكروم-الكرومايت - الكوبالت - النيوبيوم-كولومبايت - التنتالوم-تنتالايت - معادن خامات الحديد - الرصاص-الجالينا - الليثيوم-مركبات الليثيوم - المنجنيز-البيرولوزايت - الموليبدنيوم– الموليبدنايت - النيكل- النيكولايت - معادن مجموعة البلاتيِن - العناصر الأرضية النادرة - التيتانيوم-الإلمينايت - التنجستن-الولفرامايت - الفاناديوم-الفانادينايت - الزنك-السفاليرايت . \n" +
                    "\n" +
                    "\n" +
                    "المعادن اللافلزية\n" +
                    "فتختلف عن الفلزات في أنها تستخدم وهي على صورتها التي تستخرج بها من الطبيعة, فالصلصال مثلا يستخدمه الإنسان لخواصه الطبيعية وليس لاحتوائه على الألومنيوم, كما أن الأسبستوس ) الصخر الحريري ( يستخدمه الإنسان لبريقه الحريري ,و لشكله الليفي, ولا للحصول على الماغنسيوم الداخل في تكوينه.  فالمعادن اللافلزية تستخدم في الحقيقة لما لها من خصائص ومميزات طبيعية وليس لخصائصها الكيمائية.\n" +
                    "•\tالمعادن غير الفلزية : السيليكا-الكوارتز - الفلسبار - الفلور-الفلورايت - الباريوم-البارايت - البيريليوم-البريل - الهالايت - الجبس - الكبريت - الكالسيوم -الحجر الجيري - الفوسفور-الفوسفات - الميكا (حجر البلق) - معادن الطين - الأسبستوس - الفحم - اليورانيوم\n" +
                    "\n" +
                    "تنتشر الثروات المعدنية في المملكة في أكثر من 5,300 موقع، وتقدر قيمتها بنحو خمسة تريليونات ريال، وثمة نحو 360 مجمعً تعديني تنتج العديد من المعادن والمنتجات المعدنية التي لها دور مهم في تطوير سلاسل القيمة للمعادن الفلزية واللافلزية؛ إذ يبلغ إنتاج المملكة من البوكسايت (الخام الطبيعي الذي يصنع منه معظم معدن الألومنيوم) حوالي 4.9 ملايين طن سنويًا، يتم معالجته لإنتاج حوالي مليون طن من الألمنيوم سنويًا، كما يتم إنتاج حوالي 409 آلاف أوقية من الذهب بمنطقة الدرع العربي الغنية بالمعادن النفيسة والمعادن الأساس، ونحو 68 ألف طن سنويًا من مركَّزات النحاس والزنك، و24.6 مليون طن من خام الفوسفات سنويًا، حيث تتم معالجته لإنتاج نحو 5.26 ملايين طن من الأسمدة الفوسفاتية.\n" +
                    "تم اكتشاف العديد من المعادن في المملكة، تم تقسيمها إلى: معادن فلزية: كالذهب والنحاس والفضة والحديد والكروم والألومنيوم. معادن مشعة: اليورانيوم والثوريوم. معادن لا فلزية: كالفحم، الكبريت، الفوسفات. معادن صناعية: كالماغنسيوم والفلورايت والأسبستوس والمايكا. أحجار الزينة والبناء: كالجرانيت والرخام والطين الرمل الزجاجي.\n" +
                    "تستهدف المملكة -ضمن رؤية 2030م- رفع الناتج المحلي من قطاع التعدين من 17 مليار دولار إلى 64 مليار دولار بحلول 2030م، ورفع نسبة مشاركة قطاع التعدين في الناتج المحلي الوطني لتتجاوز %5، بزيادة أعمال الكشف عن المعادن، وزيادة قيمة الاستثمارات التعدينية من نحو 3.9 مليار ريال خلال 2020م، إلى 115 مليار ريال في 2025م، بفتح المجال أمام المستثمرين المحليين والأجانب في مجال التنقيب عن المعادن.\n"

            val briefDialog = Dialog(this)
            briefDialog.setContentView(popupView)

            val displayMetrics = resources.displayMetrics
            val screenWidth = displayMetrics.widthPixels

            briefDialog.window?.setLayout(
                (screenWidth * 0.8).toInt(), // the width
                LinearLayout.LayoutParams.WRAP_CONTENT
            )

            briefDialog.show()

            val closeButton = popupView.findViewById<Button>(R.id.closeButton)
            closeButton.setOnClickListener {
                briefDialog.dismiss()
            }
        }
        //END: Brief button


        mapView = findViewById(R.id.mapView)
        mapboxMap = mapView.getMapboxMap()

        // Set initial map style from your custom JSON
        setMapStyle("maps/saudi_geo/sahel.json")
        setupMetalButtons()

        pointAnnotationManager = mapView.annotations.createPointAnnotationManager().apply {
            addClickListener(this@MaterialsActivity)
        }


        // Set initial camera position
        val initialPosition = CameraOptions.Builder()
            .center(Point.fromLngLat(47.189224, 24.694291)) // Riyadh, Saudi Arabia
            .zoom(4.3)
            .build()
        mapboxMap.setCamera(initialPosition)

        val resetZoomBtn: FloatingActionButton = findViewById(R.id.reset_zoom)
        resetZoomBtn.setOnClickListener {
            mapboxMap.setCamera(initialPosition)
        }


    }

    // Icons configration
    private fun addMarkerWithPopup(marker: LocationMarker) {
        val point = Point.fromLngLat(marker.longitude, marker.latitude)
        val iconName = "ic_${marker.nameEn.lowercase()}"
        val pointAnnotationOptions = PointAnnotationOptions()
            .withPoint(point)
            .withIconImage(iconName)
            .withIconSize(0.2)

        val annotation = pointAnnotationManager.create(pointAnnotationOptions)
        annotationDataMap[annotation.id] = marker
    }

    override fun onAnnotationClick(annotation: PointAnnotation): Boolean {
        val markerData = annotationDataMap[annotation.id] // Retrieve data from the map
        if (markerData != null) {
            showPopup(markerData.nameAr, markerData.locationName, markerData.region, markerData.latitude, markerData.longitude)
        }
        return true
    }

    // Icons text
    @SuppressLint("InflateParams", "SetTextI18n")
    private fun showPopup(name: String, locationName: String, region: String, lat: Double, long: Double) {
        val popupView = LayoutInflater.from(this).inflate(R.layout.popup_layout, null)
        popupView.findViewById<TextView>(R.id.title).text = name
        popupView.findViewById<TextView>(R.id.description).text =
            "الموقع: " + region +"\n" + "المنطقة الإدارية: " + locationName + "\n" + "خط الطول شرقًا: " + long + "\n" + "خط العرض شمالًا: " + lat

        val dialog = Dialog(this)
        dialog.setContentView(popupView)

        val displayMetrics = resources.displayMetrics
        val screenWidth = displayMetrics.widthPixels

        dialog.window?.setLayout((screenWidth * 0.3).toInt(), LinearLayout.LayoutParams.WRAP_CONTENT)

        dialog.show()

        val closeButton = popupView.findViewById<Button>(R.id.closeButton)
        closeButton.setOnClickListener {
            dialog.dismiss()
        }
    }


    private fun setMapStyle(assetPath: String) {
        val styleJson = loadJsonFromAsset(assetPath)
        mapboxMap.loadStyleJson(styleJson) { style ->
            // Define the list of metals
            val metals = listOf(
                "Copper", "Feldspar", "Gold", "Granite", "Gypsum",
                "Iron", "Kyanite", "Limestone", "Magnesite", "Marble",
                "Nickel", "Phosphate", "Sandstone", "Bauxite", "Chromium",
                "SilicaSand", "Silver", "Zinc", "NephelineSyenite", "Diatomite",
                "Perlite", "Bentonite", "Barite", "Quartzite", "Clay",
                "Pozzolan", "Salt", "Kaolin", "AggregateMaterials", "Talc",
                "Uranium", "Aluminium", "Lead", "Asbestos", "Ilmenite", "Olivine",
                "Garnet","Zeolite", "Graphite","Dolomite","Basalt"
            )

            metals.forEach { metal ->
                val iconName = "ic_${metal.lowercase()}"
                val iconResId = resources.getIdentifier(iconName, "drawable", packageName)

                if (iconResId != 0) {
                    val drawable = ContextCompat.getDrawable(this, iconResId)
                    drawable?.let {
                        val bitmap = drawableToBitmap(it)
                        style.addImage(iconName, bitmap)
                    }
                } else {
                    Log.e("MaterialsActivity", "Resource not found for icon: $iconName")
                }
            }
        }
    }

    @SuppressLint("DiscouragedApi")
    private fun setupMetalButtons() {
        // Define the list of metals (For buttons)
        val metals = listOf(
            "Copper", "Feldspar", "Gold", "Granite", "Gypsum",
            "Iron", "Kyanite", "Limestone", "Magnesite", "Marble",
            "Nickel", "Phosphate", "Sandstone", "Bauxite", "Chromium",
            "SilicaSand", "Silver", "Zinc", "NephelineSyenite", "Diatomite",
            "Perlite", "Bentonite", "Barite", "Quartzite", "Clay",
            "Pozzolan", "Salt", "Kaolin", "AggregateMaterials", "Talc",
            "Uranium", "Aluminium", "Lead", "Asbestos", "Ilmenite", "Olivine",
            "Garnet","Zeolite", "Graphite","Dolomite","Basalt"
        )
        metals.forEach { metal ->
            val buttonId = resources.getIdentifier(metal, "id", packageName)
            findViewById<Button>(buttonId)?.setOnClickListener {
                materialInfo(metal)
                filterMarkersByTitle(metal)
            }
        }
    }

    private fun filterMarkersByTitle(metalTitle: String) {
        findViewById<ProgressBar>(R.id.progressBar).visibility = View.VISIBLE
        CoroutineScope(Dispatchers.Main).launch {
            val filteredMarkers = withContext(Dispatchers.IO) {
                readLocationMarkersFromExcel().filter { it.nameEn == metalTitle }
            }

            pointAnnotationManager.deleteAll()
            filteredMarkers.forEach { addMarkerWithPopup(it) }
            findViewById<ProgressBar>(R.id.progressBar).visibility = View.GONE
        }
    }

    @SuppressLint("DiscouragedApi")
    private fun readLocationMarkersFromExcel(): List<LocationMarker> {
        val markers = mutableListOf<LocationMarker>()
        try {
            val inputStream = assets.open("materials.xlsx")
            val workbook = XSSFWorkbook(inputStream)
            val sheet = workbook.getSheetAt(0)
            for (row in sheet) {
                if (row.rowNum == 0) continue
                val locationName = row.getCell(0).stringCellValue
                val region = row.getCell(1).stringCellValue
                val longitude = row.getCell(2).numericCellValue
                val latitude = row.getCell(3).numericCellValue
                val nameEn = row.getCell(4).stringCellValue
                val name_ar = row.getCell(5).stringCellValue
                val iconResId = resources.getIdentifier("ic_$nameEn", "drawable", packageName)
                markers.add(LocationMarker(latitude, longitude, nameEn, name_ar, locationName, region, iconResId))
            }
            workbook.close()
        } catch (e: IOException) {
            // Handle exception
        }
        return markers
    }

    private fun loadJsonFromAsset(filename: String): String {
        return assets.open(filename).bufferedReader().use { it.readText() }
    }

    private fun drawableToBitmap(drawable: Drawable): Bitmap {
        if (drawable is BitmapDrawable) {
            return drawable.bitmap
        }

        val bitmap = Bitmap.createBitmap(drawable.intrinsicWidth, drawable.intrinsicHeight, Bitmap.Config.ARGB_8888)
        val canvas = Canvas(bitmap)
        drawable.setBounds(0, 0, canvas.width, canvas.height)
        drawable.draw(canvas)

        return bitmap
    }

    private fun materialInfo(metal: String){

        if(metal == "Copper") {
            metalInfoPopUp(
                "النحاس Copper",
                "يتميز النحاس بقدرته العالية على السحب والطرق واللدونة وموصل جيد للكهرباء والحرارة ويعتبر الثاني في الترتيب بالنسبة للتوصيل الحراري بعد معدن الفضة، وأول معدن استخدمه الإنسان قديما في صناعة السهام والسكاكين والأدوات الحربية وأدوات قطع الأشجار. كما يتميز بإمكانية تدوير استعماله مرات عديدة دون أن يفقد خواصه ولأنه معدن غير سام فيمكن تشكيله على البارد والساخن حيث يتم سبك النحاس في قوالب مع عناصر أخرى. له أهمية كبيرة في الصناعات الكيميائية مثل الأغذية والأسمدة والمبيدات وفي الأصباغ والطلاء. تم اكتشاف ما يزيد عن 800 مكمن لخام النحاس وأهمها جبل صايد كذلك تتواجد رواسب جيدة للنحاس في كل من جبل سمران ومنطقة النقرة وحلاحيلة.",
                R.drawable.copper
            )
        }else if(metal == "Feldspar"){
            metalInfoPopUp(
                "الفلدسبار Feldspar",
                "الفلدسبار معدن ذو ألوان فاتحة غالبا كالأبيض والوردي والأخضر والبرتقالي أو الرمادي. ويستخدم في العديد من الصناعات أهمها: صناعة الزجاج حيث يعطي قوة ميكانيكية ومقاومة حرارية للزجاج، وصناعة الخزف ويستخدم فيها كعامل مساعد للصهر وفي صناعة مواد الكشط نظرا لقدرته على التكسر ويستخدم أيضا كمواد حشو في صناعة البلاستيك، والدهانات، والمطاط، وصناعة العوازل الكهربائية. ومن أهم مناطق تواجد الفلدسبار في المملكة: منطقة الرويضة غرب الرياض وهو ملائم لصناعة الخزف. منطقة بئر نبط شمال ينبع البحر وهو ملائم لصناعة السيراميك. منطقة بئر سرار  شمال مدينة بيشة وهو ملائم لصناعة الخزف و منطقة جبل سودة جنوب مدينة حقل.",
                R.drawable.feldspar
            )
        }
        else if(metal == "Gold"){
            metalInfoPopUp(
                "الذهب Gold",
                "الذهب معدن ثمين رقيق ولين سهل الطرق وخامل وغير نشط كيميائيا، ونقاوته تقاس عالميا بدرجة الصفاء ويتصف بقوة توصيله للحرارة والكهرباء وعدم التحلل ولذلك كان من أفضل المعادن في صناعة المجوهرات والعملات، ويستخدم في أغراض الزينة والزخرفة لدوام بريقه وعدم تأكسده أو تلفه عند تعرضه للهواء أو الماء. يعتبر أكثر المعادن قابلية للطرق وله استعمالات صناعية وكيميائية عديدة حيث يدخل ضمن المواد الكيميائية المستخدمة لأغراض التصوير وكحشوات للأسنان وفي صناعة الترانزستور والمحفزات ومواد اللحام والنقود وأجزاء من الأجهزة الالكترونية والطبية والكهربائية وأجهزة الحاسوب والهواتف الخلوية. تم اكتشاف ما يقارب ١٠٠٠ مكمن للذهب في المملكة وأهم مناجم الذهب المنتجة في المملكة هي: منجم مهد الذهب ومنجم الأمار ومنجم الصخيبرات ومنجم الحجار ",
                R.drawable.gold
            )
        }
        else if(metal == "Granite"){
            metalInfoPopUp(
                "الجرانيت Granite",
                "الجرانيت صخر ناري متبلور قابل للقطع والصقل والتلميع ، ويعتبر أهم ما يمكن إضافته إلى المنشآت المعمارية. يتميز بالقدرة على تحمل الخدش والعوامل الجوية الأخرى. ويستخدم الجرانيت في المنشأت في تغطية الواجهات والأرضيات لإكسابها الجمال ويوجد بالمملكة الكثير من مواقع الجرانيت وأهمها: الرويضة بمحافظة القويعية - بر عسكر: شمال غرب نجران ويتميز باللون البني. \n" +
                        "النجوف: غرب نجران ويتميز باللون الأحمر القرمزي، جبل كور شمال غرب رنية يتميز باللون الأخضر وجبل وردات شمال رنية يتميز باللون الوردي وجبل البكري شمال شرق عفيف يتميز باللون الرمادي. \n" +
                        " كما يوجد في منطقة مكة المكرمة في الهدا ووادي ليه والجموم وفي منطقة حائل. \n",
                R.drawable.granite
            )
        }
        else if(metal == "Gypsum"){
            metalInfoPopUp(
                "الجبس Gypsum",
                "الجبس من أكثر المعادن انتشارا في الطبيعة سواء كمعدن أو كصخر رسوبي. ويتواجد في الطبيعة مع الحجر الجيري والطين ويتدرج لونه من الزجاجي الشفاف إلى الأبيض شيه الشفاف إلى الرمادي ومن البني إلى الأحمر. وللجبس استخدامات صناعية عديدة في البناء وبلاط الأسقف، والفواصل. وكذلك يستخدم كعوازل حرارية وكمنظمات لقياس الرطوبة، وفي إنتاج الاسمنت البورتلاندي، ويستخدم الجبس الطبيعي كسماد طبيعي، كما يستخدم في صناعة الزجاج، ويستخدم الجبس الناعم في صناعة الدهانات والصمغ، وفي صناعة حشوات الورق. وأهم مواقع الجبس في المملكة على امتداد ساحل البحر الأحمر من خليج العقبة شمالا إلى جازان جنوبا، وتتركز بين خليج العقبة ومدينة ينبع البحر: منطقة مقنا - شرم محار- شرم حسي، في جبل بوانه شمال شرم محار. منطقة القصب: يتواجد الجبس شمال ينبع البحر. شرم الخور مصدر للجبس الأبيض. كما يتواجد أيضا في منطقة الخرج القريبة من مدينة الرياض وخاصة في السهول الجنوبية وجنوب شرق أشقر مراغة وفي العيون. توجد رواسب الجبس شمال مدينة بريدة. ويتواجد الجبس أيضا بكميات كبيرة في المنطقة الشمالية وكذلك في المنطقة الشرقية بموقع خشم أم حويض على خليج سلوى وفي منطقة عين دار. ",
                R.drawable.gypsum
            )
        }
        else if(metal == "Iron"){
            metalInfoPopUp(
                "الحديد Iron",
                "يتميز الحديد بقابليته للسحب والطرق والثني وله خاصية التمغنط، ولونه الأصلي عندما يكون نقيا يميل إلى الفضي وسرعان ما يتغير إلى اللون الأحمر أو البني إذا تعرض للهواء الرطب. الحديد هو المكون الرئيسي لصخور النيازك، ويعد الحديد من أكثر المعادن وأوسعها استعمالا من قبل الإنسان ويرجع ذلك لمميزاته العديدة وخواصه وتوفره في القشرة الأرضية وإمكانية استخلاصه وفصله من الصخور المكونة له. ويعتبر الحديد هو أساس الصناعات وخاصة الصناعة الهيكلية فسبائكه شائعة الاستعمال في جميع الهياكل المعدنية والهندسية البنائية والخراطة والمشغولات ووسائل النقل والمكابس والأربطة الحديدية والمكائن. ويستغل خام الرمل الحديدي من قبل مصانع الأسمنت. وتتواجد رواسب الحديد في عدة مواقع أهمها وادي الصواوين جنوب غرب مدينة تبوك وكذلك حديد أدساس جنوب غرب مدينة الرياض. وحديد وادي فاطمة في منطقة الشميسي غرب مكة المكرمة. ",
                R.drawable.iron
            )
        }
        else if(metal == "Kyanite"){
            metalInfoPopUp(
                "الكيانايت Kyanite",
                "الكيانايت معدن شديد المقاومة للحرارة، ويتميز بلونه الأزرق وبلوراته الطويلة اللوحية، ويعد مصدرا لعنصر الألومنيوم. ويعد الاستخدام الرئيسي للكيانايت في صناعة الحراريات، وصناعات الزجاج، وهو \n" +
                        "أحد مكونات البورسلان (الخزف الصيني). وتوجد جميع مواقع الكيانايت الرئيسية في الدرع العربي ويمثل وادي مربط في الجنوب ووادي العرج وجبل شدا في الغرب من أهم مواقع الكيانايت الرئيسية في المملكة. كما يتواجد في جبل كرش الغربي وجبال الرقابة الغربية، وجبل مهدب في الشرق.\n",
                R.drawable.kyanite
            )
        }
        else if(metal == "Limestone"){
            metalInfoPopUp(
                "الحجر الجيري Limestone",
                "خام الحجر الجيري عبارة عن صخر رسوبي يحتوي على نسبة لا تقل عن 90% من كربونات الكالسيوم. وتتدرج ألوان الحجر الجيري بين الأبيض والأصفر والبني والوردي والأحمر وأحيانا اللون الأسود، ويعتبر الحجر الجيري مادة رئيسية أو ثانوية في تكوين كثير من الصناعات منها: صناعة الاسمنت: حيث يمثل الحجر الجيري المادة الأساسية لهذه الصناعة وفي إنتاج (رمادا الصودا) المستخدم ف صناعة الزجاج وصناعة التنظيف والتطهير. وكمادة مساعدة في صهر الحديد والفولاذ. وأيضا في صناعة الجير الحي الذي يستخدم في الصناعات الكيميائية والجير المطفأ الذي يدخل في صناعة مواد البناء وتثبيت المباني أو إكساء جدران المنازل. يعد الحجر الجيري من أهم المعادن المستخدمة كحشوات معدنية في كثير من القطاعات لسهولة طحنه وقلة امتصاصه للزيوت ولعدم تسببه في تآكل الأجهزة. كما يستخدم في صناعة لفات القار لعزل الخزانات من التسرب. يدخل الحجر الجيري في الصناعات البلاستيكية اللازمة لصناعة القوالب والسيارات وفي صناعة أدوات السباكة والكهرباء وقطع الأثاث. \n" +
                        "وفي صناعة أححار الزينة لتغطية الأرضيات والواجهات الداخلية والخارجية للمباني وفي صناعة صفيات الصرف الصحي وفي رصف الطرق. يوجد أكثر من ٤٠٠ موقع لخام الحجر الجيري في المملكة منها: جبال طويق: التي تمتد من السليل إلى الزلفي، أم الفربان شرق مدينة الخرج وسدوس: غرب مدينة الرياض وفي وادي تربه جنوب شرق طريف وفي جنوب رابغ والشعيبة ورأس بريدي ورأس مهاريش وفي الخرسانية بالمنطقة الشرقية ويتواجد أيضا في عدة مواقع أخرى بمنطقة \n" +
                        "الرياض منها: شمال الدرعية، ووادي حنيفة، والحائر، وشمال الجفير، وشمال الخرج. \n",
                R.drawable.limestone
            )
        }
        else if(metal == "Magnesite"){
            metalInfoPopUp(
                "المغنيزايت Magnezite",
                "المغنيزايت معدن أبيض إلى رمادي اللون وتتدرج ألوانه من الأبيض إلى الأسود، ويتواجد في الطبيعة على هيئة كتل أرضية أو عروق غير منتظمة، ويعتبر المغنيزايت الخام الرئيسي لعنصر المغنيسيوم ثامن العناصر من حيث الانتشار في القشرة الأرضية. ومن أهم منتجات المغنيزايت : المغنيسيا المقاومة للصهر وتشكل 85% من حيث الإنتاج وتستخدم في مصانع الفولاذ لتبطين الأفران وتغطية المحولات الكهربائية وفي مسابك النحاس وفي تبطين أفران الأسمنت. المغنيسيا الكاوية وتشكل حوالي 10% من حيث الإنتاج وتستخدم بدرجة كبيرة في مجال صناعة المواد الكيميائية والورق وصناعة الحرير المستخرج من السليولوز وفي مجالات الزراعة، وتعتبر المغنيسيا الذائبة أثمن أنواع المغنيسيا الكاوية لاستخدامها في الدوائر الكهربائية والعوازل. يتواجد المغنيزايت في منطقة ضرغط جنوب غرب مدينة حائل وفي منطقة جبل الرخام جنوب شرق المدينة المنورة.  كما يتواجد المغنيزايت بنسب متفاوتة شرق الدفينة، جبل بطران، جبل آبت، أملج، جبل الحميرية، جبل المليحنات وجنوب جبل وسمه. ",
                R.drawable.magnezite
            )
        }
        else if(metal == "Marble"){
            metalInfoPopUp(
                "الرخام Marble",
                "خام الرخام عبارة عن صخر كربوني متحول ذو حبيبات دقيقه متبلورة ويدل اللون الأبيض للرخام على نقاوته ، في حين اللون الرمادي أو البني المصفر أو الأسود على احتوائه على شوائب ويستخدم الرخام بشكل واسع بكافة ألوانه وأشكاله في أعمال المباني لتكسيه الواجهات الداخلية والخارجية، والأرضيات والسلالم بينما تستخدم الأنواع البيضاء منه بعد طحنها لإنتاج كربونات الكالسيوم التي تدخل في عدة صناعات من أهمها: السجاد والموكيت، الدهانات، الورق، الغراء والمواد اللاصقة والأدوية. \n" +
                        "ويتواجد الرخام في عدة مناطق بالمملكة - جبل فرسان بمحافظة رابغ ، مدركة في جبل قرين شمال شرق جدة، وفي وادي فاطمة شمال مكة المكرمة وفي وادي تربة جنوب شرق الطائف وفي جبل خانوقة شمال مدينة البجادية وجبل غزلان ويقع في الجنوب من عفيف وجبل غدادة شمال شرق عفيف. \n",
                R.drawable.marble
            )
        }
        else if(metal == "Nickel"){
            metalInfoPopUp(
                "النيكل  Nickel",
                "النيكل معدن صلب لامع يتميز بلون أبيض فضي، وموصل للكهرباء والحرارة نسبيا وله القدرة في الاندماج مع غيره من المعادن وتتشابه الصفات الكيميائية للنيكل مع صفات معدن الحديد، لديه قابلية للمغنطة وللطرق والسحب ويمنع الصدأ والتآكل عن المعادن الأخرى. ويتميز النيكل بصلابته وقوة مقاومته للتآكل والأكسدة ولذلك يستعمل في عدد كبير من الصناعات مثل المعدات الزراعية وآلات القطع وقطع غيار السفن والمركبات وطواحين الفولاذ وفي معدات حفر الآبار ومعدات أدوات البناء، كذلك يتميز بسهولة إعادة تدوير نفاياته واستعماله مرات عديدة في الكثير من الصناعات دون أن يفقد خواصه. يستخدم بشكل رئيسي في صناعة السبائك المعدنية مثل صناعة الأجزاء القوية من الأدوات الصلبة المستعملة في التطبيقات الالكترونية والكهربائية، أو في صناعة الصمامات الصلبة وقوالب صناعة الزجاج والبلاستيك ومضخات البنزين في الطائرات. يستعمل كذلك في تجهيزات الأفران والمصانع. يتواجد في عدد من المواقع مثل وادي قطن جنوب الدرع العربي. وجبل جدير جنوب شرق محافظة رنية، ووادي كمال على بعد ٤٠ كم إلى الشمال من مدينة ينبع البحر. ",
                R.drawable.nickel
            )
        }
        else if(metal == "Phosphate"){
            metalInfoPopUp(
                "الفوسفات Phosphate",
                "الفوسفات مركب معدني لا يتواجد في الطبيعة في شكله الذاتي حيث أنه سريع التفاعل مع الأوكسجين، وتتباين ألوانه ما بين الداكن إلى الفاتح ويظهر على شكل رواسب فتاتية أو متصلبة. وتطلق كلمة فوسفورايت على رواسب الفوسفات التي يمكن تعدينها واستغلالها اقتصاديا، بينما يطلق مصطلح الصخور الفوسفاتية على الصخور التي تحتوي على نسب غير عالية من الفوسفات. ويستعمل الفوسفات في عدد من الصناعات أهمها: صناعة الأسمدة: وهي تمثل حوالي 77% من استخدامات الفوسفات، حيث أنه يمثل غذاء أساسيا لنمو النباتات. كذلك في صناعة الفوسفور الحراري وحامض الفوسفور: وتمثل هذه الصناعة 8% من استخدامات الفوسفات ويتم استخدامها في معالجة أسطح المعادن مثل الألومنيوم والنحاس والحديد وفي المنظفات الكيميائية والمبيدات الحشرية. يستخدم أيضا غذاء للمواشي: وتمثل هذه الصناعة نسبة 6% من استخدامات الفوسفات وفي صناعة بولي فوسفات: وتمثل 5% من استخدامات الفوسفات ويستخدم في منظفات الغسيل الصناعية والمنزلية. تم اكتشاف الفوسفات شمال غرب المملكة شرق مدينة طريف، وأهم المناطق: حزم الجلاميد شمال غرب مدينة عرعر وأم الوعال شرق مدينة طريف والعامود جنوب مدينة طريف والثنيات جنوب غرب طريف. ",
                R.drawable.phosphate
            )
        }
        else if(metal == "Sandstone"){
            metalInfoPopUp(
                "الحجر الرملي Sandstone",
                " صخر رسوبي عبارة عن رمال متصلدة، تم استعماله في البناء، والوانه تتدرج من الأصفر إلى البني إلى الأحمر. تتكون معظم حبيبات الحجر الرملي من الكوارتز ، ذات نسيج فتاتي مع مادة لاحمة بين الحبيبات، ويستخدم الحجر الرملي في سن المنشار والسكين وشحذ الشفرات وغيرها من نواتج الفولاذ وفي مواد البناء، ويستخدم في أحجار الزينة. يوجد في المملكة الكثير من المواقع التي يتواجد فيها الحجر الرملي منتشرة في جميع أنحاء المملكة. ",
                R.drawable.sandstone
            )
        }
        else if(metal == "Bauxite"){
            metalInfoPopUp(
                "البوكسيت Bauxite",
                "البوكسايت خام معدني يميل لونه إلى الاحمرار، وهو أهم مصدر لعنصر الألومنيوم الذي يتم استخلاصه من الخام. له استخدامات عديدة مثل صناعة مواد الصنافر والحراريات والإسمنت وصناعة المادة المزيلة للألوان وصناعة الفلاتر لأغراض التنقية. يستخدم في الصناعات الكيميائية وصناعة السيراميك وخام البوكسيت الأحمر ذو الدرجة العالية يستخدم في إنتاج الألومنيوم بينما تستخدم الأنواع الأخرى الأقل درجة في صناعة الحراريات والصنافر والفلاتر والأسمنت العالي المحتوى من الألومنيوم. ومن الإستخدامات الثانوية لخام البوكسيت في مصافي تكرير النفط. يتواجد خام البوكسيت في منطقة الزبيرة شمال شرق المملكة ويتبع منطقتي حائل والقصيم. ",
                R.drawable.bauxite
            )
        }
        else if(metal == "Chromium"){
            metalInfoPopUp(
                "الكروم Chrome",
                "الكروم عنصر يتفاوت لونه بين الأسود إلى الأسود المائل إلى البني مع لمعان معدني ويتميز بدرجة ذوبان عالية، لا رائحة له ولا طعم وقابل للتشكيل بالطرق. يستعمل في حفر النحاس، وفي صناعة البطاريات، وتصفيح الحديد الصلب وكذلك في صناعة الأصباغ وفي بطانة الأفران التي تعكس الحرارة الشديدة نظرا لمقاومته للصهر. يستعمل أيضا في صناعة الحديد الصلب الغير قابل للصدأ، وفي إنتاج الفولاذ المقاوم للحرارة، وكذلك يستعمل في المواد الملونة. يتم خلط الكروم مع الفولاذ ليكون فولاذا مقاوما للتأكل، ومن أمثلة ذلك استخدامه في إنتاج الفولاذ الذي لا يصدأ. كذلك يستخدم الكروم بشكل أقل في صناعة بعض الكيماويات في عملية دباغة الجلود، وتستخدم مركبات الكروم في صناعات النسيج لإنتاج اللون الأصفر ولإضافة مقاومة التآكل والمظهر اللامع للمعادن، كما يستعمل لأغراض الزينة. تم اكتشاف عدد من الرواسب لخام الكروم في مكامن العيص ووادي الحمضة ومنطقة الشزم وظلم وحلبان. ومن أهم هذه المواقع: جبل الوسق: يقع شمال شرق ينبع. بئر طلوحة: في منطقة حائل، وهو عبارة عن سلسلة من العدسات بعرض ١-٣ متر وطول عدة أمتار وهناك حالات تواجد صغيرة أخرى في جبل جحفة وجل الحمدانية وجبل سخيرة وظلم. ",
                R.drawable.chrome
            )
        }
        else if(metal == "SilicaSand"){
            metalInfoPopUp(
                "رمل السيليكا Silica Sand",
                "رمل السيليكا أو الرمل الزجاجي المادة الأساسية لصناعة الزجاج. يستعمل رمل السيليكا عالي الجودة في عدد من الصناعات أهمها تصنيع الزجاج وبعض صناعات المواد الإنشائية. وأهم الصناعات التي تستخدم رمل السيليكا كمادة أساسية لمنتجاتها صناعة الزجاج و سبك المعادن، ويمزج بالصلصال أو الزيت لتصنيع قوالب سبك المعادن. تتطلب عمليات تصفية مياه الشرب أو معالجة مياه الصرف الصحي إلى رمل السيليكا الخشنة. يستعمل رمل السيليكا في الكواشط كورق الزجاج وفي عمليات تنظيف السطوح، في صناعة السيراميك. كما أن له خصائص حرارية مناسبة لإنتاج طوب السيليكا الحراري بمتانة كافية وكذلك مواد البناء الخالية من الشوائب. وكذلك يستخدم في صناعة الصابون \n" +
                        "والمنظفات. تعتبر رمل السيليكا المادة الأولى التي استخدمت في صناعة الخلايا الشمسية، وهي تشكل محتوى هام في صناعة الالكترونيات. وتستخدم في إنتاج الخرسانة الخفيفة ذات الألواح المسلحة وغير المسلحة للجدران والأسقف. وهناك منتجات عديدة قائمة على رمل السيليكا أهمها ما يلي: - ألواح الزجاج المسطح والمرايا الزجاجية وفي واجهات الأبنية والألياف الزجاجية والصوف الزجاجي العازل. ويوجد في المملكة ما يزيد عن ٢٥٦ موقعا يحتوي على رمل السيليكا من أهمها: جبال الدغم شمال شرق الرياض، وفي جبل الفوهة، وتيماء بمنطقة تبوك، وجبل صدوي في المنطقة الشرقية وكذلك يتواجد رمل السيليكا بمنطقة الجوف. \n",
                R.drawable.silicasand
            )
        }
        else if(metal == "Silver"){
            metalInfoPopUp(
                "الفضة Silver",
                "تعد الفضة من المعادن الثمينة التي تنفرد وتتميز بلون أبيض لها بريق صاف وجميل وهي مرنة ولينة قابلة للتمدد بالطرق. ولها أهمية في صناعة المجوهرات والحلي وتتميز برونق وجمال وجاذبية يجعلها احدى أهم المواد المستعملة في الأواني وأدوات الزينة والزخرفة وصناعة العملات النقدية. تعتبر أفضل موصل للكهرباء والحرارة لذلك تستخدم في صناعة أجهزة التلامس الكهربائية مثل أجهزة الميكروويف وغسالات الأواني المنزلية والتلفزيونات والتلفونات وأجهزة الحاسوب. تتواجد الفضة غالبا مصاحبة مع خام الذهب مثل منجم مهد الذهب ، ومنجمي سمره وسميره ، وكذلك تتواجد بعدد من المواقع تشمل وادي الغول ومكمن أم حديد ومكمن حجلان والسيدرية ومكمن مرجان. ",
                R.drawable.silver
            )
        }
        else if(metal == "Zinc"){
            metalInfoPopUp(
                "الزنك Zinc",
                "الزنك معدن فلزي يميل لونه إلى الأبيض أو الرمادي الفاتح أو الأزرق الفاتح، ويسمى بالخارصين في اللغة العربية، وقد استعمل منذ القدم في صناعة العملات. وينتشر استخدام الزنك في الصناعة وذلك لانخفاض تكاليفه، ويستعمل بشكل واسع في السبائك والتغليف والاستخدامات الكيميائية، وصناعة السيارات والدهانات. وتعتبر عملية الجلفنة وهي طلاء المنتجات المعدنية وخاصة الحديد والفولاذ بواسطة طبقة من الزنك أحد أهم التطبيقات المنتشرة عالميا والتي تستعمل على نطاق واسع في حماية المعادن ومشغولاتها من الصدأ والتأكسد أو التفاعلات الكيميائية. ونظرا لانخفاض درجة انصهاره ومتانة نسيجه فإنه يعتمد عليه في صناعة السبائك ذات الأحجام والأبعاد الدقيقة وبعض الاستعمالات الصناعية الهامة. وتستخدم سبائك الزنك في صناعة أجزاء عديدة من السيارات مثل خلاطات الوقود ومقابض الأبواب، كما تستخدم ألواح الزنك في صناعة أغلفة البطاريات وألواح الحفر اللازمة للطباعة وأغراض الحماية للهياكل المصنوعة من الفولاذ. يدخل الزنك في صناعة مواد التجميل وصناعة الورق والمعدات الكهربائية، وفي صناعة الأسمدة وغذاء الحيوانات وبعض المستحضرات الطبية. ومن أهم المواقع لخام الزنك الخنيقية بمحافظة القويعية وكذلك في مكمن كتام شرق ظهران الجنوب ومنجم المصانع بمنطقة نجران. كذلك يتواجد الزنك في مناجم الأمار ومهد الذهب كمنتج ثانوي، وهناك أكثر من ٤٠٠ مكمن للزنك في صخور الدرع العربي من أهمها منطقة الشعيب الواقعة بمنطقة عسير.",
                R.drawable.zinc
            )
        }
        else if(metal == "NephelineSyenite"){
            metalInfoPopUp(
                "النيفلين سيانايت Nepheline Syenite",
                "يعتبر خام النيفيلين سيانايت صخرا خشنا إلى متوسط الحبيبات ويتكون أساسا من الفلسبار القلوي ومعدن النيفيلين، وينشأ النيفيلين سيانايت خاليا من الكوارتز ومحتويا على ألومنيوم وصوديوم بنسب أكبر من تلك التي في الجرانيت. ونظرا لمحتوى النيفلين سيانايت المرتفع من الألومينا والقلويات، وكذلك محتواه المنخفض من المعادن المحتوية على الحديد والمغنيزيوم فإنه يعتبر مصدرا منافسا للفلسبار في صناعة الزجاج، وخاصة في صناعة الأواني والألواح الزجاجية، كما توجد له استعمالات في صناعة الخزف ويستخدم كذلك كمادة حشو في الدهانات والمطاط واللدائن. يتواجد خام النيفلين سيانايت في جبل سوده بمنطقة تبوك حيث يمثل الجبل جسما جوفيا يبلغ قطره حوالي ٢ كيلومتر.",
                R.drawable.nephelinesyenite
            )
        }
        else if(metal == "Diatomite"){
            metalInfoPopUp(
                "الدياتوميت Diatomite",
                "الدياتوميت صخر سيليسي يتكون بتراكم الدياتوم وهي نباتات وحيدة الخلية تعيش في مياه البحار والمياه الحلوة وهو خفيف الوزن وملمسه طباشيري ولونه أبيض إلى أصفر إلى رمادي، وهو من مواد الصقل والتلميع التي تأتي ضمن المواد السيليسية والتي تشمل صور السيليكا المتعددة، وشكلها عبارة عن بودرة تستخدم في تلميع الفلزات ومساحيق الأسنان، وكذلك يستخدم في ترشيح السوائل والمحاليل وخاصة عصائر الفواكه. يتواجد في منطقة النفوذ الكبرى الواقعة شمال حائل وجنوب تبوك والجوف ومن أهم المواقع بئر حيزان في منطقة تبوك.",
                R.drawable.diatomite
            )
        }
        else if(metal == "Perlite"){
            metalInfoPopUp(
                "البرلايت Perlite",
                "خام البرلايت عبارة عن صخر زجاجي بركاني بتركيب ديورايتي يحتوي على أكثر من 72% من أكسيد السيليكون، ويتميز البرلايت بالبريق اللؤلؤي والمكسر المحاري والتشقق الدائري. وتوجد أجسام البرلايت على هيئة قواطع أو قباب لابة، كما توجد على هيئة حواشي محيطة بالبركانيات. ويستخدم البرلايت في أغراض العزل الحراري والصوتي كمادة جبسية، وفي الخرسانة خفيفة الوزن. ويقع خام البرلايت في حرة شاما شمال الليث.",
                R.drawable.perlite
            )
        }
        else if(metal == "Bentonite"){
            metalInfoPopUp(
                "البنتونيت Bentonite",
                "البنتونيت صلصال يتكون بصفة رئيسة من معادن الطين وبعض الشوائب من معادن الصخور النارية، وهناك نوعان من البنتونيت هما: - البنتونيت الصودي: وهو النوع الذي ينتفخ ويزداد حجمه من 15-20 مرة عند إضافة الماء والبنتونيت الكلسي وهذا لا ينتفخ ولا يزداد حجمه عند إضافة الماء. \n" +
                        "ويستخدم النوع الأول بصفة رئيسة في تجهيز طين الحفر المستخدم في حفر أبار البترول، كما تستعمل كميات أقل في مواد التجميل والصناعات الدوائية وفي مواد منع التسرب وكمادة مساعدة على الهضم في أعلاف الحيوانات والزراعة. تتواجد رواسب البنتونيت في أماكن عدة من أهمها: راسب خليص وراسب عسفان ويتميز راسب بنتونيت خليص باحتوائه على معدن السمكتيت، وقد أجريت اختبارات هذه الرواسب لاستعمالات هندسية اثبتت جدواها إلى حد كبير، ولكنه يحتاج إلى معالجة لاستخدامه لأغراض الحفر وكذلك يتواجد في راسب حليفة ومشاش الوبيلية في صخور الغطاء الرسوبي إلى الشمال الشرقي من الدرع العربي. \n",
                R.drawable.bentonite
            )
        }
        else if(metal == "Barite"){
            metalInfoPopUp(
                "البـارايـت Barite",
                "يظهر البارايت بلون أبيض إلى عديم اللون عندما يكون نقيا، ولكنه بشكل عام يتأثر بصبغة الشوائب المصاحبة له فيتراوح لونه من رمادي إلى أسود متدرج إلى الأصفر والأخضر والأزرق، ويشكل البارايت المادة الرئيسية أو المادة اللاحمة للأجسام المتطابقة الموجودة في التتابعات الرسوبية الطبقية. خصائص البارايت تجعله عامل مثالي في تبريد وتشحيم معدات الحفر القاطعة للصخور، وتقوية جدران مثاقب الحفر ويستخدم 90%  من البارايت المنتج حاليا في عمليات الحفر العميقة. ونظرا لمقاومة البارايت للضغط العالي للبترول والغاز، فإن ذلك يساعده على منع حوادث الانفجارات، وكذلك يستخدم في تصنيع أنواع محددة من الزجاج وكمادة حشو في إنتاج اللدائن (بي. في. سي.) والورق، والخزف، والدهان، وكمادة صابغة في الصناعة الكيميائية. ويظهر أكبر راسبين معروفين للبارايت في المملكة (رابغ والعقيق) وتوجد المواقع الأخرى في وادي شعيلة والنقرة الشمالية، وجبالة والتي تقع جميعها شمال شرق المدينة المنورة كما يتواجد البارايت في عدة مواقع على طول السهل الساحلي للبحر الأحمر خاصة في وادي أظلم، ديلان، وينبع.",
                R.drawable.barite
            )
        }
        else if(metal == "Quartzite"){
            metalInfoPopUp(
                "الكوارتزيت Quartzite",
                "الكوارتزيت صخر متحول عالي المحتوى من أكاسيد السيليكا، وينشأ عن صخور الحجر الرملي ويتميز عنه بوجود التشققات، ويتواجد عادة مصاحبا لرواسب الحجر الرملي. ويستخدم الكوارتزيت عوضا عن رمال السيليكا في إنتاج سبائك الحديد والسيليكون وفي إنتاج السيليكون عالي النقاوة الذي يستخدم في صناعة الكترونيات وأجهزة الحاسب الألى. ويتواجد خام الكوارتزيت المصاحب لرمل السيليكا بمحافظة الغاط وبجبال الدغم بمنطقة الرياض. ",
                R.drawable.quartzite
            )
        }
        else if(metal == "Clay"){
            metalInfoPopUp(
                "الطين Clay",
                "الطين (الصلصال) هو أقدم المواد التي أستخدمها الإنسان ومنه صنعت الأواني وقوالب الطوب والمباني ويستخدم الاسم للدلالة على مجموعة من عدة مواد طينية والتي تتحول إلى عجينة لدنة عند إضافة الماء إليها ثم إلى مواد حجرية عند حرقها. وأهم الصفات الطبيعية في الطين هي: درجة اللدونة وهي التي تتحكم في إمكانية تشكيل الصلصال قبل حرقه، ودرجة التماسك ودرجة الانكماش وهما اللتان تتحكمان في إمكانية حرق الصلصال بعد تشكيله، أما صفة القابلية للصهر فهي التي تحدد درجة الحرارة التي عندها يمكن استخدامه كمواد مبطنة لأفران الصهر. يستخدم في صناعة الأواني الفخارية وصناعة الخزف والأرضيات والحمامات والسيراميك والأرضيات وفي صناعة العوازل الكهربائية والمواد المبطنة لأفران صهر الفلزات ، ومنه يتم تصنيع مواسير المياه والمجاري. وتضاف بعض أنواعه في صناعة الأسمنت والورق ، وكذلك يستخدم في تجهيز طينة حفر الأبار. ويتواجد خام الطين في المملكة في مناطق عديدة منها:  خشم راضى وجبل شهبا في الخرج ودرب سعد شمال الرياض وفي الزبيرة، وكذلك في ضرما ومرات وهو يلائم صناعة الفخار والخزفيات. كما يوجد طين البنتونيت في مدركة وخام الطين في خليص وعسفان وبحره والجموم في منطقة مكة المكرمة. ويوجد الطين المناسب لصناعة الطوب الأحمر ومواد البناء في مناطق عديدة منها شمال بريدة وشرق مدينة تبوك وأحد المسارحة في جازان.",
                R.drawable.clay
            )
        }
        else if(metal == "Pozzolan"){
            metalInfoPopUp(
                "الـبـوزولان Pozolane",
                "البوزولان مادة بركانية فقاعية خفيفة وتتميز باللون الداكن إلى الأسود. يستخدم لإنتاج الاسمنت البورتلاندي نظرا لأنه يزيد من المقاومة الكيميائية للأسمنت ، ويلعب دورا في جعل عجينة الاسمنت أكثر لدانة أثناء فترة التصلب، ويقلل من نفاذية الاسمنت ويقلل من كمية الاسمنت المستخدمة في الخرسانة والبلوك . يحسن البوزولان من خواص اللدونة والتماسك ويقاوم الماء الكبريتي والمياه ذات الملوحة. ويدخل في صناعة البلوك ومواد البناء، وفي الخرسانة الخفيفة مسبقة الصنع في المباني السكنية والعامة حيث يقلل الأحمال على أساسات المباني بنسبة لا تقل عن 30% ، وكذلك الحال عند استعمال البلوك البوزولاني بديلا عن البلوك الإسمنتي في تلك المباني. وفى المملكة يوجد العديد من المخاريط البركانية في الحرات البازلتية تحتوي على مواد بوزولانية، ومنها حرة الهتيمية، وحرة لونير، وحرة كشب وحرة البقوم، وحرة نواصيف، وحرة الحره.",
                R.drawable.pozzolan
            )
        }
        else if(metal == "Salt"){
            metalInfoPopUp(
                "الملح الصخري Halite",
                "الملح معدن طبيعي يحتوي على عنصرين هما الكلور والصوديوم ويعرف كيميائيا باسم كلوريد الصوديوم، أبيض اللون وشفاف إلى شبه شفاف وقد يتوفر بألوان أخرى منها الأحمر والأصفر والبرتقالي والوردي والأخضر والأزرق والبنفسجي والرمادي، وهو جيد الذوبان في الماء، كما يتميز بخاصيته في إذابة الثلوج والجليد. ويوجد الملح في الطبيعة على عدة هيئات: محاليل ملحية طبيعية مثل مياه البحار والمحيطات والينابيع، ملح صلب كرواسب طبقية، قباب ملحية، سبخات ساحلية. \n" +
                        "له استخدامات كثيرة من أهمها: إنتاج الكيماويات كما يستخدم كمادة إضفاء نكهة وحافظ للأغذية الإنسانية والحيوانية. وكعامل تخفيض درجة تجمد الماء لإذابة الثلوج والجليد. ويستخدم في عمليات الأمطار الاصطناعية في المناطق الصحراوية. وتتواجد الرواسب الملحية في المملكة في عدة مناطق من أهمها: الرواسب الملحية على ساحل البحر الأحمر، وفي جازان يظهر الملح على شكل قبة ملحية على سطح الأرض وفي جزر فرسان يوجد الملح على هيئة ترسبات ملحية ، وفي رأس كركومة يقع إلى الجنوب من مدينة ضبا وفي الكراع شمال محافظة جدة ، سبخة الرياس جنوب مدينة الجبيل و سبخة جيب عويد جنوب مدينة الظهران و سبخة رأس القرية جنوب مدينة الدمام و سبخة أبا الحمام. \n" +
                        "ومن أهم ترسبات السبخات الملحية الداخلية : القصب؛ تقع مملحة القصب شمال غرب محافظة ضرما ، وادي السرحان والعوسجية في منطقة القصيم). كما توجد عدة ترسبات ملحية سباخية على ساحل البحر الأحمر مثل: - سبخة خليج سلمان وسبخة السودة بالشعيبة شمال محافظة الليث. \n",
                R.drawable.salt
            )
        }
        else if(metal == "Kaolin"){
            metalInfoPopUp(
                "الكاولين Kaolin",
                "الكاولين صخر طيني دقيق الحبيبات غالبا ما يكون أبيض اللون ويتدرج إلى اللون الرمادي ثم الأصقر ويوجد في الطبيعة على عدة أشكال على هيئة عدسات مسطحة أو طبقات متتابعة. ومن خواص الكاولين القدرة على امتصاص الماء كما أنه يتمدد بوجود الماء وهو مادة خاملة، كما أن ناقليته للحرارة والكهرباء ضعيفة ويتميز باعتدال ثمنه. واستخدامات الكاولين الصناعية هي: صناعة الورق حيث تستهلك صناعة الورق حوالي 50% من إنتاج الكاولين في العالم نظرا لأنه يضفي على الورق النعومة والملمس الزجاجي والبريق والصلاحية للطباعة، هذا بالإضافة إلى قلة تكلفته. صناعة البلاستك وصناعة السيراميك حيث ينظر إلى صناعة السيراميك أنها الأولى تاريخيا في استخدام الكاولين. صناعة المطاط لتحسين قوة الشد، ومقاومة التآكل وزيادة الصلابة. صناعة مواد الطلاء والدهانات. يتواجد الكاولين المتعدد الألوان في عدة مناطق بالمملكة ومن أهمها: - الزبيرة ، خشم راضي شرق الخرج ، جبل شهبه و درب سعد شمال شرق الرياض. ",
                R.drawable.kaolin
            )
        }
        else if(metal == "AggregateMaterials"){
            metalInfoPopUp(
                "مواد البحص Materials Aggregate",
                "هي عبارة عن أحجار ورمال وصخور طبيعية ويتم الحصول عليها عن طريق تكسير صخور طبيعية باستخدام الكسارات والطواحين لعمل الأحجام المطلوبة. وتستخدم بصورة أساسية لإعطاء الكتلة \n" +
                        "والقوة للمنشآت عند تحضير الخرسانة وفي إنشاء الأعمدة والقواعد وأسقف المباني وفي رصف الطرق. \n" +
                        "وأكثر الصخور استخداما كمواد للكسارات هي بعض أنواع الحجر الجيري والدولوميت والانديسيت والجابرو والبازلت، والحجر الرملي. وفي المملكة تتوزع محاجر إنتاج مواد الكسارات في كافة أنحاء المملكة ويوجد عدد منها بالقرب من كل مدينة.\n",
                R.drawable.aggregatematerials
            )
        }
        else if(metal == "Talc"){
            metalInfoPopUp(
                "التلك Talc",
                "التلك من المعادن المُهمة المُنتشرة بشكل كبير، ويتكوّن بشكل رئيس من سيليكات المغنيسيوم التي أُضيف إليها الهيدروجين ممّا جعلها مُهدرجة، ويتمّ استخدام هذا المعدن حتى في صورتهِ كمسحوق واسع الاستعمال والانتشار، يمتاز معدن التلك بليونته العالية وبياضهِ الناصع ، ويستخدم التلك في العديد من الصناعات مثل صناعة الورق والبلاستيك والدهان والطلاء والمطاط والمواد الغذائية والكابلات الكهربائية والمواد الصيدلانية ومواد التجميل، والخزف. بسبب مقاومته العالية للحرارة و سهولة التحكم به و تشكيله فقد استعمل منذ زمن طويل في صناعة الخزف و حاليا يدخل في صناعات الصابون و الملينات و الطباشير و الأصباغ و كذلك في صناعة بودرة الأطفال .",
                R.drawable.talc
            )
        }
        else if(metal == "Uranium"){
            metalInfoPopUp(
                "اليورانيوم Uranium",
                "اليورانيوم عنصر كيميائي مشّع وسام، لونه أبيض مائل للفضي، وهو فلزّ ثقيل ينتمي لسلسلة الأكتينيدات \n" +
                        "كما أنّه يُعدّ من ضمن العناصر الـ (48) الأكثر وفرة في العالم، وهو أكثر وفرة من الفضة بأربعين مرة، \n" +
                        "ولا يوجد حراً في الطّبيعة إنّما ضمن فلزات مثل الأورانيت و البتشبلند واليورانينيت، والكارنوتيت، والأوتونيت ، والتوربِرنيت . اليورانيوم المخصّب هو نوع من اليورانيوم الذي تكون نسبة اليورانيوم-235 \n" +
                        "فيه بين 3%-5% بدلاً من النّسبة المعتادة التي تبلغ 0.7%، وتتم زيادة نسبة اليورانيوم-235 عن طريق\n" +
                        " فصل النّظائر، أو باستخدام جهاز الفصل المركزيّ. يستخدم في انتاج الطّاقة النووية لأغراض عسكريّة، \n" +
                        "وفي صناعة الدّبابات والصّواريخ، وكذلك في إنتاج الطاقة النوويّة لأغراض تجاريّة وفي تقدير عمر المواد إشعاعياً وفي تصنيع الأسمدة الفوسفاتيّة وتلوين الزّجاج بحيث يشع بلون أصفر مائل للأخضر عند \n" +
                        "تعريضه للضّوء الأسود. يبلغ مخزون اليورانيوم في المملكة تقريبا 60 ألف طن ويعادل 6 % من الاحتياطي العالمي ويتواجد في تسعة مواقع تتركز معظمها في منطقة حائل وغرب تبوك وفي جبل سعيد والمدينة المنورة.\n",
                R.drawable.uranium
            )
        }
        else if(metal == "Aluminium"){
            metalInfoPopUp(
                "الألمنيوم Aluminum",
                "الألومنيوم أكثر العناصر الفلزية الموجودة في القشرة الأرضية وثالث العناصر وفرة بصفة عامة بعد \n" +
                        "الأكسجين والسليكون. ويكوِّن الألومنيوم حوالي 8% من القشرة الأرضية. فلز خفيف الوزن، لونه فضِّي ويمكن تشكيله بسهولة في أي شكل. ويمكن أن يدلفن أو يُطرق إلى ألواح سميكة لاستخدامه في الدَّبابات المصفحة، أو إلى رقائق رهيفة تستخدم في لف بعض أنواع الحلوى. ويمكن سحبه على شكل أسلاك أو تصنيعه في شكل علب. والألومنيوم لا يصدأ، ويقاوم التآكل بفعل  الظروف الجويَّة أو المواد الكيميائية. تستخدم صناعة الإنشاءات المعمارية سبائك الألومنيوم، لصناعة مواسير المجاري المنزلية، والقطاعات المختلفة في المساكن والأسقف والجدران للمباني، وكذلك مواسير الأسلاك الكهربائية والإطارات الخارجية للنوافذ. وتُستخدم كميات كبيرة من الألومنيوم في تصنيع وسائل النقل، مثل الطائرات والسَّيارات والسُّفن وعربات السكك الحديدية. كما يستخدم الألومنيوم في العديد من المنتجات الكهربائية، وأسلاك الهاتف. \n" +
                        "بدأت \"معادن\" إنتاج الألمنيوم العام 2012م من خامات البوكسايت من منجم البعيثة في منطقة القصيم، وتولت نقله إلى مدينة رأس الخير للصناعات التعدينية على ساحل المملكة الشرقي على الخليج العربي؛ \n",
                R.drawable.aluminium
            )
        }
        else if(metal == "Lead"){
            metalInfoPopUp(
                "الرصاص Lead",
                "الرصاص عنصر فلزي طري قابل للتطريق والسحب، أبيض مائل إلى الزرقة ويمتاز بلمعة ساطعة جدًا، كما أنه شديد المقاومة للتآكل، ويتم سبكه في بعض الأحيان مع الأنتيمون لتقسيته .وهو من أقدم الفلزات المعروفة في العالم. ونادرًا جدًا ما يتواجد الرصاص في الطبيعة. والشكل الأكثر شيوعًا الذي يوجد فيه الرصاص هو الجالينا أو كبريتيد الرصاص الطبيعي، ويتم استخراجه بواسطة عملية تحميص. كما يتواجد\n" +
                        " أيضًا في أنجليسيت خام كبريتات الرصاص، وسيروسيت كربونات الرصاص، ومنيوم أكسيد الرصاص الأحمر.وتشمل المصادر المهمة لتلوث البيئة بالرصاص أنشطة التعدين والصهر والتصنيع وإعادة التدوير \n" +
                        "واستخدام الرصاص في طائفة واسعة من المنتجات. ويُستهلك الرصاص في العالم أساساً لأغراض صناعة بطاريات الرصاص الحمضية للسيارات لكنه يُستخدم أيضاً في عدة منتجات أخرى من قبيل الأصباغ والدهانات واللحام والزجاج الملون والأواني البلورية والذخيرة والخزف المُزجّج والمجوهرات ولعب الأطفال. ويستخرج معظم الرصاص المستخدم لأغراض تجارية في العالم في الوقت الحالي من عمليات إعادة التدوير.\n",
                R.drawable.lead
            )
        }

        else if(metal == "Asbestos"){
            metalInfoPopUp(
                "الأسبستوس  Asbestos",
                "الأسبستوس (الحرير الصخري) عبارة عن مواد غير عضوية تحتوي على العديد من المعادن الطبيعية التي يدخل في تركيبها أملاح السيليكات إلا أنها تختلف عن بعضها في التركيب الكيميائي والخواص الطبيعية لاختلاف كميات الماغنسيوم والحديد والصوديوم والأوكسجين والهيدروجين فيها.. وهناك ثلاثة أنواع رئيسية من الأسبستوس. كل نوع ينتمي إلى عائلة الأسبستوس السربنتين أو الأمفيبول : الأسبستوس الأبيض كريسوتايل يتم الحصول عليه من صخور السِّرْبِنتين. والكريسوتايل من أكثر الأنواع استخداما في الصناعة. الأسبستوس البني أموسايت ، الإسم التجاري للأمفيبوليات ، الأسبستوس الأزرق ريبيكايت أمفوليبي ويعتبر أخطر الأنواع. يستخدم الأسبستوس في مجال البناء وتسقيف المنازل والعوازل الداخلية والخارجية وأنابيب صرف المياه والأدخنة والتهوية، وتدخل ألياف الأسبستوس في صناعة أغلفة الأبواب المقاومة للحريق والخزائن الفولاذية، وكذلك كمادة عازلة للكابلات والأسلاك واللوحات الكهربائية. تقع أهم مواقع الأسبستوس في المملكة في كتل السربنتينات المرتبطة بدروز الأفيولايت وقد تم تدوين سبعة مواقع في درز ينبع الالتحامي (جبل ربان وجبل خشم نابون وجبل خضراء وأملج) وثمانية في درز نبيتة الإلتحامي (جبل الحميرية وبئر طلوحة وجبل الكرب والدفينة وحمضة وهجرة) وأربعة في درز الامار الالتحامي (أم حجة و جبل بتران وجبل التيس وحفيرة).",
                R.drawable.asbestos
            )
        }

        else if(metal == "Ilmenite"){
            metalInfoPopUp(
                "الإلمنايت Ilmenite",
                "الإلمينيت هو ثالث أكسيد الحديد والتيتانيوم ، لونه أسود أو رمادي، كثافته 4.7 جم/سم3،. وهناك معدن تيتانيوم رئيسي اخر هو الروتيل يميل الى اللون الأحمر. يعتبر الإلمنايت أهم خام التيتانيوم و يستخدم في الدهانات وأحبار الطباعة والأقمشة والبلاستيك والورق وواقي الشمس والأغذية ومستحضرات التجميل. يحتوي الإلمنايت على مراكز حديدية عالية الدوران ، وهو مغناطيسي متوازي. يتم التعرف على الإلمنايت بشكل شائع في الصخور النارية المتغيرة. يتواجد الإلمنايت في المملكة في عدة مواقع : وادي قبقب، وادي حيان (الوجه)، جبل أبوصفية، وادي كمال، وادي مرتجة (ينبع)، شمال شرق حرجة، لكثة(القنفذة) و القحمة.",
                R.drawable.ilmenite
            )
        }


        else if(metal == "Olivine"){
            metalInfoPopUp(
                "الأوليفين Olivine",
                "الأوليفين معدن مركب من سيليكات المغنسيوم والحديد، وهو أحد المعادن الكثيرة الوجود في القشرة الأرضية، كما يوجد في كثير من النيازك والشهب الساقطة على الأرض. تسمى الحالة النقية منه ذات البلورات الكبيرة زبرجد peridot يحتوي المعدن على خليط من فورستريت وفياليت. تعتمد درجة انصهار الأوليفين على نسبة الفورستريت إلى الفياليت، كما تعتمد الخواص الأخرى للأوليفين على تلك النسبة. يحتوي الأوليفين عادة على كميات بسيطة من الشوائب، أهمها النيكل والمنجنيز. ويوجد في الصخور النارية وفي بعض الصخور المتحولة. إن التركيب الكيميائي للأوليفين يجعله مناسباً للاستخدامات كعامل مساعد للصهر ومكثف للخبث في أفران الصهر ويستخدم كذلك كرمل لسباكة القوالب ، وفي تصنيع الطوب الحراري وكاشط لتفتيت الرمال. تتواجد معادن الأوليفين الرئيسية في المملكة بكميات وفيرة في حرة كشب .",
                R.drawable.olivine
            )
        }

        else if(metal == "Garnet"){
            metalInfoPopUp(
                "الجارنت Garnet",
                "يمثل معدن الجارنت مجموعة من سيليكات الحديد والألمنيوم مع تركيب كيميائي يتمايز بتبادل مجموعة عناصر الكالسيوم، المغنيزيوم، الحديد أو المنجنيز، كذلك عناصر الألمنيوم والكروم أو التايتانيوم. ولهذه المعادن خصائص فيزيائية متشابهة هي: قساوة تتراوح بين 7.5 - 8 ، مقاومة كيميائية وفيزيائية عالية ، مكسر محاري ، وألوان متعددة أكثرها شيوعاً اللون الأحمر القاني .وتشمل المعادن الرئيسية في هـذه المجموعة :\n" +
                        "(1) الجـارنت الألوميني الأمنديني (وبيروب سبيسرتاين وجروسولار) .(2) الجارنت الكلسي الأندرادايتي .(3) و الجارنت أوفاروفايتي. يستخدم الجارنت للأغراض الصناعية مثل أغلفة الكشط لورق الصنفرة، وفي تجهيز المطاط والبلاستيك والزجاج، وكذلك يستخدم لأغراض الكشط بالرمل المضخوخ هوائياً وفي تنقية وترشيح الماء وللسطوح غير الانزلاقية. ويستخدم بعض أنواع الجارنت كأحجار شبه كريمة في تجارة المجوهرات.\n" +
                        "يتواجد معدن الجارنت في المملكة في يئر الشمط بقرية النقرة و حرة الجعلاني و صدقة وجبل الحماط جنوب الرين وجبل حوشة ابن حويل (الدوادمي).\n",
                R.drawable.garnet
            )
        }

        else if(metal == "Zeolite"){
            metalInfoPopUp(
                "الزيولايت Zeolite",
                "الزيولايت معدن طبيعي ومهم اقتصاديا، عبارة عن سيليكات الألمنيوم المائية المتبلورة للقلويات والمعادن القلوية الأرضية. تتواجد الزيوليتات في الحالة الطبيعية في الحجارة البازلتية وفي الرواسب ،، وللزيولايت في الطبيعة ثلاثة أشكال: 1- الزيولايت المالىء للشقوق والعروق وفجوات الصخور البركانية .2- الزيولايت الحر : المتشكل بدرجات حرارة عالية  3- الزيولايت المتشكل بالحرارة المنخفضة. جميع أنواع الزيوليت ذات تعدين سطحي (منجم مفتوح) .ويستخلص الزيولايت من طحن ونخل الطف الحامل للزيولايت. يوجد 150 نوع من الزيوليتات الاصطناعية. من المواد الرئيسية التي تدخل في صناعة الزيولايت السيليكا أو أكسيد الألمنيوم. يستعمل الزيولايت لمعالجة التربة ولأسمدة لزيادة إنتــاج المحاصيل الزراعية. يدخل كمحفز في صناعة الأسمنت وفي الصناعات البتروكيميائية وصناعة المنظفات الكيميائية ومساحيق الغسيل ومعجون التنظيف وصناعة الزجاج وصناعة الاطارات المطاطية. صناعة الاجهزة الالكترونية كماص للرطوبة وصناعة الخزف والبورسلين. يتواجد الزيولايت في المملكة في صخور العصر الثلاثي البركاني لمجموعة جيزان في حرة شامة طفيل وجبل شام وكذلك في الطفوح والفوهات البركانية الفتاتية في حرات العصر الثلاثي والرباعي.",
                R.drawable.zeolite
            )
        }

        else if(metal == "Graphite"){
            metalInfoPopUp(
                "الجرافايت Graphite",
                "الجرافايت أو الرصاص الأسود،، هو أحد المعادن التي تتشكل طبيعيًا من الكربون، وهو أكثر أشكال الكربون استقرارًا في الظروف القياسية، لذلك عادةً ما يستخدم كوحدة قياس لتحديد حرارة تكوين مركبات الكربون، يحتوي الجرافايت على هيكل متعدد الطبقات يتكون من ست ذرات كربون مرتبة في صفائح أفقية متباعدة عن بعضها البعض، وهذه هي الطريقة التي يتبلور بها الجرافايت في النظام السداسي، على عكس الكربون المتبلور في النظام الثماني أو الرباعي مثل الألماس، عادةً ما تكون الروابط بين ذراته ثنائية الشكل ومتشابهة في خواصها الفيزيائية، لكنها ليست كذلك في النظام الرباعي، فعلى سبيل المثال يكون الجرافايت ذو لون رمادي غامق مائل إلى الأسود ولين جدًا، ذو صلابة 1.5 على مقياس موس للصلابة، بينما الألماس الذي تصطف ذراته وفق النظام الرباعي يكون عديم اللون وشفاف وهو من أقسى المواد المتشكلة طبيعيًا. يستخدم في صناعة أقلام الرصاص ومواد التشحيم والبوتقات وواجهات المسابك ومصابيح القوس والبطاريات وفرش المحركات الكهربائية. وأيضا في صناعة البطاريات والمفاعلات النووية. يتواجد الجرافايت في المملكة في منطقة النقرة والدوادمي وفي وادي الرخيمان وتثليث وبيشة",
                R.drawable.graphite
            )
        }


        else if(metal == "Dolomite"){
            metalInfoPopUp(
                "الدلومايت Dolomite",
                "الدلوميت عبارة عن حجر جيري تزيد فيه نسبة معدن الدلوميت عن 50% من الصخر. أطلق اسم الدولوستون (Dolostone) على الصخر، وذلك تجنباً لحدوث خلط بين معدن الدولوميت وصخر الدلوميت. يشبه نسيج الدلوميت بصورة عامة الحجر الجيري لكنه يختلف عنه في التفاصيل الدقيقة ويرتبط الدلوميت ذو الحبيبات الدقيقة نمطياً بصخور المتبخرات. وفي أغلب الصخور التي تحتوي على الصوان (chert) والدلوميت، يبدو أن الصوان قد حل محل الدلوميت وليس العكس. يوجد الدلوميت غالباً مع الحجر الجيري المرافق له وذلك في شكل طبقات متداخلة أو متدرجة على جوانب الحجر الجيري، وفي بعض المناطق لا يتطابق الدلوميت مع مستويات التطبق. يستخدم الدلوميت كحجر للزينة، وركام خرساني، وكمصدر خام لاستخراج اكسيد المغنيسيوم، وكذلك في عملية بيدجون لإنتاج المغنيسيوم. كما يعتبر صخر ذو قيمة اقتصادية لتخزينه للبترول، يتم استخدام الدلوميت أحيانا لصهر الحديد والصلب وفي صناعة الزجاج المصقول. يتواجد الدلوميت في المملكة بكثرة في عدة مناطق: خريصان (شرق الخرج)، ثول (شمال جدة)، جبل الشهبة وجبل إغدادة (غرب عفيف)، وادي عرعر(الجوف)، جال الخوطم (عنيزة)، وجال الشجر (بريدة) وفي الدمام والجبيل وفي الدرب (شمال جيزان) والطرطية (جنوب عفيف) وجبل الطراد والبجر (شرق رنية).",
                R.drawable.dolomite
            )
        }

        else if(metal == "Basalt"){
            metalInfoPopUp(
                "البازلت Basalt",
                "البازلت صخري ناري يتميّز بصغر حجم حبيباته هو أحد الصخور المشهورة على سطح الأرض، ويتدرج لونه من الرمادي إلى الأسود الغامق، غنيٌّ بعدة عناصر منها الماغنسيوم والحديد، كما أنه يتكون من عدة معادنَ هامةٍ وهي الأوليفين والبيروكسين والبلاجيوكليز، ويحتوي على نسبةٍ كبيرةٍ من السليكا تتراوح ما بين 45% إلى 52%. غالبًا ما يتكون البازلت في قيعان المحيطات، فقد تتشكل جزرٌ كاملةٌ منه نتيجة البراكين التي تنفجر في أحواض المحيطات، وقد تتكون هضابٌ كاملةٌ منه وأيضًا هناك براكينٌ على المريخ والزهرة تتشكل من البازلت. تمدنا طبيعة الصخور البازلتية بأدلّة مفيدة عن تركيب داخل الأرض والقمر ودرجة حرارته، لقد ساهمت الخصائص المغناطيسية للصخور البازلتية في المعلومات أو المعرفة الحاليّة للسلوك القديم للمجال المغناطيسي للأرض، ومعدّل انتشار قاع البحار. وقد يوجد البازلت على شكل حجر خفاف (Pumice) ومقذوفات (Bombs) ويُسمَّى حجر الخفاف البازلتي جفاء أو سكوريا (Scoria) ليميّزه عن الريولايت البازلتي فاتح اللون والأكثر سليكية. يستخدم البازلت في العزل الحراري والكهربائي والصوتي، وفي أعمال البناء لإنشاء قواعد الطرق و السكك الحديدية، وفي تصنيع البلاط و الأنابيب والقضبان والصناعة الطبية لجراحة العظام. يعد البازلت مادة مثالية لأعمال الديكورات الداخلية، وزخرفة المجوهرات . تغطي حقول البازلت ( الحرات ) المنتشرة بالدرع العربي في المملكة حوالي 90 الف كيلو متر مربع واهمها حرة رهط، وحرة الحرة والنعيمية شمال جده وحرة المحيسنية وكشب شمال شرق جده وحرة هتيمة وحرة البرك وحرة خيبر وحرة نواصيف وحرة البقوم وحرة حضن شمال شرق الطائف. ",
                R.drawable.basalt
            )
        }

    }

    private fun metalInfoPopUp(name: String, description: String, image: Int) {

        val popupView = LayoutInflater.from(this).inflate(R.layout.popup_layout, null)
        popupView.findViewById<TextView>(R.id.title).text = name
        popupView.findViewById<TextView>(R.id.description).text = description
        popupView.findViewById<ImageView>(R.id.image).setImageResource(image)

        val dialog = Dialog(this)
        dialog.setContentView(popupView)

        val displayMetrics = resources.displayMetrics
        val screenWidth = displayMetrics.widthPixels


        dialog.window?.setLayout((screenWidth * 0.6).toInt(), LinearLayout.LayoutParams.WRAP_CONTENT)

        dialog.show()

        val closeButton = popupView.findViewById<Button>(R.id.closeButton)
        closeButton.setOnClickListener {
            dialog.dismiss()
        }
    }

}
