package com.example.map

import android.annotation.SuppressLint
import android.app.Dialog
import android.content.Intent
import android.graphics.Bitmap
import android.graphics.Canvas
import android.graphics.drawable.BitmapDrawable
import android.graphics.drawable.Drawable
import android.os.Build
import android.os.Bundle
import android.view.LayoutInflater
import android.view.View
import android.widget.Button
import android.widget.ImageView
import android.widget.LinearLayout
import android.widget.TextView
import androidx.appcompat.app.AppCompatActivity
import androidx.core.content.ContextCompat
import com.google.android.material.floatingactionbutton.FloatingActionButton
import com.mapbox.geojson.Point
import com.mapbox.maps.MapView
import com.mapbox.maps.MapboxMap
import com.mapbox.maps.CameraOptions
import com.mapbox.maps.plugin.annotation.annotations
import com.mapbox.maps.plugin.annotation.generated.PointAnnotationManager
import com.mapbox.maps.plugin.annotation.generated.PointAnnotationOptions
import com.mapbox.maps.plugin.annotation.generated.OnPointAnnotationClickListener
import com.mapbox.maps.plugin.annotation.generated.PointAnnotation
import com.mapbox.maps.plugin.annotation.generated.createPointAnnotationManager

class TourismActivity : AppCompatActivity(), OnPointAnnotationClickListener {

    data class LocationMarker(
        val latitude: Double,
        val longitude: Double,
        val title: String,
        val description: String,
        val imageResId: Int,
        val region: String
    )

    private lateinit var mapView: MapView
    private lateinit var mapboxMap: MapboxMap
    private lateinit var pointAnnotationManager: PointAnnotationManager
    private val annotationDataMap = HashMap<Long, LocationMarker>()

    @SuppressLint("UseCompatLoadingForDrawables", "InflateParams", "SetTextI18n")
    override fun onCreate(savedInstanceState: Bundle?) {

        if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.KITKAT) {
            // This code will hide the system navigation bar
            window.decorView.systemUiVisibility = (
                    View.SYSTEM_UI_FLAG_HIDE_NAVIGATION
                            or View.SYSTEM_UI_FLAG_IMMERSIVE_STICKY
                    )
        }


        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_tourism)
        supportActionBar?.hide()

        //START: Back button
        val homeBtn: FloatingActionButton = findViewById(R.id.home)
        homeBtn.setOnClickListener {
            onBackPressed()
        }
        //END: Back button

        //START: Brief button
        val brief: Button = findViewById(R.id.brief)
        brief.setOnClickListener {
            // Inflate the popup view
            val popupView = LayoutInflater.from(this).inflate(R.layout.popup_brief, null)
            popupView.findViewById<TextView>(R.id.title).text = "السياحة والآثار"
            popupView.findViewById<TextView>(R.id.description).text = "ظهر مفهوم السياحة الجيولوجية للمرة الأولى في 1995م من قِبل توماس هوز، لتشكّل وسيلة لتعزيز الحفظ الجغرافي وفهم التراث، كما تعزز المسؤولية البيئية والاجتماعية والاستدامة. السياحة الجيولوجية الآن هي جزء من السياحة الجغرافية كما تركّز على السمات غير الحيوية مثل التراكيب الجيولوجية من فوالق وطيات وعلى فوهات البراكين الخامدة ومجموعة كبيرة جداً من الأحافير من كل الأزمنة الجيولوجية. إن المنظور (الجغرافي) يرى السياحة الجيولوجية على أنها سياحة مستدامة. في المقابل، يرى المنظور (الجيولوجي) أنها شكل من أشكال السياحة التقليدية. مع نمو السياحة الجيولوجية، نشأ مخطط تصنيف للخصائص الجيولوجية، وأخذ في الاعتبار القيمة الجيولوجية للموقع وعكس تصورات وتقييمات السائحين.\n" +
                    "تحظى المملكة بالعديد من المواقع الجيولوجية في جميع مناطقها ومدنها، بسبب التنوع الجغرافي لها، وبدأ استغلال هذه الطبيعة لتكون جزءاً مهماً من التنمية السياحية. إن السياحة الجيولوجية في المملكة تمتاز بمساحتها الشاسعة وطبيعتها المتنوعة من صحراء وبحار وجبال وأودية وسواحل، كل ذلك مكّن السائحين من الاستمتاع بتجارب استكشافية لمعالم يعود تاريخها إلى آلاف السنين. أن تنوع السجلات الصخرية يعد إرثاً جيولوجياً يمكن وضعه على خريطة المملكة السياحية، وهذا يتطلب إنشاء متنزهات جيولوجية على قمم الجبال وبين أوديتها لتوعية الجمهور وتثقيفه بأهمية السياحة الجيولوجية. أن المملكة حباها الله بموقع جغرافي استراتيجي متميز على مساحة قرابة مليوني كيلو متر مربع، إضافة إلى تنوع كبير وفريد في طبيعتها الجيولوجية، وتضاريسها؛ فبيئتها الجيولوجية تختلف من مكانٍ إلى مكان، ما بين صحراوية وجبلية وساحلية، وأراضٍ رطبة يجب استغلالها، والعمل على تقييمها، ما يعزز أهمية إدراجها ضمن خطط تنويع روافد الاقتصاد الوطني كوجهات سياحية تسهم في جذب السُياح والهواة، وفقاً لمستهدفات رؤية 2030. تمتاز المملكة بطول ساحلها الغربي المطل على البحر الأحمر، ويبلغ عدد الجزر التي تتبع لها جغرافياً نحو 1150 جزيرة، مختلفة في النوع وفي المساحة، كما بلغ عدد الجزر المطلة على الخليج العربي نحو 150 جزيرة، تختلف في أنواعها؛ منها الجزر الرملية والبركانية والجزر الصخرية مرجانية التكوين. يوجد آلاف المعالم من كهوف وصخور نارية وأحافير تعود إلى مختلف العصور مثل الأشجار المتحجرة، وطبعات أقدام الديناصورات، والأمونيات، وأصداف الرخويات، فهناك جبل طويق الجوراسي العمر، الذي تكون ما بين 135 إلى 180 مليون سنة ماضية، ويمتد إلى أكثر من ألف كيلو متر من شمال الزلفي إلى جنوب شرق وادي الدواسر. وفي الشمال، يقع موقع «غار العمة» في مدينة القريات والعيون الكبريتية في قرية كاف، وقرية عين الحواس وأماكن استخراج الملح في القريات التي يمكن تطويرها سياحياً، إضافة إلى العيون الحارة بالخوبة جنوب شرق مدينة جازان بمسافة 70 كم، وعلى ارتفاع 160م من منسوب سطح البحر، ويشتمل الموقع على عدد أربعة عيون، وتتراوح درجات حرارة المياه الخارجة منها بين 58 و75 درجة مئوية. هناك المناطق البركانية المُسمَّاة بالحرات، وتنتشر عليها مئات البراكين الخامدة، وتأتي كالتالي من الجنوب إلى الشمال: حرة السراة، البرك، البقوم، النواصف، هادان، الكشب، رهط، حلة أبو نار، خيبر، العويرض، الشامة والحماد. حرة رهط وحدها فيها نحو 700 مخروط بركاني، كما أنها صُنفت من قبل الهيئة العليا للسياحة، كأول متنزه جيولوجي في المملكة يمثّل متحفاً بركانياً مفتوحاً . السياحة الجيولوجية في المملكة تشمل أيضاً الأشكال الجيومورفولوجية لصخور الميوسين لجبال برقاء الركبان غرب الأحساء، والمغارات، إضافة إلى رمال النفوذ الكبير شمال حائل والربع الخالي الذي يعتبر أكبر جسم رملي متصل في العالم. وفي جنوب غرب العبيلة، يقع أحد مواقع ارتطام نيزك بالأرض تُسمّى «الحديدة»، فضلاً عن مناطق الرمال الأخرى مثل الجافورة والدهناء، وتتمتع المملكة بظاهرة ورود الصحراء شمال بقيق، والأشجار المتحجرة في القصيم التي تعود للعصر البرمي منذ أكثر من 240 مليون سنة، وكذلك الموجودة شرق الرياض التي تعود إلى لعصر الطباشيري لأكثر من 70 مليون سنة. إن المملكة متحف جيولوجي مفتوح تكشف فيه الصخور عن معظم العصور الجيولوجية، بدءاً من صخور القاعدة التي تشكل صخور الدرع العربي، تعلوها صخور دهر الحياة الظاهرة (حقبة الحياة القديمة والمتوسطة والحديثة) والتي يمتد عمرها من 550 مليون سنة حتى وقتنا الحاضر. في ظل وجود هذا المتحف الجيولوجي المكشوف على أراضي المملكة يمكن أن يُستغل كرافد مهم للاقتصاد، ومحور أساسي في رؤية 2030 كمصدر جديد من مصادر الدخل القومي، فهناك إمكانية لتأسيس الحدائق الجيولوجية، وهي الأراضي ذات مكونات جيولوجية فريدة، وبلغ عددها حتى الآن 54 حديقة حول العالم تنتشر في 17 بلداً. لا تقتصر الأهمية الاقتصادية للسياحة الجيولوجية كمصدر للدخل على السياحة الداخلية بل يمكن استغلالها كمصدر للعملة الصعبة من السياحة العلمية من جميع أنحاء العالم. هذا المتحف الجيولوجي يضم معالم متنوعة تشكلت بشكل طبيعي في طبقات الحجر الرملي والجيري، وكذلك تنوع المنكشفات الطبوغرافية المختلفة من أودية وجبال وكهوف وأحافير، ومواقع لمناجم تعدينية قديمة، وسهول وهضاب متميزة، وشواطئ منها صخرة الجمل في محافظة الوجه وهي عبارة عن تكون صخري تشكل بفعل عوامل التعرية من ملايين السنين، وكذلك صخرة التين في محافظة الوجه وهي تشكيل صخري من صخور الحجر الجيري تكون نتيجة لعوامل التعرية يشبه ثمرة التين، ووادي الديسة في محافظة تبوك المليء بالتشكيلات الصخرية، كما يمتاز بغطاء نباتي كثيف وعيون وينابيع مياه." +
                    " إن المملكة أصبحت وجهة سياحية عالمية، حيث استفادت من اعتماد منظمة «اليونسكو» للمواقع السياحية الأثرية فيها، ما انعكس على القطاع باستقبال أكثر من 100 مليون سائح، وإضافة نحو 130 ألف غرفة فندقية لخدمة العدد المتزايد منهم. من المتوقع أن تخلق صناعة السياحة في المملكة أكثر من 1.6 مليون وظيفة جديدة بحلول عام 2030، ما يرفع مساهمة الصناعة في الناتج المحلي الإجمالي إلى 10 في المئة، ومن المتوقع أن ينمو إجمالي الإنفاق على السياحة الدولية بنسبة 82 في المئة إلى أكثر من 560 مليار ريال سعودي بحلول عام 2030. تعتبر صناعة السياحة في المملكة الآن في المرتبة الثانية الأسرع نمواً في العالم بالتزامن مع نمو الوافدين الدوليين في الربع الأول من 2023، مسجلة نمواً بنسبة 64 في المئة مقارنة بالربع الأول من 2019، كما وفرت المملكة أكثر من 836 ألف فرصة عمل جديدة على المستوى المحلي، ما رفع مساهمة السياحة في الناتج المحلي الإجمالي للمملكة إلى 5.3 في المئة.\n" +
                    "وباختصار فإن المملكة تجري تحولاً وطنياً كجزء من رؤية 2030، لتغيير المشهد محلياً ودولياً، ومنذ الانفتاح على السياحة في 2019، أقامت عرضاً تنافسياً يجمع بين الثقافة العربية الأصيلة وعرضاً ترفيهياً سريع الانتشار، ومع استمرارنا في التحول كوجهة، سنسعى دائماً للحفاظ على تراثنا والاحتفاء به، ودعوة العالم لتجربة كل ما تقدّمه المملكة مع الحفاظ على التزامنا بحماية المناظر الطبيعية وبيئتنا. \n" +
                    "\n" +
                    "\n" +
                    "أنه يمكن رؤية أمثلة على كيفية تحقيقنا لهذا الهدف في:\n" +
                    "•\tالدرعية، إذ يخضع موقع التراث العالمي لليونسكو الذي يعود تاريخه إلى 300 عام لمخطط رئيسي بقيمة 50.6 مليار دولار مع التراث والتقاليد السعودية في جوهره، ليتحول إلى الوجهة السياحية الثقافية الأكثر ديناميكية في العالم بحلول عام 2030.\n" +
                    "•\tالعلا، وقد قُدم نحو 25 مليون دولار لتنمية السكان الأصليين للنمور العربية المهددة بالانقراض، كما سيشهد برنامج شامل لإعادة التوطين والحماية إطلاق 650 غزالاً عربياً و550 غزالاً رملياً في الصحراء القديمة هذا العام.\n" +
                    "•\tمشروع البحر الأحمر، وهو مشروع سياحي فاخر متجدد سيكون له تأثير إيجابي على بيئة البحر الأحمر، ليخلق نظاماً بيئياً أنظف وأكثر اخضراراً، علماً أن الأهداف الخضراء تتضمن تشغيل الطاقة المتجددة بنسبة 100 في المئة، وتنفيذ مجموعة من السياسات بما في ذلك عدم وجود نفايات في المكب، وحيادية الكربون بنسبة 100 في المئة، وفرض حظر كامل على المواد البلاستيكية التي تستخدم مرة واحدة، وهناك أيضاً خطط لأن يصبح البحر الأحمر أكبر محمية سماء مظلمة معتمدة.\n" +
                    "•\tتشكل الجبال في منطقة عسير الباردة والمورقة والخضراء نقطة محورية في حملة «إعادة التفكير في الصيف» المستمرة، وتتميز الجبال المغطاة بأشجار العرعر بقمم ثلجية يبلغ ارتفاعها أكثر من ثلاثة آلاف متر.\n" +
                    "•\tالأحساء المدرجة في قائمة اليونسكو تستهدف تنمية السياحة المستدامة، ومع 2.5 مليون نخلة، فهي أكبر واحة في العالم.\n" +
                    "•\tفوهة الوعبة، إحدى عجائب الدنيا الطبيعية، وهي تكوين طبيعي من المحتمل أن يكون نتيجة ثوران بركاني.\n" +
                    "•\tالحجر المدرج في قائمة اليونسكو هو موقع رئيسي ومحمي بشكل جيد من الحضارة النبطية، ويتميز بمقابر ضخمة ذات واجهات مزخرفة تعود إلى القرن الأول قبل الميلاد إلى القرن الأول الميلادي، ونحو 50 نقشاً من فترة ما قبل النبطية ورسومات الكهوف.\n" +
                    "•\tحائل، تتمتع بمناظر طبيعية لا تصدق من جبال الحجر الرملي التي شكلتها قرون من التعرية إلى البراكين البيضاء في حارة بني راشد وجبال شمر. \n" +
                    "\n" +
                    "من الآن حتى عام تحقيق الرؤية 2030، تمتلك المملكة جدولاً مزدحماً وقائمة طويلة من المشاريع التي ينبغي تحقيقها، وستنتشر الحدائق الجيولوجية كجزء من السياحة الجيولوجية في المملكة، وخاصة في نيوم، والعلا، والرياض، ومنطقة البحر الأحمر، وجنوب غرب المملكة.\n"

            // Create the dialog
            val briefDialog = Dialog(this)
            briefDialog.setContentView(popupView)

            // Get the screen width
            val displayMetrics = resources.displayMetrics
            val screenWidth = displayMetrics.widthPixels

            // Set the dialog window width to 70% of the screen width
            briefDialog.window?.setLayout(
                (screenWidth * 0.9).toInt(),
                LinearLayout.LayoutParams.WRAP_CONTENT
            )

            // Show the dialog
            briefDialog.show()

            // Find the button and set a click listener to close the dialog
            val closeButton = popupView.findViewById<Button>(R.id.closeButton)
            closeButton.setOnClickListener {
                briefDialog.dismiss() // This will close the dialog
            }
        }
        //END: Brief button


        mapView = findViewById(R.id.mapView)
        mapboxMap = mapView.getMapboxMap()

        // Set initial map style from your custom JSON
        setMapStyle("maps/saudi_geo/sahel.json")

        pointAnnotationManager = mapView.annotations.createPointAnnotationManager().apply {
            addClickListener(this@TourismActivity)
        }


        // Set initial camera position
        val initialPosition = CameraOptions.Builder()
            .center(Point.fromLngLat(47.189224, 24.694291)) // Riyadh, Saudi Arabia
            .zoom(4.3)
            .build()
        mapboxMap.setCamera(initialPosition)

        val resetZoomBtn: FloatingActionButton = findViewById(R.id.reset_zoom)
        resetZoomBtn.setOnClickListener {
            mapboxMap.setCamera(initialPosition)
        }

    }

    private fun addMarkerWithPopup(marker: LocationMarker) {
        val point = Point.fromLngLat(marker.longitude, marker.latitude)
        val pointAnnotationOptions = PointAnnotationOptions()
            .withPoint(point)
            .withIconImage("marker-icon-id")
            .withIconSize(0.2)

        val annotation = pointAnnotationManager.create(pointAnnotationOptions)
        annotationDataMap[annotation.id] = marker
    }

    override fun onAnnotationClick(annotation: PointAnnotation): Boolean {
        val markerData = annotationDataMap[annotation.id]
        if (markerData != null) {
            showPopup(markerData.title, markerData.description, markerData.imageResId)
        }
        return true
    }

    @SuppressLint("InflateParams")
    private fun showPopup(title: String, description: String, imageResId: Int) {
        val popupView = LayoutInflater.from(this).inflate(R.layout.popup_layout, null)
        popupView.findViewById<TextView>(R.id.title).text = title
        popupView.findViewById<TextView>(R.id.description).text = description
        popupView.findViewById<ImageView>(R.id.image).setImageResource(imageResId)

        val dialog = Dialog(this)
        dialog.setContentView(popupView)

        val displayMetrics = resources.displayMetrics
        val screenWidth = displayMetrics.widthPixels

        // Set the dialog window width
        dialog.window?.setLayout((screenWidth * 0.8).toInt(), LinearLayout.LayoutParams.WRAP_CONTENT)

        dialog.show()

        val closeButton = popupView.findViewById<Button>(R.id.closeButton)
        closeButton.setOnClickListener {
            dialog.dismiss()
        }
    }


    private fun setMapStyle(assetPath: String) {
        val styleJson = loadJsonFromAsset(assetPath)
        mapboxMap.loadStyleJson(styleJson) { style ->
            val markerIconDrawable = ContextCompat.getDrawable(this, R.drawable.marker_icon)
            markerIconDrawable?.let {
                val markerIconBitmap = drawableToBitmap(it)
                style.addImage("marker-icon-id", markerIconBitmap)
            }


            // Example markers - add your markers here
            val markers = listOf(

                LocationMarker(
                    26.69695438534737,
                    37.98229033124041,
                    "جبل الفيل",
                    "جبل الفيل من العجائب الجيولوجية في مدينة العلا بالمملكة العربية السعودية ويقع ’’جبل الفيل’’ في منطقة متسعة تكسوها الرمال الذهبية على بعد 7 كم إلى جهة الشرق من محافظة العلا التابعة لمنطقة المدينة المنورة. وهو عبارة عن صخرة عملاقة من الحجر الرملي الطبيعي يبلغ ارتفاعها عن الأرض 52 مترا، ويجسد الجبل الشهير شكل خرطوم يلامس الأرض وجسد الفيل، ونُحت بفعل قوة الطبيعة على مدار ملايين السنين من عوامل الحتّ والتعرية بالرياح والماء. يعتبر من أقدم المعالم السياحية التاريخية الأثرية في المملكة. ",
                    R.drawable.feel,
                    "منطقة المدينة المنورة"),

                LocationMarker(
                    27.049444444444447,
                    37.76583333333333,
                    "قوس مقرط الدبوس شمال العلا",
                    "يعد جبل القوس، المعروف أيضاً باسم ’مقرط الدبوس’ ويقع على بعد 60 كم شمال العلا، أحد أشهر التكوينات الصخرية في صحراء العلا، ويمتاز بهيكله على شكل الجسر، والذي يشبه قوس قزح محاط بسحابتين، هو مشهد نادر بالفعل، كما تحيط بهذا الجبل مترامي الأطراف من الحجر الرملي ماسات صحراوية شبه كريمة، ويمكنك مشاهدة هذه القطع متعددة الألوان من الكوارتز المضمنة في الصخرة نفسها والمنتشرة على الأرض المحيطة بها. نتج هذا القوس عن طريق عمليات التعرية والحت التفاضلية في صخور الحجر الرملي. ",
                    R.drawable.daboos,
                    "منطقة المدينة المنورة"),


                LocationMarker(
                    27.35944,
                    37.79556,
                    "غراميل العلا",
                    "غراميل هي منطقة جبلية في شمال غرب المملكة العربية السعودية، في محافظة العلا باتجاه منطقة تبوك التي تبعد عنها 300 كيلومتر، فهي تكوينات صخرية حمراء ذات أشكال متفاوتة نحتتها الرياح على مر الأزمنة، لتصبح أيقونة فريدة في مشهد صحراوي ساحر، وهي من المناطق المرتفعة التي يمكن رؤية مجرة درب التبانة بوضوح من خلالها. تقع أرض الغراميل على بعد ساعة تقريباً من وسط مدينة العلا، ويمكنك فيها اكتشاف مجموعة من الأعمدة الحجرية الرقيقة والداكنة والمعروفة باسم ’’الغراميل’’، تعد الغراميل بقايا جبل كان عملاقاً ، وهي أرضاً ليس لها مثيل، وتشعر فيها بالانتقال إلى كوكب آخر، وتظن أنك بين أطلال مدينة خاوية على عروشها.. بينما هي صخور داكنة مرتكزة كجذوع النخيل أو الأعمدة. الغراميل عبارة عن جبل كبير، لكنه تفتت إلى أعمدة رقيقة، تحتوي على أكاسيد الحديد، بما يجعلها تقاوم تغيرات المناخ، وعوامل التعرية، فتظل صامدة. بعض هذه الأعمدة (الغراميل)، يتساقط منذ آلاف السنين، تأثرا بالتعرية والأحوال الجوية، إذا كانت الطبقات السفلى لها، لينة. تعددت مسمياتها، حسب شكل الغرمول أو العامود.",
                    R.drawable.gramel,
                    "منطقة المدينة المنورة"),

                LocationMarker(
                    24.38472,
                    39.83053,
                    "بركان جبل الملساء",
                    "تحتوي حرة رهط على أكثر من 700 فوهة بركانية. وهي واحد من 12 حقلًا بركانيًا في المملكة تغطي ما يقارب من 80000 كيلومتر مربع. وتقع حرة رهط ضمن سلسلة الطفوح البركانية بمنطقة المدينة المنورة. ويعد الجزء الشمالي من حرة رهط أكثر أجزاء تلك الحرة نشاطًا، والتي تقع إلى الجنوب من المدينة المنورة. يقع بركان جبل الملساء في جنوب شرق المدينة المنورة، وهو أحدث بركان انفجر في أرض الحجاز وتحديدا في عام 654هـ 1256م وله فوهة مخروطية يصل عمقها إلى 40 مترًا ويتشكل في قاعها الصخور والتكلسات الكبريتية، وقد استمر ثورانه لعدة أيام، وكانت حممه البركانية سارية حتى مسافة 23كم، وقد توقف أطول لسان لهذه الحمم البركانية على بعد 8.2 كم من مسجد الرسول الكريم، وقد سمي هذا البركان وما أحدثه في ذلك الوقت ب ’’ بحرة رهاط’’. ويشير موقع المساحة الجيولوجية بأن في ال6 آلاف عام الماضية، قد حدث حوالي 11 ثورانا بركانيا في حرة رهاط، وكان آخرها وأحدثها الحدث البركاني الشهير التي نحن بصدد الحديث عنه، والذي وقع في عام 654هـ واستمر أكثر من 52 يوما، حتى أن ابن كثير قد وصف هذا البركان بقوله ’’ بقيت تلك النار على حالها تلتهب التهابا وهي كالجبل العظيم ارتفاعا والمدينة عرضا يخرج منها حصى يصعد إلى السماء ويهوي فيها ويخرج منها كالجبل العظيم نار ترمي كالرعد وبقيت كذلك أياما ووقفت أياما ثم عادت ترمي بحجارة خلفها وأمامها حتى بنت لها جبلين ولها كل يوم صوت عظيم آخر الليل إلى ضحوة’’",
                    R.drawable.malsaa,
                    "منطقة المدينة المنورة"),


                LocationMarker(
                    25.66943,
                    39.92270,
                    "بركان جبل البيضاء بحرة خيبر",
                    "حرة خيبر او بني رشيد  واحدة من اكبر الحقول البركانية ،و تغطي مساحة تقدر بأكثر من 14،000 كيلومتر مربع الى الشمال من المدينة المنورة. يتكون جبل البيضاء والذي يأخذ اللون المائل للأبيض والمكونة من صخور بركانية من نوع الكومندايت، جعلت منه واحدة من أندر المعالم الجيولوجية في الجزيرة العربية، حيث يبلغ ارتفاعه قرابة 2000 متر عن سطح البحر، وتنبت بداخله الكثير من النباتات والأشجار الصحراوية المتنوعة. إن فوهة بركان جبل البيضاء يعد من أندر البراكين في جزيرة العرب والعالم، حيث تحتوي حَرة خيبر على ثلاثة براكين نادرة وهي جبل البيضاء، وجبل الأبيض، وجبل المنسف وهي صخور بركانية نادرة ووحيدة. تتكون من صخور بركانية حامضية رمادية فاتحة، وفيها زجاج بركاني، انفجرت منذ آلاف السنين، وشكّلت لونها الفاتح المائل إلى الأبيض، وباتت مقصدًا للمستكشفين والباحثين والمهمتين والسياح من مختلف أنحاء العالم. وتجدر الإشارة الى أن تصنيف الصخور البركانية يعود بحسب درجات تبلور حبيباتها، ونسبة السليكا والمعادن الأخرى فيها، فهي حمضية: السليكا عالية - زجاجية - فقاعية - دقيقة الحبيبات: كالرايولايت والأنديزيتُ والتراكايت والكومندايت، قلوية: السليكا قليلة، معادن البيروكسين والأولوفين عالية: كالبازلت.",
                    R.drawable.baidaa,
                    "منطقة المدينة المنورة"),

                LocationMarker(
                    25.71806,
                    39.95165 ,
                    "جبل القدر",
                    "جبل القِدر هو جبل بركاني خامد يقع في منطقة المدينة المنورة غرب المملكة، ويقع تحديداً في حرة خيبر. يبلغ ارتفاع الجبل نحو 2022 م. تم تصنيفه واختياره ضمن أفضل 100 موقع جيولوجي من الاتحاد الدولي للعلوم الجيولوجية ومنظمة الأمم المتحدة للتربية والعلم والثقافة (اليونسكو. جبل القدر بحرة خيبر في المملكة العربية السعودية يعتبر من أكبر الحقول البركانية وضمن آخر البراكين التي ثارت قبل 1000 سنة وكونت شكلاً جمالياً خلاباً وهو مخروط بركاني كبير يبلغ ارتفاعه النسبي نحو 400 متر. فيما قذف هذا البركان أثناء ثورانه حجماً كبيراً من تدفقات الفتات والحمم البازلتية التي تغذيها الأنابيب البازلتية. وغطت هذه اللابات مواقع منشآت حجرية (أو ما يعرف بـ ’’الطائرات الورقية الصحراوية’’) والتي تم بناؤها خلال العصر البرونزي تقريبا قبل 5000 عام تقريباً. يتميز جبل القدر بشكله المخروطي الجميل، لوجوده في أكبر وأجمل وأغرب حرات المملكة مساحةً، وتنوعًا صخريًا، وجيومورفولوجيًا، وآثاريًا، واستيطانًا، وصخور بركانية نادرة ’’. ويتميز جبل القدر بحياة فطرية متنوعة، ومن أشهر الحيوانات التي تعيش فيها هي الذئاب، والضباع، والتفه ’’ الوشق’’، والنيص، والثعالب، والطيور، والخفافيش، والحشرات، ومن الأشجار المتنوعة مثل الطلحيات ’’الأكاسيا’’، والعرفج، والطلح، والضهيان ومن الرحمانيات السدر، والمتسلقات، العلجان، والنباتات الموسمية والشجيرات النادرة وأعشاب ’’الجرجير البري الحمّيض’’ وأشجار الحماط ’’التين البري’’، ويعود سبب تسمية خيبر بهذا الاسم لكونها أرض خبرة، أي طيبة الطين، سهلة تتجمع فيها المياه.",
                    R.drawable.qadar,
                    "منطقة المدينة المنورة"),

                LocationMarker(
                    27.428639,
                    38.073980 ,
                    "صخرة \"العروسة\"",
                    "صخرة \"العروسة\" ، التي تقع شمال محافظة العلا بقرابة 100كلم، هي واحدة من مئات التشكيلات الصخرية التي تشتهر بها المحافظة، تشابه بشكلها الفريد العروسة التي ترتدي فستان زفافها شُكّلت على مدى آلاف السنين. وباتت صخرة \"العروسة\" إحدى أهم المواقع السياحية التي يقصدها الزوار من مختلف المناطق، التي تتربع وسط مجموعة من الرمال والصخور الأخرى المتنوعة",
                    R.drawable.arosa,
                    "منطقة المدينة المنورة"),

                LocationMarker(
                    26.807940962929095,
                    37.96896232009935,
                    "مدائن صالح",
                    "تقع مدائن صالح أو ما تُدعى بالحِجر في منطقة المدينة المنورة وتبُعد 20 كم شمال مدينة العُلا، تعود سميت مدائن صالح بهذا الاسم؛ لأنّ النبيّ صالح -عليه السلام- بُعث إلى سكّانها، وهم قوم ثمود؛ فنسبت إليه، قال تعالى: (وَإِلَى ثَمُودَ أَخَاهُمْ صَالِحًا). يعود غالبية الآثار في هذا الموقع الأثري إلى المملكة النبطيّة خلال فترة القرن الأول ميلادي، حيث تُعدّ مدائن صالح أكبر مُدن الأنباط بعد عاصمتهم البتراء. يضّم الموقع 131 مقبرة تمّ نحتها وبناؤها في الصخور المُحيطة، حيث تجمع المقابر ما بين عناصر العمارة الرومانية مع الصور النبطيّة والبابليّة، كما يحتوي الموقع على 50 نقش من النقوش التي تعود إلى فترة ما قبل الحضارة النبطيّة وبعض رسومات للكهوف، بالإضافة إلى ذلك يُقدّم الموقع صورة عن الخبرة الهيدروليكيّة لدى الأنباط؛ حيث أنّهم حفروا آبار المياه في الصخور وبنوا أعمدة شاهقة ونقوش ضخمة وغرف خفية. سمي \"قصر البنت\" بهذا الاسم لأنه يضم 31 مقبرة تملكها نساء، ومن الأشياء التي ميزت الأنباط أيضا في جبل إثلب، هي قدرتهم على استغلال الطبيعة في خدمة احتياجاتهم، إذ حرصوا على نقش ممرات أو خطوط صغيرة على الجبال، لتجميع مياه الأمطار، أو لإبعادها على واجهات القبور.",
                    R.drawable.saleh,
                    "منطقة المدينة المنورة"),

                LocationMarker(
                    24.568856777923962,
                    38.308616488288415,
                    "جبل رضوى",
                    "جبل رضوى هو جبل يقع في محافظة ينبع بمنطقة المدينة المنورة ويبلغ ارتفاعه 2170 متراً. يعتبر من أشهر جبال المدينة المنورة ويتميز بارتفاعه وجماله وشهرته على مر التاريخ وهو من الجبال الوعرة التي يصعب صعودها ومن قمته ترى مدينة ينبع كاملة. ويتكون من أنواع عدة من الصخور، منها: الصخور النارية كالجرانيت، والصخور المتحولة كالنيس والشست، وتمتاز هذه المكونات بصلابتها ومقاومتها لعمليات التعرية. وتنحدر من قممه العالية بعض الأودية والشعاب المتميزة بكثافة غطائها النباتي، وتشتهر بكثرة مزارع النخيل في رؤوس الأودية، وإنتاج العسل. وما زاد جبل رضوى شهرة كونه مضرباً للأمثال حيث كانت العرب تقول في أمثالها: أبلغ من سحبان وائل، وأخطب من قس بن ساعدة، وأكرم من حاتم طيء وأثقل من رضوى. لقد أخذ جبل رضوى نصيبه من الشعر قديما وحديثا ومنها قول كثير عزة:     ولو وزنت رضوى الجبال بحلمه       لمال رضوى حلمه ويرمرم",
                    R.drawable.radwa,
                    "منطقة المدينة المنورة"),


                LocationMarker(
                    24.08583,
                    46.16333 ,
                    "جبل طويق",
                    "جبل طويق عبارة عن هضبة ضيقة من الصخر الجيري ويمتد لما يقارب 800 كلم من صحراء نفود الثويرات في الزلفي شمالًا وحتى مشارف وادي الدواسر والربع الخالي جنوبًا على شكل قوس (أو «طوق» لأنه يطوّق ويحيط بمنطقة واسعة) يتجه طرفاه نحو الغرب. وتنحدر السفوح الشرقية لطويق بشكل تدريجي، بخلاف الجانب الغربي الذي ينقطع بشكل مفاجئ، وتنحدر على جانبه الشرقي عدة أودية أشهرها وادي حنيفة الذي تقع على ضفافه مدينة الرياض، كما تشقّه بشكل كامل من الغرب إلى الشرق أودية مثل وادي نساح ووادي الأوسط وشعيب لحاء. ويقام الآن مشروع كبير في القدية مرتبط بجبل طويق. يعد جبل طويق واحداً من أكثر المعالم الطبيعية شهرة. اشتهرت جبال طويق باسم نهاية العالم لأنها تتشابه بتضاريسها ومعالمها الجغرافية مع المطل الذي اشتهر في ’’جراند كانيون’’ والموجود في ولاية أريزونا بالولايات المتحدة الأمريكية. تتكون جبال طويق من الحجر الجيري والطين، كما أنها غنية جداً بالأحافير التي تدل على تاريخها العريق وكذلك المتحجرات والشعاب المرجانية والأصداف والأمونايت، وغيرها من الكائنات الحية، وكل ذلك ترسب قبل 160 مليون سنة، لتتحول فيما بعد إلى واحدة من أكبر المصادر النفطية. .يحتوي جبال طويق علي العديد من النقوش الأثرية المنقوشة داخل الكهوف التي تعود إلى أكثر من 5000سنه.كما يضم الجبل العديد من المعالم الإسلامية من أهمها درب أبي الذي تم إقامته في بداية العصر الإسلامي .",
                    R.drawable.towaiq,
                    "منطقة الرياض"),

                LocationMarker(
                    24.487409447422706,
                    46.997068208119906,
                    "دحول عين هيت",
                    "تقع دحول عين هيت في جنوب شرق مدينة الرياض بالقرب من مدينة الخرج، وتعتبر مدخلاً لخزان ماء جوفي واسع يقع على عمق كبير تحت سطح الأرض، وأشهر هذه الحفر هي ’’عين هيت’’، حيث اكتشف الجيولوجيون أول اكتشاف سطحي لصخر الأنهيدريت في المملكة، عندما كانوا في نزهة، ثم زار عدد من مستكشفي الكهوف ’’عين هيت’’ ووصلوا إلى حافة بحيرة تقع على مسافة 120 متراً تحت السطح، وباستخدام أجهزة التنفس استكشفوا الممرات المغمورة بالمياه الصافية.",
                    R.drawable.ainhet,
                    "منطقة الرياض"),


                LocationMarker(
                    26.459790089123846,
                    47.233596147624105,
                    "كهف الطحالب الخضراء",
                    "’’دحل الطحلب أو الدحل الأخضر’’ يعد أحد الروافد الاقتصادية للمملكة وفق رؤيتها 2030 لكونه ثروة وطنية لمعرفة التاريخ الجيولوجي والطبيعي للجزيرة العربية. يقع في الشمال الشرقي من مدينة الرياض، بالقرب من مركز شوية في هضبة الصمّان التي تفصلها عروق رمال الدهناء عن هضبة نجد. يتراوح عمر هذه الكهوف ما بين 55 - 65 مليون سنة. يُعد الدحل الأخضر أحد أهم الدحول الأكثر روعة لجماله الداخلي بالمتدليات والصواعد والكاسيات والإبريات وغيرها، فضلاً عن تميزه ببريق البلّورات الكلسية البديعة ذات الألوان الزاهية التي تنخرط من سقف قاعة الكهف الكبرى مشكلة تكوينات فريدة من نوعها عن سائر الدحول الموجودة في المملكة ’’الدحل متميز نمت على جوانبه نباتات وطحالب في دلالة واضحة على أن الدحل غني بالمياه أو الرطوبة التي تنبعث منه على هيئة بخار ماء’’",
                    R.drawable.green,
                    "منطقة الرياض"),

                LocationMarker(
                    20.15993,
                    44.18501,
                    "مائدة جبال سنامة بوادي الدواسر",
                    "الموائد الصخرية أو ’’الفطر’’ يبلغ عددها في المملكة  أكثر من مائة مائدة وهي عبارة عن تشكيلات صخرية جيومورفولوجية، تنتشر بشكل واسع في منطقة الغطاء الرسوبي وخصوصًا شمال المملكة بسبب انتشار طبقات الحجر الرملي التي يسهل تفتتها مع عوامل التجوية مع بعض الموائد الصخرية في منطقة الدرع العربي. تتشكل الموائد الصخرية عادةً نتيجة تأكل الطبقات الرسوبية بسبب عوامل التجوية والتعرية التي تعرضت لها على مدى ملايين السنوات، والجزء المتبقي من هذه الطبقات يتعرض مجدداً لعمليات التجوية متمثلاً بتجوية الرياح التي تؤثر أكثر في الأجزاء السفلى من الطبقة حيث تبدأ في تأكلها مشكلةً هذه الظاهرة الطبيعية الرائعة. هذه الموائد وخاصة الرملية منها آيلة للسقوط والانهيار في أي لحظة كما حدث لمائدة (فطر) الزميلة مؤخراً، لهذا يتوجب أخذ الحيطة والحذر والاستمتاع بمشاهدتها دون المساس أو الاقتراب منها.",
                    R.drawable.snamh,
                    "منطقة الرياض"),

                LocationMarker(
                    22.57565277671039,
                    46.523759235399496,
                    "جبل التوباد",
                    "يقع جبل التوباد في مدينة الأفلاج جنوب غرب مدينة الرياض وتبعد عنها بمسافة تقدر بـ 350 كم، ويحظى جبل التوباد بشهرة بالغة في السعودية نظراً لأنه دليل وشاهد على قصة حب ليلى العامرية وقيس بن الملوح والتي نشأت في بداية القرن الأول الهجري بين عامي 24 و68 هجرياً ، وهو السبب الرئيس في تسميته بما يُعرف بـ”جبل الحب أو جبل العاشقين ،كما أن جبل التوباد يأخذ شكلاً متدرجاً بالإضافة إلى أنه سهل الصعود، ويبلغ ارتفاعه عن الوادي نحو 20 متراً بينما يمتد طوله 100 متراً. ويوجد في وسط جبل التوباد فتحة صغيرة وهي عبارة عن غار يُعرف بـ”غار قيس وليلى”، ومساحته لا تتعدى الأربعة أمتار، وتحكي القصص التاريخية عن أن قيس وليلى كانا يتبادلان الأشعار في هذا الغار. ومن قصيدة قيس بن الملوح التي ذكر بها اسم التوباد:\n" +
                            "وأجهشت للتوباد حين رأيته             وكبر للرحمن حين رآني\n" +
                            "وكان قيس وليلى يرعيان البهم في سفح جبل التوباد ويذكر ذلك في قصيدته  \n" +
                            "صبيّان نرعى البهم يا ليت أننا          إلى اليوم لم نكبُرْ ولم تكبرْ البهمُ\n",
                    R.drawable.tobad,
                    "منطقة الرياض"),

                LocationMarker(
                    25.456631252769498,
                    46.53794593254467,
                    "وادي الطوقي",
                    "يعد وادي الطوقي (والذي يعرف بشعيب الطوقي) أحد أطول الأودية في المملكة، ويتميز بالطبيعة الجبلية الفريدة، والشلالات الطبيعية، والصخور والأشجار وخاصة أشجار الطلح. يقع وادي الطوقي شمال شرق الرياض، ويمتد بطول 110 كيلو متر، مع انحدار 0.2 ميل لكل كيلو متر، ويبدأ من خشم الطوقي في العرمة وحتى الدهناء. يقع وادي الطوقي وسط وادي العرمة في منطقة بين الرياض ومحافظة حريملاء ومحافظة رماح، ويعد أكبر أودية العرمة، ويبعد عن العاصمة الرياض بمسافة 90 كم. يبدأ وادي الطوقي بالانحدار من قمة الوادي إلى بلدة الرمحية باتجاه الشرق، ثم يمر ببلدة الرماح، حتى يصل إلى روضة الحيرى. يعتبر وادي الطوقي من الأماكن التي تحتوي على الكثير من أشجار الطلح، كما يتميز بشلالات المياه التي تعرف بشلالات وادي الطوقي، ويضم وادي الطوقي وادي العوج ووادي العمياء، وروضة الطافحة، وروضة أبي الحليان، وروضة حميم.",
                    R.drawable.toqy,
                    "منطقة الرياض"),


                LocationMarker(
                    26.52183,
                    43.56406 ,
                    "صخرة عنترة",
                    "تقع صخرة عنترة في مركز غاف في عيون الجواء بمنطقة القصيم .تحتوي واجهة الصخرة على مجموعة من النقوش الثمودية والأشكال الحيوانية المتنوعة وتدل هذه النقوش على الأهمية التي كانت تتمتع بها المنطقة خلال الفترة من القرنين الثاني قبل الميلاد إلى الأول أو الثاني الميلادية. كانت قصيبة (قصيباء) غنية بالمياه حيث أن فيها سبع عيون طبيعية ومنها عين عبس المسماة على القبيلة نفسها. فنزلت قبيلة عبس وفى هذه الأثناء قامت حرب داحس والغبراء مما أدى إلى بقاء القبيلة 40 عاما .تعد صخرة عنترة من شواهد قصة حياة عنترة وابنة عمه عبلة التي دارت فصولها بين صخرتين عرفتا بهذين الاسمين، و تقعان في الطرف الشمالي لمركز غاف الجواء، حصاة النصلة وهي كتلة صخرية كبيرة تتميز بجمالها الجذاب وتتسم بالشكل المخروطي الذي تشكل بسبب العوامل الجوية والرياح. وتعد الصخرة من أبرز المواقع على المسار السياحي المعتمد في منطقة القصيم. وارتبطت الصخرتان بعنترة بن شداد الفارس المشهور بتلك المنطقة آنذاك قبل الإسلام، والذي عرفه العرب فارسا وشاعرا فذا، ولقد ذكر عنترة مواقع بالقصيم ومنها عيون الجواء بالذات، ومنها قوله في أحد الأبيات :’’ولقد حبست بها طويلا ناقتي.. أشكو إلى سفح رواكد جثّمِيا دار عبلة بالجواء تكلمي.. وعمي صباحا دار عبلة واسلمي’’",
                    R.drawable.antra,
                    "منطقة القصيم"),

                LocationMarker(
                    26.78831,
                    43.46728,
                    "جبل الحصان",
                    "يقع جبل الحصان في شمال منطقة القوارة أحد مراكز منطقة القصيم.حيث تبلغ مساحته 0.20 كيلومتر، ويبلغ ارتفاعه 2200 قدم عن سطح البحر.",
                    R.drawable.hourse,
                    "منطقة القصيم"),


                LocationMarker(
                    18.03617,
                    42.85958 ,
                    "قرية الحبلة",
                    "تعتبر منطقة الحبلة من أهم مناطق الجذب السياحي في منطقة عسير، حيث أنها تتميز بالقطوع العمودية الطويلة في الجبال، وتتواجد على ارتفاع يزيد عن 2000 متر فوق سطح البحر، ويتم الأفراد من الرؤية من أعلى القطع لقرية الحبلة القديمة، ويتميز المنتزه السياحي بروعة الأجواء فيه وخاصة بعد سقوط الأمطار التي تزيد من جذب أنظار السياح، ومنتزه الحبلة هو أحد المنتزهات الكبرى التي تقع في منطقة عسير جنوب غرب السعودية، ويبعد 50 كيلو متر عن مدينة أبها. الحبلة هي قرية آثرية وتراثية وسياحية ، وكان أصلها قرية عتيقة بُنيت منازلها من الحجارة وأسفل جرف صخري ينحدر 300 متر من حافة جبال السروات ذات الارتفاع الشاهق، والذي يتجاوز ألفي متر عن سطح البحر، وهذا يجعلها تبدو وكأنها قرية مُعلقة. يرجع السبب وراء تسمية حبلة بهذا الاسم إلى قرية الحبلة الواقعة بالقرب من المنتزه بمركز الواديين، وكان السكان فيها يستخدمون الحبال كوسيلة للتنقل ونقل البضائع والمؤن، وذلك لصعوبة تضاريس تلك المنطقة، ولكن في الوقت الحالي أصبحت المنطقة بلدة نموذجية متكاملة الخدمات، وتوجد بها وسيلة النقل بالكابلات للسياح وكافة زائري المكان.وقيل أن السبب أيضًا وراء تسميتها بهذا الاسم نسبة إلى العالم ابن سنان الحلبي، وتعتبر بلدة قديمة لا يوجد أقدم منها، وتحوي على آثار تلد على قدمها ومنها الجامع العمري الذي يقع شرق البلدة ومقام يحوي مسجدًا صغيرًأ وساحة تضم رفات بعض المجاهدين من أيام الفتح الإسلامي، بالإضافة إلى ذلك فأنه يوجد بها آثار لقبور نصرانية محفورة في الصخر منذ أيام الحكم الروماني.",
                    R.drawable.hablah,
                    "منطقة عسير"),

                LocationMarker(
                    18.10335,
                    41.69648 ,
                    "الأعمدة البازلتية",
                    "أحد أبرز المواقع المميزة في عسير الأعمدة البازلتية في وادي يعوض في محافظة الحرجة، وقرية دبسا في محافظة البرك بمنطقة عسير. وتُعد هذه إحدى الظواهر الطبيعية العديدة التي تتميز بها منطقة عسير في السعودية. وتشكلت الأعمدة البازلتية في أعقاب ثوران البراكين، حيث بردت حممها، وانكمشت، وتشقّقت متّخذة أشكالًا هندسية بأضلاع خماسية، وسداسية، وسباعية. وتختلف ألوان الأعمدة وفقًا للعناصر المعدنية والكيميائية الموجودة فيها، ويغلب عليها اللون الأسود، ومنها ما يميل إلى اللون الرمادي والبني المائل للحمرة. وتحتضن منطقة عسير أكثر من موقع لهذه الأعمدة، بحسب ما أوضحه آل مقبل، ويُعد أشهرها جبل مشرف في محافظة الحرجة، وكذلك وادي العسران، والمنطقة الساحلية الواقعة بين القحمة والبرك. وتنتشر هذه الظاهرة في عدد من بقاع العالم، مثل بوابة العمالقة على ساحل أيرلندا، ومنتزه يلوستون الوطني في الولايات المتحدة، كما تتواجد أيضًا في تركيا وأيسلندا.  الأعمدة البازلتية تقع ضمن سلسلة الجبل الأسود كما وصفها الهمداني في كتابه صفة جزيرة العرب، والتي تُعرف باسم سراة جنب، وهي سلسلة تمتد لمسافة 80 كم تقريبًا من شمال ظهران الجنوب حتى شمال سراة عبيدة، وتسمى تلك السلسلة عند هيئة المساحة الجيولوجية السعودية باسم حرة السراة، وهي حَرّة تقع في السعودية، ضمن نطاق منطقة عسير الواقعة جنوب غرب السعودية. وتبلغ مساحة الحَرّة 700 كم2، ويقع بها جبل فِرْواع الذي يرتفع نحو 3004 م، وجبل ظلم بارتفاع 2575م.",
                    R.drawable.columns,
                    "منطقة عسير"),


                LocationMarker(
                    18.97017,
                    42.14545 ,
                    "جبال تنومة",
                    "تقع «تنومة» شمال منطقة عسير على الطريق الواصل بين مدينتي الطائف وعلى بعد 150 كيلومتراً من مدينة أبها، ويمتد إقليم تنومة الجغرافي من الشمال إلى الجنوب بعرض يبلغ حوالي 25 كيلومتراً، ومن الشرق إلى الغرب بطول حوالي (80) كيلومتراً. وتنقسم مرتفعات تنومة  إلى مرتفعات جبلية شرقية، وتتكون من سلسلة جبال منعا، وجبل عكران، وجبل الجَرداء، وجبل الفَرش، وفي شمال الإقليم جبل لـنـبـش، وجبل غلامه ثم مرتفعات غربية، وتتكون من عدة جبال متناثرة بعطان، والمنامة، وجبل عبدالله، وجلالة، والفطحاء، والقضية، والطويلة، والحمام، وجبل عيسى، وجبال آل سودة، وجبل مَومَة في الجهة الشمالية الغربية من تنومة. و»منعا» سلسلة جبال ضخمة سميت بهذا الاسم لأنها منيعة وحصينة وذات تضاريس صعبة لا يستطيع تجاوزها والتأقلم معها إلا أهلها الذين خبروها منذ مئات السنين، وتتكون هذه السلسلة من مجموعة من الجبال المتصلة التي تشكل في مجموعها جزءاً من سلسلة جبال السروات، وتمتد من الجنوب إلى الشمال، وتعرف أعلى قمة في هذه السلسلة باسم جبل (طلا)، وتحيط بهذه القمة القرى القابعة على سطح هذه السلسلة الجبلية والتي تشار على امتدادها، ومن هذه القرى عتمة، وترتـع، وآل سيّارة، وآل رزيق، والبطن. ويتميز «جبل عـكـران» بكثرة التراكيب التي يضمها حيث يشكل كتلة صخرية ضخمة بارتفاع شاهق، وينفرد بتكوينه الصخري الضخم، وكهفه الكبير الذي يطل على الجهة الغربية من الجبل، ويعد الجبل من عوامل الجذب السياحي والتراثي في تنومة، حيث تنساب من أعاليه شلالات الماء العذب وخاصة أثناء هطول الأمطار الموسمية في الصيف، في منظر أخاذ يتوافد على مشاهدته وتوثيقه مئات الزائرين كل يوم، ثم يكتسي بعد ذلك بالرداء الأخضر. وتختزن جبال تنومة كغيرها من سلسلة جبال السروات الكثير من الكنوز الطبيعية المتمثلة في المعادن النفسية، إضافة إلى تميزها التجاري والتراثي منذ مئات السنين نظراً لوقوعها على ما كان يعرف بـ»طريق الحاج اليمني»، مما أسهم في نشاطها الاقتصادي المعروف قديماً حيث كان يتم التبادل التجاري مع الحجاج وخاصة في المؤن الأساسية كالحبوب والملابس والقهوة.",
                    R.drawable.tanoma,
                    "منطقة عسير"),

                LocationMarker(
                    18.15167,
                    41.53667  ,
                    "جزيرة كدمبل",
                    "تُعد جزيرة كدمبل الواقعة على ساحل منطقة عسير إحدى الجزر التابعة لمركز القحمة، من أجمل الجزر الطبيعية البكر التي تنتظر مستقبلاً واعداً في ظل التنمية الشاملة التي تشهدها مناطق المملكة، وسط تطلعات لأن تكون وجهة سياحية دائمة طوال العام، نظير ما تتمتع به من شواطئ بكر، وطبيعة ملائمة لهواة الصيد والسباحة والغوص. وتتميز «جزيرة كدمبل» برمالها البيضاء الملتفة حولها من ثلاث جهات، ويبرز جبلها الشامخ واقفاً كفوهة البركان في جهتها الغربية، حيث تتربع الجزيرة على مساحة تقارب ثلاثة كيلومترات مربعة. ويستطيع الزائر للجزيرة الوصول إليها في مدة تقدر بـ 30 دقيقة عبر قوارب الصيد، ليشهد خلالها الشواطئ الهادئة والمياه الصافية، التي عادة ما يُمَارِس فيها هواة السباحة والغوص رياضاتهم المفضلة، بالإضافة إلى تميزها بأنها الوجهة المفضلة لهواة صيد الصقور المهاجرة التي تحط رحالها بعد هجرتها الشاقة من القرن الأفريقي على قمة جبل كدمبل. تحتضن الجزيرة الساحرة مجموعة من المناطق الجميلة، وأبرزها 4 مواقع طبيعية على ظهرها وهي الركائز الصخرية، ركائز الرمال، المناطق البحرية والترابية الناعمة ايضًا، الإضافة إلى وجود سجل أولي بالطيور وفصائلها والتي تعيش على متن الجزيرة، بالإضافة إلى مواقع أثرية أخرى ، وهي عبارة عن مجموعة مقابر إسلامية 20 قبرًا، تأخذ طول يصل إلى 2.5 متر تقريبًا. تعيش على ظهرها مجموعة من الطيور النادرة والمهاجرة، ومجموعة من الكائنات البحرية المتميزة، يتمكن السائحون أثناء سيرهم في الطريق من محافظة «القمحة» إلى «الشقيق»، من رؤية جبل كدمبل، وجبل آخر يقُال له جبل الميغا، ويظهر وكأنه محفور بسبب عوامل الأثر الذي تركته فيه عوامل التعرية والتآكل الطبيعية..",
                    R.drawable.kadmbl,
                    "منطقة عسير"),

                LocationMarker(
                    19.93108, //wrong
                    42.689222  ,
                    "جبل الصايرة ( الجيل الجليدي)",
                    "يعتبر جبل الصايرة من أهم وأجمل المعالم في بيشة، حيث أنه يختلف عن الجبال المحيطة به التي يكسوها اللون الأسود، فهو يتميز بلونه الأبيض الذي ينتشر فيه بعض الأحجار الملونة. جبل الصايرة من الجبال الرسوبية الطبقية المشار إليها في القرآن بالجُدد البيض، وتُصنف أيضاً على أنها صخور حامضية وفوق الحامضية. يعد جبل الصايرة من أجمل المعالم السياحية البارزة في بيشة لشكله ولونه النادر، إذ يُخيل للناظر إلى الجبل من بعيد أنه أمام كتلة من الجليد الأبيض اللامع، بل ويقف الجبل على أرض تعلوها الهضاب والجبال الصغيرة، متوسطًا مجموعة من جبال بيشة السوداء والحمراء. لذا يقصده الزوار بحثاً عن الراحة والاستجمام والمغامرة لتسلقه، لما يتمتع به الجبل الجليدي من لون مميز وارتفاع شاهق يبلغ 1438 متراً جعل منه معلماً بارزاً ومتنزها مميزا منذ مئات السنين تتكون حجارته من أحجار المرو التي تحتوي على معدن الكوارتز المستخدم في صناعة الزجاج. ",
                    R.drawable.saira,
                    "منطقة عسير"),

                LocationMarker(
                    18.05113719186886,
                    42.73239412262803,
                    "جبل السودة",
                    "يقع جبل السودة في المنطقة الجنوبية الغربية من المملكة ويبعُد حوالي 20 كيلومترًا عن مدينة أبها، جبل السودة يعتبر واحد من أشهر جبال المملكة ويحتل جبل سودة المرتبة الأولى كأعلى قمة جبلية بالمملكة حيث يصل ارتفاع جبل السودة ابها إلى 3015 متراً فوق مستوى سطح البحر ويُعد وجهة سياحية بامتياز من الطراز الأول كأحد أهم جبال المملكة.  التنوع البيئي الكبير يعمل على جذب السائحين، إذ يحتوي جبل السودة على مجموعة كبيرة من أشجار العرعر وأصناف النباتات، والأزهار، والحيوانات. وتتميز أجواءها بالبرودة صيفاً وتتساقط عليها الثلوج في فصل الشتاء، وتضم المنتزه الوطني الذي يعتبر وجهة سياحية رائعة للتخييم وهواة المشي والتسلق الجبلي.",
                    R.drawable.soda,
                    "منطقة عسير"),

                LocationMarker(
                    18.202807822452655,
                    42.824430246419524,
                    "مدينة جُرش",
                    "تقع مدينة جُرش الأثرية بين جبل حمومة الأثري وجبل شكر بمحافظة أحد رفيدة على بعد ١٥ كيلاً جنوبي محافظة خميس مشيط، و يتصف الموقع بأنه مستطيل الشكل، وتمتد على طول الموقع من الجنوب إلى الشمال تلال أثرية، تتركز كثافتها في المنتصف، وفي الجهة الشرقية توجد بالموقع جدران ذات صخور مشذبة وكبيرة الحجم، يصل طولها إلى ٨٠ سم وعرضها إلى ٦٠ سم، و تشابه ضخامة الجدران بالموقع وأسلوب بناؤها لما هو موجود في موقع الأخدود بمنطقة نجران. يحتوي الموقع على بقايا مبان ضخمة بعضها من الحجارة وأخرى من الطين، كما تضم معثورات يعود تاريخها إلى فترة ما قبل الإسلام والفترات الإسلامية المتعاقبة وصولاً إلى القرن الحادي عشر الميلادي، حيث ظهرت دلائل على الاستيطان خلال الفترة العباسية في شمال ووسط الموقع، أما في جنوب الموقع فهناك دلائل على الاستيطان خلال الفترة الإسلامية الوسيطة والمتأخرة. تقع جرش على طريق الحج القادم من اليمن، وقد اشتهرت بصناعاتها الجلدية والحربية ومن ضمنها المنجنيق والعرادات ، ودخلت جُرش الإسلام في السنة العاشرة من الهجرة.",
                    R.drawable.jorash,
                    "منطقة عسير"),


                LocationMarker(
                    17.270841258966634,
                    43.21709816048174,
                    "العيون الحارة بالخوبة",
                    "تحتضن مناطق المملكة نحو 12 عينا كبريتية، وتعدّ مقصدا سياحيا وعلاجيا في الوقت ذاته، لفوائدها في علاج كثير من الأمراض،  هناك كثيرا من العيون الكبريتية في المملكة بشكل عام، وفي منطقة جازان بشكل خاص، أبرزها 3 عيون، الأولى: في العارضة، والثانية: في بني مالك، أما الثالثة: فهي في الخوبة، ويوجد غيرها، ولكن هذه العيون الثلاث هي الرئيسية، إذ يتردد عليها كثير من السياح، سواء من داخل المملكة أو خارجها. تقع ينابيع الخوبة على بعد 75 كلم من وسط مدينة جيزان وهي تتميز بمياهها الساخنة المناسبة للعلاج الطبيعي. تصل درجة الحرارة  في المياه إلى 45 درجة مئوية وهي تحتوي على 14 مادة كيميائية ومعدنية. يوفر لك الموقع فرصة القفز والسباحة في المياه الدافئة للاستفادة من المعادن الطبيعية الموجودة في داخلها.  تتدفق مياه العين الحارة من عدة عيون دائمة الجريان، حيث تشكل بدرجة حرارتها العالية وموادها الكبريتية علاجًا لكثير من الأمراض الجلدية وأمراض الروماتيزم مما جعلها مقصدًا للزوار على مدار العام ويزيد موقع العين الحارة جمالًا تدفقها من سفح مرتفع يطل على وادي خلب الشهير وأحد أكبر الأودية بالمحافظة الذي يمر بالعديد من القرى شاقًا طريقه بين الأراضي الزراعية ليمنحها جمالًا ومتعة للناظرين",
                    R.drawable.ainkoba,
                    "منطقة جازان"),


                LocationMarker(
                    17.60442,
                    42.93065 ,
                    "وادي لجب",
                    " هو صدع وانكسار في الجزء الشرقي من جبل القهر (زهوان) التابع لمحافظة الريث التي تقع على بعد 150 كيلومتراً إلى الشمال الشرقي من مدينة جيزان. يعتبر من أهم المواقع السياحية وأبرزها ومزاراً يؤمه الزائرون من أبناء المنطقة وغيرها من مناطق المملكة على مدار العام، ويشهد وادي لجب بمحافظة الريث كغيره من المواقع السياحية بمنطقة جازان إقبالاً متزايداً من قوافل الزوار من داخل المنطقة وخارجها.  يرجع تاريخ الوادي لعصر حدوث الانكسار الأفريقي حيث ظهرت جبال ناهضة ذات صخور شديدة الصلابة تختلف عما جاورها من الجبال من حيث التركيب الصخري واللون وهو ما يلحظه الزائر للوادي ذلك الفرق الواضح بين الجبال المطلة على وادي لجب ما يضفي نوعاً من التميز على الجبل وتفرداً واضحاً من حيث الشكل بين الجبال المجاورة له. ويمتد وادي لجب على شكل أخدود أو صدع انكساري في الطرف الشرقي من جبل «القهر» بطول يصل لنحو 11 كيلو متراً تقريباً متجهاً من الشمال إلى الجنوب ليتقابل هذا الصدع بعد ثلاثة كيلومترات بصدع آخر يمتد لمسافة 2 كيلو متر. يعد وادي لجب ظاهرة جغرافية نادرة جدا، فهو ليس وادي بالمعنى الذي ينطبق على مختلف الوديان، إلا أنه شق أو صدع في الجزء الشرقي من جبل القهر زهوان، وهو جبل تابع لمحافظة الريث، ولا يتجاوز عرض وادي لجب أربعة أمتار، أما طوله فيبلغ 11 كم تقريبا، يسير اتجاهه من الشمال إلى الجنوب، وتتميز جوانبه بالارتفاع ولا يمكن لأحد تسلقها حيث تتجاوز الـ 800 متر، ويتميز مدخل هذا الوادي بعدد كبير من الينابيع الدائمة الجريان، مما يجعل هذه المنطقة غاية في الجمال .",
                    R.drawable.lojb,
                    "منطقة جازان"),


                LocationMarker(
                    16.71167,
                    42.00000,
                    "جزيرة فَرَسان",
                    "جزيرة فرسان هي أرخبيلٌ من الجزر الواقعة في الجهة الجنوبيّة من البحر الأحمر والتابعة لمنطقة جازان في الجنوب الغربيّ من المملكة، تبعد عن جازان قرابة 40كم، كما تقع على خطّ طول 41.7 باتّجاه الشرق وخطّ عرض 16.7 باتّجاه الشمال، وتبلغ مساحة أرخبيل الجزر قرابة 1050كم2، حيث يضمّ العديد من الجزر التابعة له والتي يُقدّر عددُها بـ150  جزيرةً، كما يبلغ طول شواطئه ما يقارب 300كم .تأثّرت جزيرة فرسان بمرور العديد من الحضارات عليها، ومنها: البرتغاليّون والعثمانيّون، وهذا واضحٌ في الآثارٍ العديدة التي لا تزال موجودةً حتى وقتنا الحاليّ، ويُقال إنّها تعود إلى عهد مملكة حمير، وما كان ذلك إلا لأنّها كانت محطّةُ التقاءٍ واستراحةٍ للقوافل التجاريّة التي مرّت فيها، وعندما وصل العثمانيّون إلى البحر الأحمر جعلوها بحيرةً عثمانيّةً، وبناءً على ذلك استطاعوا السيطرة عليها في القرن السادس عشر الميلادي، تحديداً في سنة 1538م. تتألّف جزيرة فرسان من العديد من الجزر، وأبرزها: جزيرة فرسان، وزفاف، ودمسك، والسقيد، وقماح، وكيرة، وسلوية، كما أنّها تضم العديد من الآثار ومن أشهرها: قلعة العثمانيّة، والمسجد النجديّ، ومباني غرين، ووادي المطر، وبيت الرفاعي، وبيت الجرمل، وبيت الكدمي، وقلعة لقمان، والعرضي.تتميّز جزيرة فرسان بالتنوع البيولوجي المذهل، حيث تضم في شواطئها مجموعة كبيرة من الشّعاب المرجانية، والأسماك، والطيور، مثل النورس، والزقزاق، والسلطعون، وكذلك مجموعة كبيرة من الحيوانات البريّة، مثل غزال فرسان المهدد بالانقراض، والصقر الصخري، ويجدر الذكر أنّ الجزيرة تُعد من المناطق المحميّة من قِبل الهيئة السعودية لحماية الحياة الفطرية منذ عام 1996. المناخ يُعتبر المناخ في جزيرة فرسان جاف وشبه استوائي، ويتميز بانخفاض معدل هطول الأمطار السنوي وارتفاع متوسط درجات الحرارة السنوية.",
                    R.drawable.farasan,
                    "منطقة جازان"),

                LocationMarker(
                    17.741230296084126,
                    43.00296300918829,
                    "جبال فيفا",
                    "تقع جبال فيفا في أقصى الجنوب الغربي من المملكة شرق منطقة جازان و التي تبعد عنها حوالي 125 كم ، عبارة عن مجموعة من الجبال الملتفة حول بعضها تبدو من بعيد كجبل واحد هرمي الشكل ، و لذلك يطلق عليها جبل أو جبال ، و هي ترتفع عن سطح البحر حوالي 7 آلاف قدم ، و مساحة الجبل حوالي 600 كم2 ، المنطقة بها سلسلة من القمم المتفاوتة في الارتفاع ، أشهرها قمة العبسية ، و هي على شكل قوس من الشمال للجنوب ، وتتميز جبال فيفا بالأجواء المعتدلة ودرجات الحرارة المتوسطة على مدار العام، كما أنه يشتهر بطبيعة الجميلة المليئة بالوديان ذات المساحات الخضراء الواسعة. كما تضم جبال فيفا عدد من المدرجات الزراعية التي يوجد بها نباتات زراعية خضراء تعطي الجبال مظهر مختلفاً. ويعد موقع «سماع» من أجمل المواقع في جبال فيفاء وأشهرها، حيث تستطيع من خلاله أن تطل على بقعة «العذر» ذات المناظر الساحرة.",
                    R.drawable.fifa,
                    "منطقة جازان"),

                LocationMarker(
                    27.229629511423955,
                    38.57167006038897,
                    "صخرة تيماء",
                    "تقع صخرة أو حصاة النصلة جنوب تيماء بحوالي 70 كيلومتراً وسميت ’’النصلة’’ بهذا الاسم لأنها نصلت أو انفردت عن الجبال القريبة منها. ويتجاوز عمرها 400 مليون سنة، وهي عبارة عن حصاة يبلغ طولها تقريبا 8 أمتار شطرت بفعل الطبيعة، وتمثل كتلة صخرية ضخمة مقسومة إلى نصفين بشكل شبه هندسي، وتتسم بالشكل المخروطي الذي تشكل بسبب العوامل الجوية والرياح. وتتربع على قاعدتين تحملان الصخرتين، فهناك القاعدة الصغيرة في الجهة اليسرى، وهي ضعيفة، والقاعدة الكبرى في الجهة اليمنى وهي القوية، ويوجد عدد من الرسوم لأشكال حيوانية متنوعة والنقوش الأثرية الثمودية والتي يعود تاريخها إلى ما يقارب 3000 عام. ويرى بعض الجيولوجيين أن السبب الرئيسي لانشطار الصخرة يرجع الى ’’زحزحة’’ الجانب الأيسر، وهو الأضعف قليلا، مما تسبب في هذا الانشطار الدقيق. والدليل على قدم حدوث الانشطار أنه لا توجد رسمة في جهة الصخرة اليمنى متصلة بالجهة اليسرى، بل كل جهة لها رسوماتها منذ أن بدأ الإنسان القديم في الرسم عليها. بينما يعزى جيولوجيون اخرون إن انقسام الصخرة قد يكون ناجما عن عملية تدعى التجميد والذوبان، وتحدث عندما يتسرب الماء باستمرار إلى الشقوق ويتجمد ويتوسع، مما يؤدي في النهاية إلى كسر الصخرة.",
                    R.drawable.taima,
                    "منطقة تبوك"),


                LocationMarker(
                    27.60218,
                    36.42043 ,
                    "وادي الديسة",
                    "يقع وادي الديسة في منطقة تبوك، في شمال غرب المملكة العربية السعودية، وهو يعدّ من أشهر الأودية في المملكة، ومن أبرز وأجمل المعالم السياحية الطبيعية في المنطقة. وكلمة الديسة في الحجاز تعني الوادي الكثيف النخل، وهو يُعرف أيضاً باسم وادي دامة أو وادي قراقر. يجذب هذا الوادي الزائرين لما يتميز به من مناظر طبيعية فريدة، وهدوء، وهواء نقي. يقع الوادي على بعد حوالي 220 كم جنوب مدينة تبوك عند مضيق جبلي يقع بين جبال قراقر. فتخترقه الجبال التي تتخذ شكل الأعمدة والتي نحتتها عوامل الزمن، فبدت وكأنها قصور شامخة، وتحتها مجموعة كبيرة من الأشجار، بما في ذلك أشجار النخيل، والريحان، وأشجار الحمضيات. ويمتد بينها وادٍ عميق تنبع منه المياه الشديدة العذوبة. ند وصولك الى الموقع سيبهرك حتماً مشهد الجبال الحمراء المنتصبة على جانبي الوادي، فتعتبر جبال قراقر الحمراء الشاهقة الارتفاع (بين 450 إلى 1750م) والتي تشبه بتصميمها القصور من أجمل مناظر الوادي وأكثرها سحراً. وهي تزداد جمالاً في فترة بعد الظهر لأن لونها يميل حينها للاحمرار الغامق. يتميز الوادي أيضاً بمنطقة تُعرف باسم العين الزرقاء، حيث تصبّ فيها المياه النقية والصافية من ينابيع مختلفة. مصدر أحد الينابيع الموجودة في وسط الوادي غير معروف وهو يتدفق من بقعة صخرية.",
                    R.drawable.desa,
                    "منطقة تبوك"),

                LocationMarker(
                    27.94278,
                    34.56667 ,
                    "جزيرتا تيران وصنافير",
                    "تعد جزر المملكة، إحدى أهم معالم الجذب السياحي حيث تضم مياه المملكة المئات من الجزر المبعثرة في مختلف واجهتها البحرية، حيث تمتد السواحل والواجهات على مساحة تزيد عن 3800 كيلو متر. تعتبر بعض هذه الجزر مشاريعاً سياحية يتم العمل على تطويرها لجعلها الوجهة السياحية الأولى ضمن أهداف رؤية المملكة 2030. تعود مجموعة من هذه الجزر بالمنافع الاقتصادية لثرواتها الطبيعية من اللؤلؤ والمرجان، كما تم تحويل عدد منها إلى محميات طبيعية وبحرية للحفاظ على معالم الحياة الطبيعية فيها من النباتات أو الحيوانات البحرية المحيطة بها. تقع جزيرة صنافير، التي تبلغ مساحتها 33 كم2، شرق مضيق تيران الذي يفصل البحر الأحمر عن خليج العقبة، بينما تقع جزيرة تيران، التي تبلغ مساحتها 80 كم2، في مدخل المضيق، وهما من أكثر الجزر جذباً للسياح على مستوى العالم، وتتميزان بصفاء مياههما، وبوجود الجزر والشعاب المرجانية العائمة، إضافة إلى الأسماك الملونة والنادرة، وسلاحف بحرية مهددة بالانقراض مثل السلاحف الخضراء، وعدد من الطيور النادرة مثل طائر العقاب «الأوسبرى» ما يجعلهما مقصداً سياحياً من الدرجة الأولى، حيث يفد إليهما السائحون من أنحاء العالم لممارسة الرياضات المائية مثل رياضة الغوص، والاستمتاع بمناظر البحر الخلابة من خلال الرحلات السياحية عبر اليخوت. تكمن أهمية جزيرتي تيران وصنافير في موقعهما الإستراتيجي المهم، حيث تتحكمان في مضيق تيران لإطلالتهما عليه، والساحل الشرقي لسيناء وبالتحديد منطقة شرم الشيخ، إضافة إلى رأس الشيخ حميد الذي يقع في الساحل الغربي لمنطقة تبوك، وفي مدخل خليج العقبة بالأردن. كانت المنطقتان قديماً نقطة للتجارة بين الهند وشرق آسيا، والمنطقة الواقعة بين شرم الشيخ وجزيرة تيران تعد المضيق الوحيد الصالح للإبحار في منطقة خليج العقبة، ولا يمكن للسفن الإبحار بين تيران وصنافير لعدم صلاحية عمق المياه للمرور.",
                    R.drawable.teran,
                    "منطقة تبوك"),

                LocationMarker(
                    26.250962,
                    37.214550 ,
                    "جبل الغلالة",
                    "جبل الغلالة يقع ما بين محافظة العلا، ومحافظة تيماء، الذي يتميز بشكله الفريد وتركيبته العجيبة، حيث كان مُستراحَاً للمسافرين قديماً، لاحتوائه على مجموعة من التجاويف، والغيران ولكل غار إطلالته الرائعة، وظلاله الوارفة. وورد مسمى جبل الغلالة في قصص وأشعار العرب قديماً، ومن ضمنهم جميل بثينة، الذي ذكره في ديوانه الشعري من خلال الأبيات التالية: \n" +
                            "فَلَما طَلعنَ ذا الغِلالَةَ وانتَحت   بِهنَّ الحُداةُ في خَويٍّ لَه سَهلُ\n",
                    R.drawable.galala,
                    "منطقة تبوك"),

                LocationMarker(
                    28.645890609583006,
                    35.28609046334625,                    "جبل اللوز",
                    "يقع جبل اللوز شمال غرب المملكة على بعد حوالي 200 كم شمال غرب مدينة تبوك. ويبلغ ارتفاعه 2549 متر فوق سطح البحر ويعتبر من أعلى السلاسل الجبلية في منطقة حسمى التي تعد جبالها امتداداً لجبال السروات من غرب تبوك حتى وادي رم بالأردن، ويسمى بجبل اللوز لوجود شجر اللوز به قديما، وتنتشر بالمنطقة الرسوم الصخرية التي يرجع تاريخها حوالي 10.000 سنة قبل الميلاد، بالإضافة إلى النقوش القديمة والكتابات الإسلامية، كما وتتساقط عليه الثلوج أحيانًا في فصل الشتاء وأحيانًا في فصل الربيع إذا حصل منخفض جوي ويعد من أفضل الجبال للقيام بالأنشطة الشتوية في السعودية، إذ يكتسي بالثلوج البيضاء. ",
                    R.drawable.loza,
                    "منطقة تبوك"),


                LocationMarker(
                    22.901400236646616,
                    41.139195892201144,
                    "مقلع طمية",
                    "مقلع طمية أو فوهة الوعبة عبارة عن حفرة عميقة في الأرض بقطر دائري يبلغ 3 كيلومترات وبعمق 380 مترا، وهي الأكبر من نوعها في الشرق الأوسط. ويوجد في أطرافها الجانبية مساحة خضراء من النباتات البرية، وعدد من أشجار النخيل وشجر الدوم، وفي اسفل الفوهة يوجد شلال صغير تشكل من هطول الامطار بالمنطقة.نجمت الفوهة عن حدوث بركان، والفجوات المحيطة نتيجة للانفجارات البركانية ، ويعود سببها ملامسة المياه الجوفية مع الحمم الساخنة. تقع الفوهة على بعد 254 كم من مدينة الطائف عند خط عرض 25.604167 درجة شمالا، وخط طول  42.000278 درجة شرقا. وهي من براكين حرة كشب المشهورة منذ القدم في وسط شرق الدرع العربي وهي نتاج مقذوفات البراكين المتعددة هنا، وقد تكون أعمق من وضعها الحالي ولكن عوامل الرياح والأودية التي تحمل الطين والطمي كانت تصب فيها على مر السنين وتقذف المياه المحملة بالتربة في وسطها ويصعب تسربها إلى باطن الأرض بسبب ذرات الطمي الدقيقة وبفعل الشمس والحرارة الشديدة في عمقها كانت المياه تتبخر وتترك الأملاح المتعلقة بها فتشكلت في وسطها بقعة بيضاء من الملح جوانبها أشد بياضا من وسطها. وتشكل البقعة البيضاء شكلا دائريا جمالا يسطع مع أشعة الشمس. وبالطبع فالفوهة ليست دائرية بشكل دقيق ، وإنما لوحظ أن قطرها الشمالي - الجنوبي ، أطول من قطرها الشرقي - الغربي ، وحواف الحفر شبه عمودية ، إلا أن جزء من شماليها الشرقي ، يتدرج مكونا رفوفا كبيرة.",
                    R.drawable.taimaa2,
                    "منطقة مكة المكرمة"),

                LocationMarker(
                    19.68333,
                    40.73889 ,
                    "جزيرة أم العود ",
                    "واحدة من بين أجمل الجزر في البحر الأحمر، وفي رأس محيسن بمنطقة مكة المكرمة تقع \"جزيرة أم العود\"، تتميز برمالها البيضاء وسط المسطحات الخضراء الواسعة المتاخمة للشاطئ، وكذلك الشعب المرجانية المتغلغلة في الأعماق، بجانب الأشجار المتنوعة التي يقل ارتفاعها عن المتر تقريبًا. المسافة من رأس محيسن حوالي ساعة داخل البحر الأحمر، يوجد عددٍ من أنواع الطيور الجارحة التي تتغذى على الأسماك، وتميّز الجزيرة بأجوائها الأمر الذي جعل منها معلمًا وأيقونة للسياحة.الجزيرة تُسمى ’’جزيرة أم الغرانيق الشمالية’’،  حيث يأتي تصنيفها بجزيرة مرجانية واقعة شمال غرب رأس محيسن بمساحة بلغت نحو 1.2 كيلومترًا مربعًا، وهي جزيرة تمتد طوليًا من الشرق إلى الغرب على هيئة قوس طرفاه نحو الجنوب، مع اتساع في وسطها، يبلغ أقصى طول لها نحو 2.9 كيلومترًا .، أن ارتفاع سطح الجزيرة يعلو مستواه عن سطح الأرض بنحو المترين، وتغطيها الرمال في الوسط، وتنمو عليه بعض الشجيرات في حين تغطي أطرافها بعض السباخ وتنمو على سواحلها نبات القرم ’’الشورة’’، حيث تقع في الطرف الشمالي للحاجز المرجاني المحيط ببعض الجزر القريبة منها، وتقع جنوبها بعض الجزر الصغيرة، وتبعد جزيرة أم العود من الساحل بنحو 2.8 ميلًا بحريًا. ",
                    R.drawable.oud,
                    "منطقة مكة المكرمة"),

                LocationMarker(
                    22.233024618325086,
                    43.56957261653297,
                    "جبال الدخول وحومل",
                    "تقع هذه المواقع في منطقة عالية نجد، وبالتحديد في موقع يسمى جفرة الصاقب، عبارة عن جبل شامخ يدعى جبل الصاقب ، أما جبال الدخول وحومل تبعد عن محافظة بيشة ما يقارب 200 كيلو متر شمال غرب، وتقع جبال الدخول غربا عن الجبل «حومل»، وتبعد عنه بعشرة كيلو مترات تقريبا، الجبل (حومل) يشبه في شكله عندما تناظره من (الجنوب) الأسد الرابض، وهو كتلة صخرية ملساء الملمس أسود اللون ، أما الدخول فهي سلسلة (هضاب جبلية تنتهي بالدخول المعروف باتجاه حومل)، وتختلف في لونها عن حومل وتميل إلى الحمرة، وجبال الدخول وحومل ارتبطت تاريخيا بأذهاننا في معلقة امرئ القيس، وهو يردد:\n" +
                            "قفا نبكِ من ذكرى حبيب ومنزل      بسقط اللوى بين الدخول فحومل\n",
                    R.drawable.dakol,
                    "مكة المكرمة"),

                LocationMarker(
                    26.158031346220433,
                    40.26628807405597,
                    "النقوش الصخرية في حائل",
                    "تعتبر النقوش الصخرية في منطقة حائل مصدراً مهماً جداً وتاريخاً للمنطقة، من حيث كونها تسجل النواحي الدينية والاجتماعية خلال العصور التي نفذت فيها تلك النقوش. تعد مواقع النقوش الصخرية في جبة والشويمس من أكبر المواقع الأثرية التي تغطيها أعداد هائلة من النقوش والرسومات الصخرية، وتعد متحفاً مفتوحاً يرصد جزءاً من تاريخ البشرية في مكان ونطاق جغرافي وزمني معين. يعود معظمها يعود للعصر الحجري الحديث – أربعة عشر ألف سنة قبل وقتنا الحاضر. وتصور النقوش الصخرية أشكالاً أدبية في صورة أنشطة مختلفة، كالاحتفالات الدينية الجماعية، أو المعارك الحربية والمبارزات الثنائية، وصوراً للحيوانات البرية التي كان يصطادها ومنها البقر الوحشي والوعول والغزلان والنعام والماعز الجبلي والحيوانات المفترسة؛ من أسود ونمور وغيرها. هذا بالإضافة إلى وجود نقوش أخرى أحدث تعود إلى عصر ما قبل الإسلام تكثر فيها صور الجمال ورسوم القبائل ومناظر الحروب والمبارزات، مع وجود نصوص كتابية مسجلة بالخط المسند الشمالي. ",
                    R.drawable.hail,
                    "منطقة حائل"),

                LocationMarker(
                    28.013155521660654,
                    41.00510084503813,
                    "كهف شعيفان ’’الشويمس’’",
                    "على حافة حرة النار يظهر أهم الكهوف في المملكة وأطولها، وهو كهف شعفان أو شعيفان «الشويمس»، الذي يقع على بعد مسافة 15 كلم شمال غربي الشويمس في جنوب منطقة حائل، وللكهف فوهة ضخمة غطيت باللابة البركانية.  ويعد كهف شعفان من أكبر كهوف المملكة، حيث يبلغ طوله نحو 2 كلم وارتفاعه نحو 8 م، كما يصل عمق الكهف إلى 800 م تحت سطح الأرض، ويتميز بتكوينه التضاريسي المتنوع، فعندما تسير داخل الكهف تجد أسقفاً بارتفاع منخفض لدرجة أنك تضطر إلى الزحف على ركبتيك وفي مناطق أخرى من الكهف تجد سقفه عاليًا فتمشي واقفًا. ويعد الكهف الشهير الذي يقصده الرحالة والمستكشفون في رحلات دورية وعلمية من أميز الكهوف في السعودية وأطولها، وهو مظلم حالك الظلام في النهار حيث يستخدم أهالي الشويمس في حمل الأتاريك التي تعمل على الغاز لإضاءة الكهف المظلم. ",
                    R.drawable.shoimes,
                    "منطقة حائل"),

                LocationMarker(
                    26.57361,
                    50.06667 ,
                    "جزيرة تاروت",
                    "تقع جزيرة تاروت في جنوب ساحل الدمام وشرق محافظة القطيف، وهي تعتبر ثاني أكبر جزيرة في المملكة وإحدى أوسع الجزر الواقعة على شاطئ الخليج العربي. وتحمل جزيره تاروت تاريخًا حافلاً وماضٍ عريق جعلت منها أهمية أثرية وتاريخية ضمن أشهر جزر المملكة والعالم، حيث تعتبر من أقدم الأماكن التي استوطنها البشر منذ 7000 آلاف سنة. ذلك بالإضافة إلى أهميتها التجارية قديمًا حيث كانت تعبر القوافل عبرها. حملت الجزيرة أدلة أثرية تعكس طبيعة الحضارة فيها، ومنها قلعة تاروت أو ما يسمى بقصر تاروت. ويعود أصل اسم الجزيرة إلى كلمة “عشتار” والتي كانت تشير إلى معنى الحب والحرب عند قدماء الكنعانيين والبابليين وغيرهم من الحضارات التي عبرت جزيرة تاروت قديما. عاشت في جزيرة تاروت السعودية العديد من الحضارات، وقد تم اعتبارها مدينة فينيقية ضمن أكثر الأماكن هدوءا في الخليج العربي، ويعكس التاريخ الأثري من عاشوا قديمًا في المنطقة، ويمكن ملاحظة البيوت التي تم تشييدها بالحصى والتي لا تزال معمرة إلى الآن وشامخة منذ آلاف السنين. وقد شهدت المنطقة العديد من الغزوات والمباني التي دلت على ما حصل فيها من حروب، وأهمها قلعة تاروت التي اعتبرت حصنًا مشيداً ضد الهجمات، ويقدر تاريخ هذه الأحداث والمباني بين الأعوام 1515 إلى 1512 ميلاديًا، ",
                    R.drawable.taroot,
                    "المنطقة الشرقية"),

                LocationMarker(
                    27.93056,
                    49.68194  ,
                    "جزيرة حرقوص",
                    "هي إحدى الجزر الواقعة في الخليج العربي، وتتبع المنطقة الشرقية السعودية. تبلغ مساحة الجزيرة نحو 0,03 كم2  وتبعد عن الساحل بحوالي 33,5 ميل بحري. تبعد جزيرة حرقوص المرجانية السعودية عن مدينة الجبيل الصناعية، 80 كيلومتراً بوساطة القارب. وتعتبر من أهم الجزر التي تحتوي على أنواع كبيرة من الطيور البحرية والسلاحف، مع تشكيلات مميزة من المرجان تختلف عما هو متوافر في جزر الخليج الأخرى. كما تستقطب جزيرة حرقوص الصيادين المحبين للطبيعة البكر والمهتمين بالحياة البحرية، لذلك تنطلق رحلات سياحية يومية إلى جزيرة حرقوص والجزر المحيطة بها.",
                    R.drawable.harqoos,
                    "المنطقة الشرقية"),

                LocationMarker(
                    25.412089014897767,
                    49.69267426378437,
                    "كهوف جبل القارة",
                    "سُمِّي جبل القارة نسبةً إلى بلدة القارة التي ينتمي إليها الجبل. وقد سمي أيضاً بالشبعان لكونه في وسط النخيل، قد طوَّقته النخيل والأنهار من جميع جوانبه . سُجّل جبل القارة في الاحساء ضمن لائحة التراث العالمي للعام 2018، ويقال أنه تشكّل قبل 25 مليون سنة، ويصل ارتفاعه إلى 210 متر عن سطح البحر، كما أنه يمتد على مساحة 1000 متر من شماله إلى جنوبه، و800 متر من شرقه إلى غربه. يوجد الجبل بالقرب من بلدة القارة في محافظة الاحساء ، ويشتهر بكهوفه ذات الطبيعة المناخية المتميزة ، فهي ليست مجرد تكويناً صخرياً فريدا ، بل تخالف أجواء الطقس السائدة خارج الجبل فهذه الكهوف باردة صيفا ودافئة شتاء. تبلغ مساحة قاعدته حوالي 14 كيلومتراً مربعاً، ويتكون من صخور رسوبية بلون ضارب إلى الحمرة. يحوي على كهوف معتدلة درجة الحرارة وشبه ثابتة طوال العام في حدود 20 درجة مئوية. ويرافقها جريان تيارات هوائية لطيفة وباردة من داخل المغارة لخارجها.  يتكون جبل القارة من الحجر الرملي الكلسي، والمارل الغريني من متكون الدام ومتكون الهفوف من الميوسين المتوسط. تتكون قاعدة الجبل المنكشفة من طبقة رقيقة من المارل، تعلوها طبقة من المدملكات (الكونغلوميرات) تصل إلى 17 متراً. يليها تتابع من الحجر الجيري الرملي البحيري بسماكة 18 متراً ثم تعلوها طبقات متتابعة بسماكة 75 متر من الحجر الرملي الفتاتي ذو اللون الرمادي الفاتح مع فترات متقطعة من المارل المحمر والمارل الغريني. ينتهي التتابع بغطاء يصل إلى مترين من الحجر الكلسي.  تمتد عدة أنواع من كهوف الجبل على شكل شبكات مضلعة من التصدعات الأرضية، وبعضها الآخر عبارة عن تجاويف بسبب عمليات الإذابة والتعرية أو الانهيارات.",
                    R.drawable.caves,
                    "المنطقة الشرقية"),

                LocationMarker(
                    25.413591614644428,
                    49.638843410457085,                    "واحة الاحساء",
                    "الأحساء جمع “حِسّي”، وهي الأرض التي تمسك ماء المطر في باطنها ليسهل بعد ذلك استخراجه، أي جاءت تسميتها نسبة لوفرة مياهها وخُصوبة أراضيها. تعتبر واحة الْأَحْسَاء  منطقة تاريخية تقليدية شرق المملكة في محافظة الأحساء ، سهلاً خصبًا محصورًا بين شاطئ الخليج العربي، وصحراء الدهناء والصمان .دخلت موسوعة غنيس للأرقام القياسية كأكبر واحة نخيل في العالم ، حيث تبلغ مساحتها حوالي 85.4 كيلومتر مربع و يقدر عدد نخيلها باكثر من 3 مليون نخلة تتغذى من طبقة مياه جوفية ضخمة ومروية من خلال تدفق أكثر من 280 بئرًا أرتوازيًا، مما يسمح بالزراعة على مدار السنة في منطقة صحراوية رملية. ",
                    R.drawable.ahsaa,
                    "المنطقة الشرقية"),

                LocationMarker(
                    31.397083552316932,
                    37.494811849278584,
                    "قرية كاف",
                    "تقع على بعد عشرين كيلو مترا عن محافظة القريات في منطقة الجوف شمال المملكة، توجد في المنطقة العديد من العيون الكبريتية الجارية، التي تستخدم في ري النخيل، ويرتادها في الوقت الراهن الزوار؛ للعلاج بالمياه الكبريتية من الأمراض الجلدية. وتم اختيار الموقع سياحيا لأهميته التراثية والعلاجية ولتكامله السياحي مع مواقع سياحية مجاورة مثل قصر كاف وقلعة الصعيدي.، وبطرفها الشمالي جبل الصعيدي، وفي أعلاه قلعة تعود للعصر النبطي،",
                    R.drawable.kaf,
                    "منطقة الجوف"),

                LocationMarker(
                    18.250665, //wrong
                    44.451402,
                    "آبار حمى",
                    "تعدُ آبار حمى من أهم المواقع الأثرية في نجران، وهي عبارة عن طريق يمتد بين 6 آبار صخرية، وحُفرت هذه الآبار منذ أكثر من سبعة آلاف سنة. تبعد عن مدينة نجران مسافة 140 كيلو متراً شمالاَ، وهي عبارة عن سبعة آبار صخرية وتعدُ من أشهر الآبار الأثرية التي لا تزال تقدم المياه منذ آلاف السنين وحتى الآن. كما تعدُ آبار حمى من أهم وأبرز مواقع الرسوم والنقوش الصخرية، إذ يوجد في المنطقة الرسوم الآدمية والحيوانية إلى جانب الكتابات بالخط الثمودي والمسند الجنوبي والخط الكوفي، وهو ما يعني أن هذه المنطقة مرت بالعديد من الحضارات منها الحضارة الإسلامية والتي عبّر عنها الخط الكوفي، وتضم منطقة آبار حمى أكثر من 550 لوحة صخرية تحوي الفن والنقوش والتي تعبر عن تاريخ منطقة حمي. تتميز منطقة الآبار بوجود النقوش التاريخية البديعة التي تلفت الأنظار إليها مثل نقوش لسكاكين وأنصال ونقوش صخرية تمثل مناظر جماعات تمارس الرقص مع وجود الآلات الموسيقية، كما توجد مجموعة من النقوش بخط المسند على جرف صخري مرتفع حول الآبار، وهي ربما تحكي قصة أصحاب الأخدود التي نُقشت من قِبل بعض الناجين من المذبحة، التي وقعت في عام 525 للميلاد",
                    R.drawable.hema,
                    "منطقة نجران"),

                LocationMarker(
                    17.478322, //wrong
                    44.181214,
                    "الأُخدود",
                    "تقع الأخدود على ضفاف وادي نجران. الموقع يتمثل في مدينة يحيط بها سور بطول 235م وعرض 220م بنيت أساسات مبانيها من الأحجار المنحوتة بعناية بارتفاعات تتراوح بين 2-4 أمتار. الأُخدود وعرفت سابقاً باسم «رقمات» هي مدينة تاريخية ويعود تاريخ القلعة التي تشكل العنصر الأبرز في الموقع إلى الفترة الممتدة من 500 ق.م إلى منتصف الألف الأول الميلادي، تمثل القلعة الفترة الرئيسية للاستيطان في الأخدود وفي خارج السور تنتشر تلال أثرية تحتوي على أساسات مبان من الحجر ومن الطين. اشتهرت المدينة بالمذبحة التاريخية التي أوقعها ذو نواس الملك الحميري في سنة 520 بحق مسيحيي المنطقة (أصحاب الأخدود) وهو الأمر الذي سجل في القرآن الكريم. فالزائر لقرية الأخدود الأثرية تدهشه العظام الهشة والرماد الكثيف الشاهدة على المحرقة الهائلة التي حدثت في مدينة الأخدود قبل ما يقارب 2020 سنة تقريباً، بالإضافة إلى بقايا الرسوم القديمة بنقوشها المختلفة، كاليد البشرية، والحصان، والجمل والأفاعي المنحوتة على الصخور؛ والأحجار الكبيرة، والرحى العملاقة وبقايا المسجد أحد أبرز تلك الآثار.   أيضا هناك بعض الكتابات والنقوش على الصخر بالخط المسند، الذي كان يستخدمه عرب الجنوب، وينتشر في المدينة الفخار الذي كان الأداة المستخدمة في ذلك الوقت.",
                    R.drawable.akdod,
                    "منطقة نجران"),
                )

            markers.forEach { addMarkerWithPopup(it) }

            //START: Data buttons
            fun locationBtn(buttonId: Int,  mapboxMap: MapboxMap,) {
                val nameButton: Button = findViewById(buttonId)
                nameButton.setOnClickListener {

                    val targetMarker = markers.firstOrNull { it.title == nameButton.text }
                    targetMarker?.let { marker ->
                        showPopup(marker.title, marker.description, marker.imageResId)
                    }

                    val cameraPosition = CameraOptions.Builder()
                        .center(targetMarker?.let { Point.fromLngLat(it.longitude, it.latitude) })
                        .zoom(10.0) // Zoom to the icon
                        .build()

                    mapboxMap.setCamera(cameraPosition)
                }
            }

            val medina = findViewById<TextView>(R.id.medina)
            val medinaList = findViewById<LinearLayout>(R.id.medina_list)
            medina.setOnClickListener {
                if (medinaList.visibility == View.GONE) {
                    medinaList.visibility = View.VISIBLE
                } else {
                    medinaList.visibility = View.GONE
                }
                locationBtn(R.id.feel, mapboxMap)
                locationBtn(R.id.dabos, mapboxMap)
                locationBtn(R.id.gramel, mapboxMap)
                locationBtn(R.id.malsaa,  mapboxMap)
                locationBtn(R.id.baida,  mapboxMap)
                locationBtn(R.id.qadar,  mapboxMap)
                locationBtn(R.id.arosa,  mapboxMap)
                locationBtn(R.id.saleh,  mapboxMap)
                locationBtn(R.id.radwa,  mapboxMap)
            }

            val riyadh = findViewById<TextView>(R.id.riyadh)
            val riyadhList = findViewById<LinearLayout>(R.id.riyadh_list)
            riyadh.setOnClickListener {
                if (riyadhList.visibility == View.GONE) {
                    riyadhList.visibility = View.VISIBLE
                } else {
                    riyadhList.visibility = View.GONE
                }
                locationBtn(R.id.towaiq,  mapboxMap)
                locationBtn(R.id.ainhet,  mapboxMap)
                locationBtn(R.id.green,  mapboxMap)
                locationBtn(R.id.snamh,  mapboxMap)
                locationBtn(R.id.tobad,  mapboxMap)
                locationBtn(R.id.toqy,  mapboxMap)
            }

            val qasim = findViewById<TextView>(R.id.qasim)
            val qasimList = findViewById<LinearLayout>(R.id.qasim_list)
            qasim.setOnClickListener {
                if (qasimList.visibility == View.GONE) {
                    qasimList.visibility = View.VISIBLE
                } else {
                    qasimList.visibility = View.GONE
                }
                locationBtn(R.id.antra, mapboxMap)
                locationBtn(R.id.hourse,  mapboxMap)
            }

            val asir = findViewById<TextView>(R.id.asir)
            val asirList = findViewById<LinearLayout>(R.id.asir_list)
            asir.setOnClickListener {
                if (asirList.visibility == View.GONE) {
                    asirList.visibility = View.VISIBLE
                } else {
                    asirList.visibility = View.GONE
                }
                locationBtn(R.id.hablah,  mapboxMap)
                locationBtn(R.id.columns,  mapboxMap)
                locationBtn(R.id.tanoma,  mapboxMap)
                locationBtn(R.id.kadmbl,  mapboxMap)
                locationBtn(R.id.saira,  mapboxMap)
                locationBtn(R.id.soda,  mapboxMap)
                locationBtn(R.id.jorash,  mapboxMap)
            }

            val jazan = findViewById<TextView>(R.id.jazan)
            val jazanList = findViewById<LinearLayout>(R.id.jazan_list)
            jazan.setOnClickListener {
                if (jazanList.visibility == View.GONE) {
                    jazanList.visibility = View.VISIBLE
                } else {
                    jazanList.visibility = View.GONE
                }
                locationBtn(R.id.khoba,  mapboxMap)
                locationBtn(R.id.lojb,  mapboxMap)
                locationBtn(R.id.farasan,  mapboxMap)
                locationBtn(R.id.fifa,  mapboxMap)
            }

            val tabuk = findViewById<TextView>(R.id.tabuk)
            val tabukList = findViewById<LinearLayout>(R.id.tabuk_list)
            tabuk.setOnClickListener {
                if (tabukList.visibility == View.GONE) {
                    tabukList.visibility = View.VISIBLE
                } else {
                    tabukList.visibility = View.GONE
                }
                locationBtn(R.id.taima,  mapboxMap)
                locationBtn(R.id.desa,  mapboxMap)
                locationBtn(R.id.teran,  mapboxMap)
                locationBtn(R.id.galala,  mapboxMap)
                locationBtn(R.id.lozah,  mapboxMap)
            }

            val mekka = findViewById<TextView>(R.id.mekka)
            val mekkaList = findViewById<LinearLayout>(R.id.mekka_list)
            mekka.setOnClickListener {
                if (mekkaList.visibility == View.GONE) {
                    mekkaList.visibility = View.VISIBLE
                } else {
                    mekkaList.visibility = View.GONE
                }
                locationBtn(R.id.taima2,  mapboxMap)
                locationBtn(R.id.oud,  mapboxMap)
                locationBtn(R.id.dokol,  mapboxMap)

            }


            val hail = findViewById<TextView>(R.id.hail)
            val hailList = findViewById<LinearLayout>(R.id.hail_list)
            hail.setOnClickListener {
                if (hailList.visibility == View.GONE) {
                    hailList.visibility = View.VISIBLE
                } else {
                    hailList.visibility = View.GONE
                }
                locationBtn(R.id.shoifan,  mapboxMap)
                locationBtn(R.id.hailInscriptions,  mapboxMap)
            }

            val east = findViewById<TextView>(R.id.east)
            val eastList = findViewById<LinearLayout>(R.id.east_list)
            east.setOnClickListener {
                if (eastList.visibility == View.GONE) {
                    eastList.visibility = View.VISIBLE
                } else {
                    eastList.visibility = View.GONE
                }
                locationBtn(R.id.tarot,  mapboxMap)
                locationBtn(R.id.harqos,  mapboxMap)
                locationBtn(R.id.caves,  mapboxMap)
                locationBtn(R.id.ahsaa,  mapboxMap)
            }

            val joof = findViewById<TextView>(R.id.joof)
            val joofList = findViewById<LinearLayout>(R.id.joof_list)
            joof.setOnClickListener {
                if (joofList.visibility == View.GONE) {
                    joofList.visibility = View.VISIBLE
                } else {
                    joofList.visibility = View.GONE
                }
                locationBtn(R.id.kaf,  mapboxMap)
            }

            val najran = findViewById<TextView>(R.id.najran)
            val najranList = findViewById<LinearLayout>(R.id.najran_list)
            najran.setOnClickListener {
                if (najranList.visibility == View.GONE) {
                    najranList.visibility = View.VISIBLE
                } else {
                    najranList.visibility = View.GONE
                }
                locationBtn(R.id.akdod,  mapboxMap)
                locationBtn(R.id.hema,  mapboxMap)

            }


            //END: Data buttons
        }
    }

    private fun loadJsonFromAsset(filename: String): String {
        return assets.open(filename).bufferedReader().use { it.readText() }
    }

    private fun drawableToBitmap(drawable: Drawable): Bitmap {
        if (drawable is BitmapDrawable) {
            return drawable.bitmap
        }

        val bitmap = Bitmap.createBitmap(drawable.intrinsicWidth, drawable.intrinsicHeight, Bitmap.Config.ARGB_8888)
        val canvas = Canvas(bitmap)
        drawable.setBounds(0, 0, canvas.width, canvas.height)
        drawable.draw(canvas)

        return bitmap
    }
}
